-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\Fig9.log
  log type:  text
 opened on:  20 Feb 2024, 01:06:42

. 
. global cov lngdp lnp max_temp min_temp windpow

. global ind_C_key C26 C28 C29 C32

. global ind_C_other_heavy C25 C30 C31

. global ind_C_other_nonheavy C27 C33 C34 C35 C36 C37 C38 C39 C40 C41

. global ind C26 C28 C29 C32 C25 C30 C31 C27 C33 C34 C35 C36 C37 C38 C39 C40 C41

. 
. use "Rep_folder\data\Shandong_sample.dta", clear

. cap drop post dudt

. gen post = (ym>=201703)

. gen dudt = post * boundary

. replace city = city1
variable city was str6 now str9
(5,821 real changes made)

. merge m:1 city year using "Rep_folder\data\Shandong_enterprises.dta"
(variable C32 was byte, now int to accommodate using data's values)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             5,821  (_merge==3)
    -----------------------------------------

. drop _merge

. foreach i in $ind{
  2.         cap drop ln`i'
  3.         quietly gen ln`i' = ln(`i')
  4. }

. 
. 
. est drop _all

. cap mat drop results

. foreach i in _supply_num _manu_num $ind_C_key $ind_C_other_heavy $ind_C_other_nonheavy{
  2.         local y = `y' - 2
  3.         // JAPCP-covered boundary
.         quietly reghdfe ln`i' dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id) level(90)
  4.         est store hnhb_`i'
  5.         mat a = r(table)
  6.         local b = a[1,1]
  7.         local ll = a[5,1]
  8.         local ul = a[6,1]
  9.         mat a = [`b', `ll', `ul', 1]
 10.         mat rowname a = "`i'"
 11.         // JAPCP-uncovered boundary
.         quietly reghdfe ln`i' dudt $cov if (js==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id) level(90)
 12.         est store js_`i'
 13.         mat b = r(table)
 14.         local b = b[1,1]
 15.         local ll = b[5,1]
 16.         local ul = b[6,1]
 17.         mat b = [`b', `ll', `ul', 2]
 18.         mat rowname b = "`i'"
 19.         
.         mat results = nullmat(results) \ a \ b
 20. }

. mat colnames results = "b" "ll" "ul" "type"

. mat list results

results[38,4]
                      b          ll          ul        type
_supply_num   .02535672  -.06192327   .11263671           1
_supply_num   .03640537   .00322628   .06958446           2
  _manu_num  -.02973986  -.07479765   .01531793           1
  _manu_num   .02336588   .00090945    .0458223           2
        C26  -.14785474  -.19732075  -.09838873           1
        C26   .08357907   .00472965    .1624285           2
        C28  -.41408691  -.63574328  -.19243053           1
        C28   -.1595016  -.20968984  -.10931335           2
        C29  -.12099796  -.22476238  -.01723355           1
        C29   .08228402   .00234054   .16222751           2
        C32  -.21377868  -.30439594  -.12316143           1
        C32   .14829399   .08747355   .20911443           2
        C25  -.34694167  -.45927415  -.23460919           1
        C25  -.08276738  -.11669164  -.04884313           2
        C30   .11622912   .06581719   .16664106           1
        C30   .03809604  -.02584078   .10203286           2
        C31   .37245589   .10673778     .638174           1
        C31  -.30962982  -.65373109   .03447145           2
        C27  -.30204555   -.4316442  -.17244689           1
        C27  -.08730308  -.22551536    .0509092           2
        C33  -.18475917   -.3003518  -.06916655           1
        C33   .07536175  -.00849044   .15921395           2
        C34  -.14836646  -.33667663   .03994371           1
        C34  -.04666106  -.12075305   .02743094           2
        C35  -.07107103  -.21894917   .07680712           1
        C35  -.11089652  -.13910147  -.08269157           2
        C36  -.15225292   -.3054966   .00099075           1
        C36  -.24335446  -.34476436  -.14194456           2
        C37  -.43197698   -.7563462  -.10760777           1
        C37  -.16653485  -.43190389   .09883419           2
        C38  -.00139891   -.0880041   .08520629           1
        C38   -.0737024  -.16338841   .01598361           2
        C39  -.20428846  -.34729477  -.06128215           1
        C39  -.00136031  -.03549983   .03277922           2
        C40  -.14369709   -.3807815   .09338731           1
        C40  -.02303385  -.07656017   .03049246           2
        C41  -.31568665   -.7204316    .0890583           1
        C41  -.60783186  -.78768093  -.42798278           2

. 
. clear

. svmat results, names(col) 
number of observations will be reset to 38
Press any key to continue, or Break to abort
Number of observations (_N) was 0, now 38.

. gen n = _n

. replace n = 31-n
(38 real changes made)

. 
. twoway (rcap ll ul n if type == 1 , hor lp(solid) lc(gs6)) (scatter n b if type == 1 , mc(gs6) m(oh)) ///
>        (rcap ll ul n if type == 2 , hor lp(solid) lc(gs10)) (scatter n b if type == 2 , mc(gs10) m(oh)), ///
>        xtit("Coefficient") ytit(" ") xsize(3) ysize(2.5) xline(0 , lc(gs12) lp(dash)) ///
>        legend(order(2 "JAPCP-convered provincial boundary" 4 "JAPCP-uncovered provincial boundary") r(2)) ///
>            yline(26.5) yline(18.5) yline(12.5) ylabel(29.5 "Supplying" 27.5 "Manufacturing" 25.5 "C26" 23.5 "C28" 21.5 "C29" ///
>            19.5 "C32" 17.5 "C25" 15.5 "C30" 13.5 "C31" 11.5 "C27" 9.5 "C33" 7.5 "C34" 5.5 "C35" 3.5 "C36" 1.5 "C37" -0.5 ///
>            "C38" -2.5 "C39" -4.5 "C40" -6.5 "C41", nogrid) text(25 0.25 "A. Key regulated industries", size(small) place(right)) ///
>            text(17 0.25 "B. Other polluting industries", size(small) place(right)) ///
>            text(11 0.25 "C. Low-polluting industries", size(small) place(right))

. 
. graph export "Rep_folder\output_figures\Fig9.pdf", replace
file Rep_folder\output_figures\Fig9.pdf saved as PDF format

. 
. log close
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\Fig9.log
  log type:  text
 closed on:  20 Feb 2024, 01:06:46
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
