-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\Table1.log
  log type:  text
 opened on:  20 Feb 2024, 01:13:16

. 
. global cov lngdp lnp max_temp min_temp windpow

. 
. use "Rep_folder\data\Shandong_sample.dta", clear

. 
. xtset monitor_id ym

Panel variable: monitor_id (unbalanced)
 Time variable: ym, 201501 to 201912, but with gaps
         Delta: 1 unit

. cap drop post dudt

. gen post = (ym>=201703)

. gen dudt = post * boundary

. 
. quietly reghdfe lnAQI dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym) cluster(monitor_id)

. gen nomiss = e(sample)

. quietly reghdfe lnAQI dudt $cov if (js==1|boundary==0), absorb(monitor_id ym) cluster(monitor_id)

. replace nomiss = e(sample) if nomiss==0
(264 real changes made)

. 
. drop if nomiss!=1
(492 observations deleted)

. 
. * Desdcriptive statistics
. gen group = 1 if boundary==0
(745 missing values generated)

. replace group = 2 if boundary==1&hnhb==1
(481 real changes made)

. replace group = 3 if boundary==1&js==1
(264 real changes made)

. label define group 1 "non-boundary area" 2 "JAPCP-covered boundary" 3 "JAPCP-uncovered boundary"

. label values group group

. 
. ** Total
. sum AQI PM25 PM10 CO NO2 gdp population max_temp min_temp windpow ///
>         industry_num manu_num supply_num C25 C26 C28 C29 C30 C31 C32, sep(0)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         AQI |      5,329     86.4964    32.23046         25   303.3937
        PM25 |      5,328    54.27157    28.28023          8   266.5119
        PM10 |      5,327    102.0642     47.4105   21.04772   1461.851
          CO |      5,319    1.004059    .4831116   .0447112   5.804692
         NO2 |      5,329    35.17046    14.63876          1   114.3844
         gdp |      5,329    667.4743    470.7448     126.57    3554.44
  population |      5,329    77.36546    31.69472     20.792     160.82
    max_temp |      5,329    19.26024    9.831444  -.3870968       34.7
    min_temp |      5,329    9.924546    9.806165  -8.935484   26.29032
     windpow |      5,329    2.857847    1.008725          1   5.145161
industry_num |      4,778    268.5352    217.1995         10        986
    manu_num |      5,233    627.4116    300.7479        182       1560
  supply_num |      5,233      39.309    15.77658         12         85
         C25 |      5,233    14.87445    18.22118          0        106
         C26 |      5,233    190.2822    120.6917         21        624
         C28 |      5,233    5.423658    2.589003          0         12
         C29 |      5,233    131.8215    83.76848          5        310
         C30 |      5,233     225.644    117.3751         32        609
         C31 |      5,233     32.1802    26.65866          2        134
         C32 |      5,233    27.18555    15.82299          1         71

. 
. ** By area
. bysort group: sum AQI PM25 PM10 CO NO2 gdp population max_temp min_temp windpow ///
>                                   industry_num manu_num supply_num C25 C26 C28 C29 C30 C31 C32, sep(0)

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> group = non-boundary area

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         AQI |      4,584    82.84335    30.11573         25   227.7309
        PM25 |      4,583    51.27698    26.26089          8   182.4028
        PM10 |      4,582    96.98193    45.69727   21.04772   1461.851
          CO |      4,574    .9698966    .4679442   .0447112   4.354368
         NO2 |      4,584    34.66443    14.81184          1   114.3844
         gdp |      4,584    707.0931     490.304     126.57    3554.44
  population |      4,584    75.30268    29.66015     20.792     160.82
    max_temp |      4,584    19.07018     9.83777  -.3870968       34.7
    min_temp |      4,584    9.864665    9.797483  -8.935484   26.29032
     windpow |      4,584    2.967932    1.021098          1   5.145161
industry_num |      4,177      280.47    227.9577         10        986
    manu_num |      4,524    622.2175    312.6538        182       1560
  supply_num |      4,524    41.07869    15.83771         12         85
         C25 |      4,524    15.17927    19.49015          0        106
         C26 |      4,524     188.477    126.5907         21        624
         C28 |      4,524    5.430371    2.394216          0         12
         C29 |      4,524    136.5321    87.60072          5        310
         C30 |      4,524    219.2171    118.8477         32        609
         C31 |      4,524    30.59063    23.19208          2        112
         C32 |      4,524    26.79111    14.87134          1         71

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> group = JAPCP-covered boundary

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         AQI |        481    111.0234    36.28306   49.74441   303.3937
        PM25 |        481    74.43001    33.76759   24.10915   266.5119
        PM10 |        481     135.662    46.95407   48.05593   408.1431
          CO |        481    1.346355    .5463216   .5186441   5.804692
         NO2 |        481    38.51951    12.99366   12.79692   86.22305
         gdp |        481    518.6867    167.6791     261.14   834.9286
  population |        481     112.681    31.17892       63.3     152.03
    max_temp |        481    20.49868    9.916128   .7741935       34.6
    min_temp |        481    10.10117    10.00799  -8.741936   25.83871
     windpow |        481    2.263501    .5777137          1   3.866667
industry_num |        481    172.0624     78.4733         81        313
    manu_num |        481    640.4096     128.794        372        862
  supply_num |        481    26.87734    5.844827         16         37
         C25 |        481    13.66944     4.83745          4         20
         C26 |        481    209.5405    73.01717         73        319
         C28 |        481    5.611227     2.93836          1         11
         C29 |        481    93.12058    27.13005         29        125
         C30 |        481    242.8129    67.06519        121        323
         C31 |        481    47.21622    45.77712          3        134
         C32 |        481    28.43867     17.9402          7         58

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> group = JAPCP-uncovered boundary

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         AQI |        264    105.2393    33.94143   45.82351   195.0934
        PM25 |        264    69.52918    31.14675   19.92611   155.1953
        PM10 |        264    129.0582    43.31276    46.5342   237.4301
          CO |        264     .972289    .3628171    .320537   2.354877
         NO2 |        264    37.85512     13.3363   7.055524   69.83764
         gdp |        264    250.6341    81.18479     159.62      405.4
  population |        264    48.83909    8.642049         33       57.8
    max_temp |        264    20.30409    9.361816   3.322581   33.16129
    min_temp |        264    10.64251    9.587618  -5.870968   26.16129
     windpow |        264    2.029248      .53771          1        3.8
industry_num |        120       239.8    43.63285        158        292
    manu_num |        228    703.0526    308.6603        365       1075
  supply_num |        228    30.42105    14.05082         15         54
         C25 |        228    11.36842    4.089878          7         18
         C26 |        228    185.4737    65.44894        106        269
         C28 |        228    4.894737     4.65434          0         12
         C29 |        228         120    59.32127         55        199
         C30 |        228    316.9474    129.4885        188        481
         C31 |        228          32    26.50376          2         78
         C32 |        228    32.36842    25.49571          5         62


.         
. 
. log close
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\Table1.log
  log type:  text
 closed on:  20 Feb 2024, 01:13:16
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
