-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA11.log
  log type:  text
 opened on:  20 Feb 2024, 01:26:21

. 
. global cov lngdp lnp max_temp min_temp windpow

. 
. use "Rep_folder\data\Shandong_sample.dta", clear

. cap drop post dudt

. gen post = (ym>=201703)

. gen dudt = post * boundary

. gen ln_key_regulated = ln(C26 + C28 + C29 + C32)
(192 missing values generated)

. gen ln_others = ln(C25 + C30 + C31)
(192 missing values generated)

. est drop _all

. 
. /* Regression */
. 
. ** JAPCP-covered boundary
. reghdfe lnC26 dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      1,635
Absorbing 3 HDFE groups                           F(   6,     36) =      12.10
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9126
                                                  Adj R-squared   =     0.9064
                                                  Within R-sq.    =     0.0372
Number of clusters (monitor_id) =         37      Root MSE        =     0.2014

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC26 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.1424131   .0474458    -3.00   0.005    -.2386377   -.0461885
       lngdp |   -.050306   .0872713    -0.58   0.568    -.2273003    .1266884
         lnp |  -.0456868   .4154659    -0.11   0.913    -.8882907     .796917
    max_temp |   .0171448   .0236292     0.73   0.473    -.0307773     .065067
    min_temp |   .0453422   .0127894     3.55   0.001     .0194042    .0712803
     windpow |  -.0664491   .0305256    -2.18   0.036    -.1283579   -.0045404
       _cons |   5.075649   1.785856     2.84   0.007     1.453764    8.697533
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_C26

. reghdfe lnC28 dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      1,635
Absorbing 3 HDFE groups                           F(   6,     36) =      33.70
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7202
                                                  Adj R-squared   =     0.7004
                                                  Within R-sq.    =     0.1586
Number of clusters (monitor_id) =         37      Root MSE        =     0.2582

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC28 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.4624089   .1549314    -2.98   0.005    -.7766243   -.1481934
       lngdp |   .4380177   .1629324     2.69   0.011     .1075754      .76846
         lnp |  -1.450781   .6383891    -2.27   0.029    -2.745495   -.1560683
    max_temp |  -.1017697   .0268294    -3.79   0.001    -.1561822   -.0473573
    min_temp |   .1157125   .0230806     5.01   0.000     .0689028    .1625222
     windpow |   .0895835   .0564122     1.59   0.121    -.0248256    .2039926
       _cons |    5.87374   2.822415     2.08   0.045     .1496169    11.59786
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_C28

. reghdfe lnC29 dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      1,635
Absorbing 3 HDFE groups                           F(   6,     36) =      10.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9134
                                                  Adj R-squared   =     0.9072
                                                  Within R-sq.    =     0.1109
Number of clusters (monitor_id) =         37      Root MSE        =     0.1855

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC29 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.1971026   .0626057    -3.15   0.003    -.3240728   -.0701324
       lngdp |  -.2342267   .1144028    -2.05   0.048    -.4662464   -.0022071
         lnp |  -.7441243   .4198113    -1.77   0.085    -1.595541    .1072924
    max_temp |   .0046178   .0238344     0.19   0.847    -.0437207    .0529563
    min_temp |    .052618    .021989     2.39   0.022     .0080222    .0972138
     windpow |  -.0606831   .0339308    -1.79   0.082     -.129498    .0081317
       _cons |   8.533272   1.964468     4.34   0.000     4.549146     12.5174
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_C29

. reghdfe lnC32 dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      1,635
Absorbing 3 HDFE groups                           F(   6,     36) =      43.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9240
                                                  Adj R-squared   =     0.9186
                                                  Within R-sq.    =     0.2138
Number of clusters (monitor_id) =         37      Root MSE        =     0.1663

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC32 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.3439578   .0689159    -4.99   0.000    -.4837257   -.2041898
       lngdp |   .2522944   .0937045     2.69   0.011     .0622528     .442336
         lnp |   .4444263   .3426866     1.30   0.203    -.2505742    1.139427
    max_temp |  -.0258873   .0236529    -1.09   0.281    -.0738576    .0220831
    min_temp |  -.0122749   .0237176    -0.52   0.608    -.0603764    .0358266
     windpow |  -.0000248   .0391164    -0.00   0.999    -.0793566     .079307
       _cons |   .3803749   1.555012     0.24   0.808    -2.773336    3.534085
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_C32

. reghdfe lnC25 dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      1,635
Absorbing 3 HDFE groups                           F(   6,     36) =      16.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9304
                                                  Adj R-squared   =     0.9255
                                                  Within R-sq.    =     0.2068
Number of clusters (monitor_id) =         37      Root MSE        =     0.1509

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC25 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   -.308648   .0811837    -3.80   0.001    -.4732961   -.1439999
       lngdp |   .2891644   .1087863     2.66   0.012     .0685356    .5097932
         lnp |  -1.551127   .4329688    -3.58   0.001    -2.429229   -.6730261
    max_temp |  -.0534362   .0169197    -3.16   0.003    -.0877509   -.0191215
    min_temp |   .0363015   .0130377     2.78   0.008     .0098599    .0627431
     windpow |  -.1273724    .046773    -2.72   0.010    -.2222325   -.0325124
       _cons |   8.747206    1.59815     5.47   0.000     5.506009     11.9884
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_C25

. reghdfe lnC30 dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      1,635
Absorbing 3 HDFE groups                           F(   6,     36) =      13.90
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9125
                                                  Adj R-squared   =     0.9063
                                                  Within R-sq.    =     0.0952
Number of clusters (monitor_id) =         37      Root MSE        =     0.1663

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC30 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.0767199   .0438835    -1.75   0.089    -.1657197      .01228
       lngdp |   .3834225   .0854353     4.49   0.000     .2101517    .5566932
         lnp |   -.377671   .3579472    -1.06   0.298    -1.103622    .3482795
    max_temp |  -.0117902   .0239046    -0.49   0.625    -.0602709    .0366906
    min_temp |   .0497023   .0152632     3.26   0.002      .018747    .0806575
     windpow |    -.04427   .0257417    -1.72   0.094    -.0964765    .0079366
       _cons |   4.495532   1.621085     2.77   0.009      1.20782    7.783244
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_C30

. reghdfe lnC31 dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      1,635
Absorbing 3 HDFE groups                           F(   6,     36) =      22.77
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8638
                                                  Adj R-squared   =     0.8542
                                                  Within R-sq.    =     0.1232
Number of clusters (monitor_id) =         37      Root MSE        =     0.3010

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC31 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.1440831   .2134272    -0.68   0.504    -.5769335    .2887673
       lngdp |   .8027934   .1928728     4.16   0.000     .4116292    1.193958
         lnp |  -2.238121   .6078734    -3.68   0.001    -3.470945   -1.005297
    max_temp |  -.1073287   .0306925    -3.50   0.001    -.1695759   -.0450815
    min_temp |  -.0077265   .0530036    -0.15   0.885    -.1152229    .0997698
     windpow |  -.0290348   .0520986    -0.56   0.581    -.1346958    .0766261
       _cons |   10.20098    2.78148     3.67   0.001     4.559875    15.84208
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_C31

. 
. ** JAPCP-uncovered boundary
. reghdfe lnC26 dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 14 iterations)

HDFE Linear regression                            Number of obs   =      3,230
Absorbing 3 HDFE groups                           F(   6,     67) =       2.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0346
                                                  R-squared       =     0.9785
                                                  Adj R-squared   =     0.9775
                                                  Within R-sq.    =     0.0124
Number of clusters (monitor_id) =         68      Root MSE        =     0.0853

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC26 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0453836   .0319367     1.42   0.160    -.0183624    .1091296
       lngdp |   .0239988   .0658715     0.36   0.717    -.1074812    .1554789
         lnp |   .1629143   .2674333     0.61   0.544    -.3708849    .6967135
    max_temp |  -.0011259   .0030781    -0.37   0.716    -.0072698    .0050181
    min_temp |   .0033934   .0047691     0.71   0.479    -.0061257    .0129125
     windpow |   .0155214   .0179715     0.86   0.391    -.0203499    .0513927
       _cons |   4.094817   1.099096     3.73   0.000     1.901013    6.288622
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_C26

. reghdfe lnC28 dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =      3,038
Absorbing 3 HDFE groups                           F(   6,     67) =       9.29
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9414
                                                  Adj R-squared   =     0.9385
                                                  Within R-sq.    =     0.0098
Number of clusters (monitor_id) =         68      Root MSE        =     0.1324

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC28 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.0808827   .0302504    -2.67   0.009    -.1412628   -.0205025
       lngdp |  -.1338346   .1469663    -0.91   0.366    -.4271806    .1595114
         lnp |   .1861443   .3774083     0.49   0.623    -.5671658    .9394543
    max_temp |  -.0044933   .0053841    -0.83   0.407      -.01524    .0062533
    min_temp |   .0081479   .0068703     1.19   0.240    -.0055653    .0218612
     windpow |   .0058346   .0474637     0.12   0.903    -.0889035    .1005726
       _cons |   1.684861   1.424596     1.18   0.241    -1.158645    4.528367
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        10           1           9     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_C28

. reghdfe lnC29 dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 14 iterations)

HDFE Linear regression                            Number of obs   =      3,230
Absorbing 3 HDFE groups                           F(   6,     67) =       3.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0019
                                                  R-squared       =     0.9660
                                                  Adj R-squared   =     0.9644
                                                  Within R-sq.    =     0.0945
Number of clusters (monitor_id) =         68      Root MSE        =     0.1196

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC29 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0561904   .0298452     1.88   0.064    -.0033809    .1157617
       lngdp |   .1081446    .108122     1.00   0.321    -.1076678    .3239569
         lnp |   1.236788   .3869713     3.20   0.002     .4643898    2.009186
    max_temp |  -.0055548   .0052424    -1.06   0.293    -.0160188    .0049091
    min_temp |  -.0051994    .007236    -0.72   0.475    -.0196425    .0092437
     windpow |   .0535657   .0272907     1.96   0.054    -.0009068    .1080382
       _cons |  -1.081638   1.853053    -0.58   0.561    -4.780348    2.617072
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_C29

. reghdfe lnC32 dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 14 iterations)

HDFE Linear regression                            Number of obs   =      3,230
Absorbing 3 HDFE groups                           F(   6,     67) =      12.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9559
                                                  Adj R-squared   =     0.9539
                                                  Within R-sq.    =     0.0446
Number of clusters (monitor_id) =         68      Root MSE        =     0.1764

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC32 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .1825552   .0344328     5.30   0.000     .1138271    .2512832
       lngdp |   .0909065   .1645173     0.55   0.582    -.2374715    .4192844
         lnp |   .9400149   .6921959     1.36   0.179     -.441614    2.321644
    max_temp |   .0019717    .006911     0.29   0.776    -.0118228    .0157662
    min_temp |   .0132595   .0099414     1.33   0.187    -.0065835    .0331025
     windpow |   .0292494   .0267686     1.09   0.278    -.0241809    .0826797
       _cons |  -1.818021   3.000182    -0.61   0.547     -7.80641    4.170367
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_C32

. reghdfe lnC25 dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 14 iterations)

HDFE Linear regression                            Number of obs   =      3,023
Absorbing 3 HDFE groups                           F(   6,     67) =      17.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9884
                                                  Adj R-squared   =     0.9878
                                                  Within R-sq.    =     0.2239
Number of clusters (monitor_id) =         68      Root MSE        =     0.1063

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC25 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.0536484   .0274686    -1.95   0.055     -.108476    .0011792
       lngdp |   .3934706   .1114499     3.53   0.001     .1710155    .6159256
         lnp |  -1.931946    .701076    -2.76   0.008      -3.3313   -.5325926
    max_temp |   .0108497   .0038152     2.84   0.006     .0032345    .0184649
    min_temp |   .0045398   .0060774     0.75   0.458    -.0075907    .0166704
     windpow |  -.1335434   .0212414    -6.29   0.000    -.1759415   -.0911453
       _cons |   7.892558   2.745112     2.88   0.005     2.413291    13.37182
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_C25

. reghdfe lnC30 dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 14 iterations)

HDFE Linear regression                            Number of obs   =      3,230
Absorbing 3 HDFE groups                           F(   6,     67) =       5.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.9610
                                                  Adj R-squared   =     0.9592
                                                  Within R-sq.    =     0.0357
Number of clusters (monitor_id) =         68      Root MSE        =     0.1003

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC30 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0806943   .0215275     3.75   0.000     .0377252    .1236635
       lngdp |  -.1296173   .0836263    -1.55   0.126     -.296536    .0373014
         lnp |   .6728742   .1977185     3.40   0.001     .2782266    1.067522
    max_temp |   .0035586   .0040467     0.88   0.382    -.0045185    .0116358
    min_temp |   .0035473   .0057798     0.61   0.541    -.0079892    .0150839
     windpow |  -.0217095   .0219699    -0.99   0.327    -.0655616    .0221427
       _cons |   3.136029   .6981549     4.49   0.000     1.742506    4.529552
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_C30

. reghdfe lnC31 dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 14 iterations)

HDFE Linear regression                            Number of obs   =      3,230
Absorbing 3 HDFE groups                           F(   6,     67) =       8.77
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9086
                                                  Adj R-squared   =     0.9044
                                                  Within R-sq.    =     0.0400
Number of clusters (monitor_id) =         68      Root MSE        =     0.3070

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnC31 | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.0346526   .1772572    -0.20   0.846    -.3884595    .3191543
       lngdp |  -.1305428   .1551513    -0.84   0.403    -.4402262    .1791405
         lnp |  -.1239609   1.474781    -0.08   0.933    -3.067636    2.819715
    max_temp |  -.0421647   .0194152    -2.17   0.033    -.0809176   -.0034119
    min_temp |   .0116662   .0340932     0.34   0.733    -.0563841    .0797165
     windpow |   .2071512   .0356661     5.81   0.000     .1359614     .278341
       _cons |   4.370087   5.875715     0.74   0.460    -7.357889    16.09806
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_C31

. 
. ** Panel A
. esttab hnhb_C*, mtitle se(%6.3f) b(%6.3f) ar2 star(* 0.1 ** 0.05 *** 0.01) keep(dudt)

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
                 hnhb_C26        hnhb_C28        hnhb_C29        hnhb_C32        hnhb_C25        hnhb_C30        hnhb_C31   
----------------------------------------------------------------------------------------------------------------------------
dudt               -0.142***       -0.462***       -0.197***       -0.344***       -0.309***       -0.077*         -0.144   
                  (0.047)         (0.155)         (0.063)         (0.069)         (0.081)         (0.044)         (0.213)   
----------------------------------------------------------------------------------------------------------------------------
N                    1635            1635            1635            1635            1635            1635            1635   
adj. R-sq           0.906           0.700           0.907           0.919           0.925           0.906           0.854   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. ** Panel B
. esttab js_C*, mtitle se(%6.3f) b(%6.3f) ar2 star(* 0.1 ** 0.05 *** 0.01) keep(dudt)

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
                   js_C26          js_C28          js_C29          js_C32          js_C25          js_C30          js_C31   
----------------------------------------------------------------------------------------------------------------------------
dudt                0.045          -0.081***        0.056*          0.183***       -0.054*          0.081***       -0.035   
                  (0.032)         (0.030)         (0.030)         (0.034)         (0.027)         (0.022)         (0.177)   
----------------------------------------------------------------------------------------------------------------------------
N                    3230            3038            3230            3230            3023            3230            3230   
adj. R-sq           0.978           0.939           0.964           0.954           0.988           0.959           0.904   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. 
. 
. /* Coefficient comparison */
. global ind_list lnC26 lnC28 lnC29 lnC32 lnC25 lnC30 lnC31

. foreach var in dudt $ind_list $cov{
  2.         bysort monitor_id: center `var', prefix(c_) // Add monitoring station fixed effects through demeaning
  3. }
(generated variables: c_dudt)
(generated variables: c_lnC26)
(generated variables: c_lnC28)
(generated variables: c_lnC29)
(generated variables: c_lnC32)
(generated variables: c_lnC25)
(generated variables: c_lnC30)
(generated variables: c_lnC31)
(generated variables: c_lngdp)
(generated variables: c_lnp)
(generated variables: c_max_temp)
(generated variables: c_min_temp)
(generated variables: c_windpow)

. global c_cov c_lngdp c_lnp c_max_temp c_min_temp c_windpow

. 
. reg c_lnC26 c_dudt $c_cov i.ym i.winddir if (hnhb==1|boundary==0)&(policy_city==1)

      Source |       SS           df       MS      Number of obs   =     1,635
-------------+----------------------------------   F(71, 1563)     =     24.43
       Model |  82.0060194        71  1.15501436   Prob > F        =    0.0000
    Residual |  73.8845651     1,563  .047270995   R-squared       =    0.5260
-------------+----------------------------------   Adj R-squared   =    0.5045
       Total |  155.890585     1,634  .095404274   Root MSE        =    .21742

------------------------------------------------------------------------------
     c_lnC26 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.1356454   .0301049    -4.51   0.000    -.1946957   -.0765951
     c_lngdp |  -.0323676   .0489142    -0.66   0.508     -.128312    .0635767
       c_lnp |  -.3892739   .1385308    -2.81   0.005    -.6609997   -.1175482
  c_max_temp |  -.0217042   .0144847    -1.50   0.134    -.0501158    .0067073
  c_min_temp |    .026482   .0107633     2.46   0.014       .00537     .047594
   c_windpow |  -.2284073   .0250144    -9.13   0.000    -.2774726    -.179342
             |
          ym |
     201502  |   .0056995   .0615038     0.09   0.926    -.1149391    .1263381
     201503  |   .0953081   .1209496     0.79   0.431    -.1419324    .3325485
     201504  |   .1307827   .1692285     0.77   0.440    -.2011562    .4627215
     201505  |   .0035246    .243781     0.01   0.988    -.4746477     .481697
     201506  |  -.0657299   .2917257    -0.23   0.822    -.6379449    .5064851
     201507  |   -.272758   .3115786    -0.88   0.381    -.8839141     .338398
     201508  |  -.2846296   .2928798    -0.97   0.331    -.8591082     .289849
     201509  |  -.2660534   .2466585    -1.08   0.281    -.7498699    .2177631
     201510  |  -.1087017   .1915778    -0.57   0.571    -.4844782    .2670748
     201511  |  -.1658021   .0828594    -2.00   0.046    -.3283294   -.0032748
     201512  |   -.114415   .0626515    -1.83   0.068    -.2373048    .0084747
     201601  |  -.2914521   .0797684    -3.65   0.000    -.4479164   -.1349879
     201602  |  -.2426321   .0690737    -3.51   0.000    -.3781191   -.1071451
     201603  |  -.1926547   .1387039    -1.39   0.165    -.4647199    .0794106
     201604  |  -.2333188   .2270484    -1.03   0.304    -.6786704    .2120327
     201605  |  -.1958651   .2549085    -0.77   0.442    -.6958638    .3041336
     201606  |  -.1815402   .3059843    -0.59   0.553    -.7817232    .4186428
     201607  |  -.3012013   .3107128    -0.97   0.333    -.9106592    .3082566
     201608  |  -.2601959   .2945127    -0.88   0.377    -.8378775    .3174856
     201609  |  -.1154833   .2632399    -0.44   0.661    -.6318239    .4008572
     201610  |  -.0952101   .1814222    -0.52   0.600    -.4510667    .2606465
     201611  |  -.0585699   .0925702    -0.63   0.527    -.2401448    .1230051
     201612  |   -.053255    .064508    -0.83   0.409    -.1797864    .0732763
     201701  |  -.1206404   .0644204    -1.87   0.061        -.247    .0057192
     201702  |  -.0644608    .067297    -0.96   0.338    -.1964628    .0675412
     201703  |  -.0478352   .1075218    -0.44   0.656    -.2587373     .163067
     201704  |  -.0134298   .1931806    -0.07   0.945    -.3923502    .3654906
     201705  |   .0582865   .2712815     0.21   0.830    -.4738275    .5904006
     201706  |  -.0918037   .2922998    -0.31   0.754    -.6651448    .4815373
     201707  |  -.1412941    .314188    -0.45   0.653    -.7575684    .4749802
     201708  |    -.28372   .2917236    -0.97   0.331    -.8559309    .2884909
     201709  |  -.1978217   .2642048    -0.75   0.454    -.7160549    .3204114
     201710  |  -.1456343   .1616341    -0.90   0.368    -.4626769    .1714083
     201711  |   .0306407   .1010569     0.30   0.762    -.1675808    .2288621
     201712  |  -.0278034   .0588299    -0.47   0.637    -.1431972    .0875905
     201801  |  -.2098826   .0744644    -2.82   0.005    -.3559433   -.0638219
     201802  |  -.0418782   .0629376    -0.67   0.506    -.1653291    .0815728
     201803  |   .0199304   .1277521     0.16   0.876    -.2306532     .270514
     201804  |   .0195478   .1933891     0.10   0.919    -.3597815    .3988772
     201805  |  -.2202118   .2476403    -0.89   0.374     -.705954    .2655304
     201806  |  -.2720717   .3092095    -0.88   0.379    -.8785808    .3344374
     201807  |  -.3408515   .3251494    -1.05   0.295    -.9786266    .2969235
     201808  |  -.4198043   .3067665    -1.37   0.171    -1.021521    .1819128
     201809  |  -.3531323   .2417725    -1.46   0.144    -.8273649    .1211003
     201810  |  -.2065195   .1736366    -1.19   0.234    -.5471046    .1340656
     201811  |  -.3046205   .1078342    -2.82   0.005    -.5161355   -.0931056
     201812  |  -.3293435   .0662748    -4.97   0.000    -.4593405   -.1993466
     201901  |  -.6087399   .0671026    -9.07   0.000    -.7403606   -.4771192
     201902  |  -.7784443   .0693845   -11.22   0.000    -.9145408   -.6423478
     201903  |    -.58198   .1299824    -4.48   0.000    -.8369384   -.3270217
     201904  |  -.6601222   .1736714    -3.80   0.000    -1.000776   -.3194686
     201905  |  -.6401778    .263327    -2.43   0.015    -1.156689   -.1236664
     201906  |   -.676032   .3238622    -2.09   0.037    -1.311282   -.0407819
     201907  |  -.7507697   .3207243    -2.34   0.019    -1.379865   -.1216744
     201908  |  -.7510045   .2805827    -2.68   0.008    -1.301363   -.2006464
     201909  |  -.7833013   .2601796    -3.01   0.003    -1.293639   -.2729633
     201910  |   -.776146   .1810198    -4.29   0.000    -1.131213   -.4210788
     201911  |  -.6303177   .1058328    -5.96   0.000    -.8379069   -.4227284
     201912  |  -.6900716   .0657513   -10.50   0.000    -.8190416   -.5611017
             |
     winddir |
     东南风  |  -.1171417   .0311128    -3.77   0.000    -.1781689   -.0561145
       北风  |  -.1534392   .0274427    -5.59   0.000    -.2072676   -.0996108
       南风  |  -.1678821    .022884    -7.34   0.000    -.2127687   -.1229955
 无持续风向  |  -.0521883   .0584546    -0.89   0.372    -.1668461    .0624694
     西北风  |  -.0910321   .0429827    -2.12   0.034    -.1753419   -.0067223
     西南风  |   .0612275   .0271666     2.25   0.024     .0079406    .1145144
             |
       _cons |   .3476923   .1670004     2.08   0.038     .0201239    .6752607
------------------------------------------------------------------------------

. est store hnhb_C26

. reg c_lnC26 c_dudt $c_cov i.ym i.winddir if (js==1|boundary==0)&(policy_city==0)

      Source |       SS           df       MS      Number of obs   =     3,230
-------------+----------------------------------   F(76, 3153)     =     93.94
       Model |  57.5393749        76  .757097038   Prob > F        =    0.0000
    Residual |   25.411083     3,153  .008059335   R-squared       =    0.6937
-------------+----------------------------------   Adj R-squared   =    0.6863
       Total |  82.9504578     3,229   .02568921   Root MSE        =    .08977

------------------------------------------------------------------------------
     c_lnC26 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |   .0415362   .0135327     3.07   0.002     .0150024      .06807
     c_lngdp |  -.0309384   .0208527    -1.48   0.138    -.0718247    .0099479
       c_lnp |   .1253147   .0765314     1.64   0.102    -.0247417    .2753711
  c_max_temp |  -.0048715   .0021211    -2.30   0.022    -.0090305   -.0007125
  c_min_temp |  -.0012383   .0028492    -0.43   0.664    -.0068248    .0043483
   c_windpow |   .0216664   .0054653     3.96   0.000     .0109506    .0323823
             |
          ym |
     201502  |   .0072967   .0165392     0.44   0.659    -.0251319    .0397253
     201503  |   .0538527   .0239318     2.25   0.025     .0069293    .1007761
     201504  |   .1193905   .0328096     3.64   0.000     .0550601    .1837209
     201505  |   .1260991   .0441166     2.86   0.004      .039599    .2125993
     201506  |    .161319    .053115     3.04   0.002     .0571755    .2654624
     201507  |   .1712286   .0593157     2.89   0.004     .0549274    .2875298
     201508  |   .1704277   .0595621     2.86   0.004     .0536433    .2872121
     201509  |   .1336412   .0499431     2.68   0.007     .0357169    .2315654
     201510  |   .0970729   .0370456     2.62   0.009      .024437    .1697087
     201511  |   .0320294   .0237519     1.35   0.178    -.0145414    .0786001
     201512  |   .0036897   .0175336     0.21   0.833    -.0306886    .0380681
     201601  |  -.0316651   .0216055    -1.47   0.143    -.0740273    .0106971
     201602  |  -.0139917   .0214061    -0.65   0.513     -.055963    .0279797
     201603  |   .0453521   .0266151     1.70   0.088    -.0068324    .0975367
     201604  |   .0987483   .0394789     2.50   0.012     .0213414    .1761553
     201605  |   .1228346   .0465277     2.64   0.008      .031607    .2140621
     201606  |   .1439631   .0561689     2.56   0.010     .0338317    .2540945
     201607  |   .1420829   .0631045     2.25   0.024     .0183528     .265813
     201608  |   .1401572   .0624817     2.24   0.025     .0176482    .2626662
     201609  |   .1058887   .0512758     2.07   0.039     .0053513    .2064261
     201610  |   .0421664   .0377688     1.12   0.264    -.0318875    .1162203
     201611  |  -.0061143   .0232147    -0.26   0.792    -.0516318    .0394032
     201612  |  -.0365408   .0173441    -2.11   0.035    -.0705476   -.0025339
     201701  |  -.1907196   .0167371   -11.40   0.000    -.2235363    -.157903
     201702  |  -.1781079   .0171515   -10.38   0.000    -.2117372   -.1444786
     201703  |  -.1515041   .0214312    -7.07   0.000    -.1935246   -.1094837
     201704  |   -.092086    .035109    -2.62   0.009    -.1609247   -.0232473
     201705  |  -.0666073   .0462409    -1.44   0.150    -.1572726     .024058
     201706  |  -.0276157    .053247    -0.52   0.604     -.132018    .0767865
     201707  |  -.0070875   .0638559    -0.11   0.912    -.1322909    .1181159
     201708  |  -.0309322   .0596713    -0.52   0.604    -.1479308    .0860664
     201709  |  -.0406482    .050998    -0.80   0.425    -.1406407    .0593443
     201710  |  -.0981768   .0355673    -2.76   0.006    -.1679143   -.0284394
     201711  |  -.1118668   .0236642    -4.73   0.000    -.1582656    -.065468
     201712  |  -.2099436   .0175311   -11.98   0.000    -.2443172   -.1755701
     201801  |    -.25586   .0182089   -14.05   0.000    -.2915624   -.2201576
     201802  |  -.2228392   .0186593   -11.94   0.000    -.2594249   -.1862536
     201803  |  -.1811493   .0244787    -7.40   0.000     -.229145   -.1331535
     201804  |  -.1492194   .0333557    -4.47   0.000    -.2146204   -.0838184
     201805  |  -.1337206   .0443132    -3.02   0.003    -.2206063    -.046835
     201806  |  -.0772454   .0540272    -1.43   0.153    -.1831774    .0286866
     201807  |  -.0682391   .0628455    -1.09   0.278    -.1914613     .054983
     201808  |  -.0692868   .0630403    -1.10   0.272     -.192891    .0543174
     201809  |  -.1098561   .0489913    -2.24   0.025    -.2059142   -.0137981
     201810  |  -.1460918   .0342023    -4.27   0.000    -.2131529   -.0790307
     201811  |  -.1671646   .0255358    -6.55   0.000    -.2172331   -.1170962
     201812  |  -.2193467   .0201832   -10.87   0.000    -.2589201   -.1797732
     201901  |  -.3605285   .0200205   -18.01   0.000    -.3997831   -.3212739
     201902  |  -.3573928   .0200609   -17.82   0.000    -.3967266   -.3180591
     201903  |    -.31845   .0250861   -12.69   0.000    -.3676366   -.2692633
     201904  |  -.2828424   .0329156    -8.59   0.000    -.3473804   -.2183043
     201905  |  -.2349836   .0470576    -4.99   0.000    -.3272503    -.142717
     201906  |  -.2198536    .054892    -4.01   0.000    -.3274812   -.1122261
     201907  |  -.1997754   .0629021    -3.18   0.002    -.3231086   -.0764421
     201908  |  -.2052009   .0600679    -3.42   0.001    -.3229771   -.0874247
     201909  |  -.1949131   .0540149    -3.61   0.000    -.3008211   -.0890051
     201910  |   -.256307   .0392106    -6.54   0.000    -.3331878   -.1794261
     201911  |  -.3134904   .0265547   -11.81   0.000    -.3655567   -.2614241
     201912  |   -.349491   .0208286   -16.78   0.000      -.39033   -.3086519
             |
     winddir |
东北风~北风  |  -.0235762   .0654936    -0.36   0.719    -.1519905    .1048381
     东南风  |     .03588   .0111498     3.22   0.001     .0140184    .0577417
       东风  |   .0078898   .0173538     0.45   0.649    -.0261361    .0419156
       北风  |   .0174024   .0097941     1.78   0.076    -.0018011    .0366059
  北风~南风  |   -.005791   .0274231    -0.21   0.833      -.05956     .047978
       南风  |   .0019696   .0103236     0.19   0.849    -.0182719    .0222112
南风~东南风  |  -.0180189   .0655134    -0.28   0.783     -.146472    .1104343
  南风~北风  |  -.0442813   .0391184    -1.13   0.258    -.1209815    .0324189
 无持续风向  |  -.0353387   .0138742    -2.55   0.011    -.0625421   -.0081354
     西北风  |   .0337613   .0097361     3.47   0.001     .0146716     .052851
     西南风  |  -.0027775   .0129818    -0.21   0.831    -.0282313    .0226762
             |
       _cons |   .0592134   .0333568     1.78   0.076    -.0061898    .1246167
------------------------------------------------------------------------------

. est store js_C26

. suest hnhb_C26 js_C26, vce(cluster monitor_id)

Simultaneous results for hnhb_C26, js_C26                Number of obs = 4,865

                             (Std. err. adjusted for 105 clusters in monitor_id)
--------------------------------------------------------------------------------
               |               Robust
               | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
hnhb_C26_mean  |
        c_dudt |  -.1356454   .0574653    -2.36   0.018    -.2482752   -.0230155
       c_lngdp |  -.0323676   .0903342    -0.36   0.720    -.2094194    .1446842
         c_lnp |  -.3892739   .3651017    -1.07   0.286     -1.10486    .3263123
    c_max_temp |  -.0217042     .02392    -0.91   0.364    -.0685865    .0251781
    c_min_temp |    .026482   .0126289     2.10   0.036     .0017298    .0512343
     c_windpow |  -.2284073   .0710975    -3.21   0.001    -.3677558   -.0890589
               |
            ym |
       201502  |   .0056995     .04782     0.12   0.905    -.0880259     .099425
       201503  |   .0953081   .2350984     0.41   0.685    -.3654763    .5560924
       201504  |   .1307827   .3577106     0.37   0.715    -.5703172    .8318825
       201505  |   .0035246   .5401343     0.01   0.995    -1.055119    1.062168
       201506  |  -.0657299   .6533149    -0.10   0.920    -1.346204    1.214744
       201507  |   -.272758   .7094089    -0.38   0.701    -1.663174    1.117658
       201508  |  -.2846296   .6675477    -0.43   0.670    -1.592999     1.02374
       201509  |  -.2660534   .5654342    -0.47   0.638    -1.374284    .8421773
       201510  |  -.1087017     .42326    -0.26   0.797    -.9382759    .7208726
       201511  |  -.1658021   .1149522    -1.44   0.149    -.3911043    .0595001
       201512  |   -.114415   .0295185    -3.88   0.000    -.1722703   -.0565598
       201601  |  -.2914521   .1194288    -2.44   0.015    -.5255282   -.0573761
       201602  |  -.2426321   .0866128    -2.80   0.005      -.41239   -.0728742
       201603  |  -.1926547    .294583    -0.65   0.513    -.7700267    .3847174
       201604  |  -.2333188   .5127545    -0.46   0.649    -1.238299    .7716615
       201605  |  -.1958651   .5748621    -0.34   0.733    -1.322574    .9308439
       201606  |  -.1815402   .6923477    -0.26   0.793    -1.538517    1.175436
       201607  |  -.3012013   .7114898    -0.42   0.672    -1.695696    1.093293
       201608  |  -.2601959   .6712928    -0.39   0.698    -1.575906    1.055514
       201609  |  -.1154833   .5916045    -0.20   0.845    -1.275007     1.04404
       201610  |  -.0952101   .3933624    -0.24   0.809    -.8661864    .6757661
       201611  |  -.0585699   .1681178    -0.35   0.728    -.3880747    .2709349
       201612  |   -.053255   .0484962    -1.10   0.272    -.1483058    .0417957
       201701  |  -.1206404   .0524181    -2.30   0.021    -.2233781   -.0179027
       201702  |  -.0644608   .0709137    -0.91   0.363     -.203449    .0745274
       201703  |  -.0478352   .2070683    -0.23   0.817    -.4536815    .3580112
       201704  |  -.0134298   .4186156    -0.03   0.974    -.8339014    .8070418
       201705  |   .0582865   .6009396     0.10   0.923    -1.119533    1.236106
       201706  |  -.0918037   .6576267    -0.14   0.889    -1.380728    1.197121
       201707  |  -.1412941   .7104587    -0.20   0.842    -1.533768    1.251179
       201708  |    -.28372   .6682053    -0.42   0.671    -1.593378    1.025938
       201709  |  -.1978217   .5941571    -0.33   0.739    -1.362348    .9667047
       201710  |  -.1456343   .3483151    -0.42   0.676    -.8283194    .5370507
       201711  |   .0306407   .1833926     0.17   0.867    -.3288023    .3900836
       201712  |  -.0278034   .0250245    -1.11   0.267    -.0768505    .0212438
       201801  |  -.2098826   .0898489    -2.34   0.019    -.3859832   -.0337821
       201802  |  -.0418782   .0530246    -0.79   0.430    -.1458045    .0620481
       201803  |   .0199304   .2573988     0.08   0.938     -.484562    .5244227
       201804  |   .0195478    .416652     0.05   0.963    -.7970752    .8361708
       201805  |  -.2202118   .5592475    -0.39   0.694    -1.316317    .8758932
       201806  |  -.2720717    .703761    -0.39   0.699    -1.651418    1.107274
       201807  |  -.3408515   .7396221    -0.46   0.645    -1.790484    1.108781
       201808  |  -.4198043   .7077729    -0.59   0.553    -1.807014     .967405
       201809  |  -.3531323   .5428524    -0.65   0.515    -1.417103    .7108388
       201810  |  -.2065195   .3731477    -0.55   0.580    -.9378756    .5248366
       201811  |  -.3046205   .2210982    -1.38   0.168    -.7379651     .128724
       201812  |  -.3293435   .0631865    -5.21   0.000    -.4531868   -.2055002
       201901  |  -.6087399   .1073071    -5.67   0.000    -.8190579   -.3984219
       201902  |  -.7784443   .2021143    -3.85   0.000    -1.174581   -.3823076
       201903  |    -.58198    .317383    -1.83   0.067    -1.204039    .0400792
       201904  |  -.6601222   .4447526    -1.48   0.138    -1.531821    .2115769
       201905  |  -.6401778   .6395325    -1.00   0.317    -1.893638    .6132829
       201906  |   -.676032   .7774393    -0.87   0.385    -2.199785     .847721
       201907  |  -.7507697   .7920864    -0.95   0.343    -2.303231    .8016911
       201908  |  -.7510045   .6961737    -1.08   0.281     -2.11548    .6134708
       201909  |  -.7833013   .6614852    -1.18   0.236    -2.079788    .5131859
       201910  |   -.776146   .4826654    -1.61   0.108    -1.722153    .1698608
       201911  |  -.6303177   .2811811    -2.24   0.025    -1.181422   -.0792129
       201912  |  -.6900716   .1728688    -3.99   0.000    -1.028888   -.3512551
               |
       winddir |
       东南风  |  -.1171417   .0875803    -1.34   0.181    -.2887959    .0545124
         北风  |  -.1534392   .0805445    -1.91   0.057    -.3113035     .004425
         南风  |  -.1678821   .0827815    -2.03   0.043    -.3301308   -.0056334
   无持续风向  |  -.0521883   .0744481    -0.70   0.483    -.1981039    .0937272
       西北风  |  -.0910321    .043512    -2.09   0.036    -.1763141   -.0057502
       西南风  |   .0612275     .02337     2.62   0.009     .0154232    .1070318
               |
         _cons |   .3476923   .4009112     0.87   0.386    -.4380793    1.133464
---------------+----------------------------------------------------------------
hnhb_C26_lnvar |
         _cons |  -3.051858   .3528651    -8.65   0.000    -3.743461   -2.360256
---------------+----------------------------------------------------------------
js_C26_mean    |
        c_dudt |   .0415362   .0272819     1.52   0.128    -.0119354    .0950078
       c_lngdp |  -.0309384   .0698699    -0.44   0.658    -.1678809    .1060041
         c_lnp |   .1253147   .2601937     0.48   0.630    -.3846555    .6352849
    c_max_temp |  -.0048715   .0035376    -1.38   0.168    -.0118051    .0020621
    c_min_temp |  -.0012383   .0057024    -0.22   0.828    -.0124147    .0099382
     c_windpow |   .0216664   .0176702     1.23   0.220    -.0129666    .0562994
               |
            ym |
       201502  |   .0072967   .0047257     1.54   0.123    -.0019654    .0165589
       201503  |   .0538527    .032436     1.66   0.097    -.0097208    .1174261
       201504  |   .1193905   .0609233     1.96   0.050    -.0000169    .2387979
       201505  |   .1260991   .0897815     1.40   0.160    -.0498693    .3020676
       201506  |    .161319   .1126678     1.43   0.152    -.0595059    .3821438
       201507  |   .1712286   .1303502     1.31   0.189    -.0842532    .4267104
       201508  |   .1704277   .1297196     1.31   0.189    -.0838182    .4246735
       201509  |   .1336412   .1063104     1.26   0.209    -.0747234    .3420057
       201510  |   .0970729   .0748008     1.30   0.194     -.049534    .2436798
       201511  |   .0320294   .0377761     0.85   0.397    -.0420104    .1060691
       201512  |   .0036897   .0102797     0.36   0.720    -.0164582    .0238376
       201601  |  -.0316651   .0429767    -0.74   0.461    -.1158979    .0525677
       201602  |  -.0139917    .046988    -0.30   0.766    -.1060864    .0781031
       201603  |   .0453521   .0585035     0.78   0.438    -.0693125    .1600168
       201604  |   .0987483   .0933944     1.06   0.290    -.0843013     .281798
       201605  |   .1228346   .1107472     1.11   0.267    -.0942259    .3398951
       201606  |   .1439631   .1319802     1.09   0.275    -.1147134    .4026396
       201607  |   .1420829   .1496546     0.95   0.342    -.1512347    .4354005
       201608  |   .1401572   .1417482     0.99   0.323    -.1376642    .4179785
       201609  |   .1058887   .1086016     0.98   0.330    -.1069666     .318744
       201610  |   .0421664   .0768279     0.55   0.583    -.1084136    .1927463
       201611  |  -.0061143   .0360005    -0.17   0.865    -.0766741    .0644455
       201612  |  -.0365408   .0149333    -2.45   0.014    -.0658094   -.0072721
       201701  |  -.1907196   .0253394    -7.53   0.000     -.240384   -.1410553
       201702  |  -.1781079   .0270202    -6.59   0.000    -.2310666   -.1251492
       201703  |  -.1515041   .0379008    -4.00   0.000    -.2257883     -.07722
       201704  |   -.092086   .0723441    -1.27   0.203    -.2338779    .0497059
       201705  |  -.0666073   .0973434    -0.68   0.494    -.2573969    .1241823
       201706  |  -.0276157   .1167539    -0.24   0.813    -.2564491    .2012177
       201707  |  -.0070875   .1411996    -0.05   0.960    -.2838336    .2696586
       201708  |  -.0309322   .1300528    -0.24   0.812     -.285831    .2239666
       201709  |  -.0406482   .1117131    -0.36   0.716    -.2596019    .1783055
       201710  |  -.0981768    .074621    -1.32   0.188    -.2444313    .0480776
       201711  |  -.1118668   .0401019    -2.79   0.005    -.1904651   -.0332684
       201712  |  -.2099436   .0250657    -8.38   0.000    -.2590715   -.1608157
       201801  |    -.25586   .0332393    -7.70   0.000    -.3210078   -.1907123
       201802  |  -.2228392   .0339304    -6.57   0.000    -.2893415   -.1563369
       201803  |  -.1811493   .0446159    -4.06   0.000    -.2685949   -.0937037
       201804  |  -.1492194   .0661244    -2.26   0.024    -.2788208    -.019618
       201805  |  -.1337206   .0909018    -1.47   0.141    -.3118848    .0444435
       201806  |  -.0772454   .1176871    -0.66   0.512     -.307908    .1534171
       201807  |  -.0682391   .1366461    -0.50   0.618    -.3360605    .1995823
       201808  |  -.0692868   .1376612    -0.50   0.615    -.3390977    .2005241
       201809  |  -.1098561   .1083835    -1.01   0.311    -.3222839    .1025716
       201810  |  -.1460918   .0707588    -2.06   0.039    -.2847765   -.0074072
       201811  |  -.1671646   .0555005    -3.01   0.003    -.2759437   -.0583856
       201812  |  -.2193467    .042644    -5.14   0.000    -.3029273   -.1357661
       201901  |  -.3605285   .0366984    -9.82   0.000     -.432456   -.2886009
       201902  |  -.3573928   .0361583    -9.88   0.000    -.4282618   -.2865239
       201903  |    -.31845   .0495902    -6.42   0.000    -.4156449    -.221255
       201904  |  -.2828424   .0716122    -3.95   0.000    -.4231997    -.142485
       201905  |  -.2349836   .1070498    -2.20   0.028    -.4447974   -.0251699
       201906  |  -.2198536   .1286981    -1.71   0.088    -.4720973    .0323901
       201907  |  -.1997754   .1472545    -1.36   0.175    -.4883889    .0888382
       201908  |  -.2052009   .1392162    -1.47   0.140    -.4780596    .0676578
       201909  |  -.1949131    .123739    -1.58   0.115    -.4374372     .047611
       201910  |   -.256307   .0899427    -2.85   0.004    -.4325913   -.0800226
       201911  |  -.3134904   .0563652    -5.56   0.000    -.4239643   -.2030166
       201912  |   -.349491   .0367525    -9.51   0.000    -.4215246   -.2774574
               |
       winddir |
  东北风~北风  |  -.0235762   .0192129    -1.23   0.220    -.0612328    .0140804
       东南风  |     .03588   .0105507     3.40   0.001      .015201    .0565591
         东风  |   .0078898   .0119625     0.66   0.510    -.0155562    .0313358
         北风  |   .0174024   .0081488     2.14   0.033     .0014311    .0333737
    北风~南风  |   -.005791   .0190655    -0.30   0.761    -.0431587    .0315767
         南风  |   .0019696   .0080162     0.25   0.806    -.0137418    .0176811
  南风~东南风  |  -.0180189   .0179641    -1.00   0.316    -.0532279    .0171902
    南风~北风  |  -.0442813   .0204203    -2.17   0.030    -.0843044   -.0042582
   无持续风向  |  -.0353387    .015756    -2.24   0.025    -.0662199   -.0044576
       西北风  |   .0337613   .0118525     2.85   0.004     .0105308    .0569917
       西南风  |  -.0027775   .0152105    -0.18   0.855    -.0325896    .0270346
               |
         _cons |   .0592134   .0709919     0.83   0.404    -.0799281    .1983549
---------------+----------------------------------------------------------------
js_C26_lnvar   |
         _cons |  -4.820924   .1039973   -46.36   0.000    -5.024755   -4.617093
--------------------------------------------------------------------------------

. test [hnhb_C26_mean]c_dudt = [js_C26_mean]c_dudt

 ( 1)  [hnhb_C26_mean]c_dudt - [js_C26_mean]c_dudt = 0

           chi2(  1) =    7.76
         Prob > chi2 =    0.0053

. 
. reg c_lnC28 c_dudt $c_cov i.ym i.winddir if (hnhb==1|boundary==0)&(policy_city==1)

      Source |       SS           df       MS      Number of obs   =     1,635
-------------+----------------------------------   F(71, 1563)     =      5.93
       Model |  28.6452601        71  .403454368   Prob > F        =    0.0000
    Residual |  106.262143     1,563  .067986016   R-squared       =    0.2123
-------------+----------------------------------   Adj R-squared   =    0.1766
       Total |  134.907403     1,634   .08256267   Root MSE        =    .26074

------------------------------------------------------------------------------
     c_lnC28 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.4752513   .0361036   -13.16   0.000    -.5460678   -.4044347
     c_lngdp |   .4592677   .0586607     7.83   0.000     .3442057    .5743297
       c_lnp |  -1.609977   .1661341    -9.69   0.000    -1.935846   -1.284108
  c_max_temp |  -.1163072   .0173709    -6.70   0.000    -.1503799   -.0822344
  c_min_temp |   .1126013    .012908     8.72   0.000     .0872825      .13792
   c_windpow |  -.0748469   .0299987    -2.50   0.013    -.1336889    -.016005
             |
          ym |
     201502  |   .0132989   .0737588     0.18   0.857    -.1313778    .1579756
     201503  |   .2118001   .1450496     1.46   0.144    -.0727123    .4963125
     201504  |   .1460681   .2029486     0.72   0.472     -.252012    .5441482
     201505  |   .1197928   .2923562     0.41   0.682    -.4536589    .6932445
     201506  |   .1421417   .3498542     0.41   0.685    -.5440914    .8283748
     201507  |  -.1264447   .3736629    -0.34   0.735    -.8593781    .6064888
     201508  |   -.122342   .3512382    -0.35   0.728    -.8112898    .5666058
     201509  |  -.0449896   .2958071    -0.15   0.879    -.6252102    .5352309
     201510  |   .1703636   .2297511     0.74   0.458    -.2802891    .6210164
     201511  |  -.3901534   .0993698    -3.93   0.000    -.5850655   -.1952413
     201512  |  -.2370529   .0751352    -3.16   0.002    -.3844294   -.0896764
     201601  |  -.2277192   .0956628    -2.38   0.017    -.4153601   -.0400782
     201602  |  -.1542337   .0828372    -1.86   0.063    -.3167174    .0082501
     201603  |   .0270899   .1663416     0.16   0.871    -.2991864    .3533661
     201604  |    .196212   .2722895     0.72   0.471    -.3378791    .7303031
     201605  |   .2498344   .3057009     0.82   0.414    -.3497927    .8494615
     201606  |   .1140253   .3669539     0.31   0.756    -.6057486    .8337992
     201607  |  -.1075434   .3726247    -0.29   0.773    -.8384404    .6233535
     201608  |  -.2188555   .3531965    -0.62   0.536    -.9116444    .4739334
     201609  |   .1221288   .3156924     0.39   0.699    -.4970965     .741354
     201610  |  -.1655219    .217572    -0.76   0.447    -.5922855    .2612418
     201611  |  -.1458133   .1110155    -1.31   0.189    -.3635684    .0719418
     201612  |  -.2661509   .0773617    -3.44   0.001    -.4178946   -.1144073
     201701  |  -.4507739   .0772567    -5.83   0.000    -.6023116   -.2992362
     201702  |  -.1487558   .0807065    -1.84   0.065    -.3070601    .0095486
     201703  |   .1108858   .1289463     0.86   0.390    -.1420402    .3638117
     201704  |   .1392833   .2316733     0.60   0.548    -.3151399    .5937064
     201705  |   .2189273   .3253364     0.67   0.501    -.4192145     .857069
     201706  |   .0868713   .3505427     0.25   0.804    -.6007122    .7744549
     201707  |  -.2617764   .3767922    -0.69   0.487    -1.000848    .4772952
     201708  |  -.2815139   .3498517    -0.80   0.421    -.9677421    .4047142
     201709  |    -.09544   .3168495    -0.30   0.763    -.7169349    .5260549
     201710  |  -.2384227   .1938409    -1.23   0.219    -.6186384     .141793
     201711  |   .0275167   .1211933     0.23   0.820    -.2102018    .2652352
     201712  |  -.1152975   .0705522    -1.63   0.102    -.2536844    .0230894
     201801  |  -.2057611    .089302    -2.30   0.021    -.3809254   -.0305967
     201802  |   .0630772   .0754783     0.84   0.403    -.0849722    .2111267
     201803  |   .1735769   .1532077     1.13   0.257    -.1269374    .4740911
     201804  |   .2134261   .2319233     0.92   0.358    -.2414875    .6683396
     201805  |   .1099739   .2969845     0.37   0.711     -.472556    .6925039
     201806  |     .11554   .3708218     0.31   0.755    -.6118206    .8429006
     201807  |  -.1540176   .3899379    -0.39   0.693    -.9188741    .6108389
     201808  |  -.1373638    .367892    -0.37   0.709    -.8589776      .58425
     201809  |  -.0206078   .2899475    -0.07   0.943    -.5893348    .5481192
     201810  |   .2285693   .2082349     1.10   0.273      -.17988    .6370186
     201811  |  -.0248711    .129321    -0.19   0.848     -.278532    .2287898
     201812  |  -.1034539   .0794806    -1.30   0.193    -.2593537    .0524459
     201901  |  -.1590755   .0804733    -1.98   0.048    -.3169226   -.0012285
     201902  |  -.0435466   .0832099    -0.52   0.601    -.2067614    .1196681
     201903  |   .2189695   .1558824     1.40   0.160    -.0867912    .5247301
     201904  |    .202475   .2082767     0.97   0.331    -.2060563    .6110062
     201905  |   .2905852   .3157969     0.92   0.358     -.328845    .9100153
     201906  |   .3043856   .3883941     0.78   0.433    -.4574428    1.066214
     201907  |  -.0510215    .384631    -0.13   0.894    -.8054687    .7034257
     201908  |  -.0794773   .3364908    -0.24   0.813    -.7394983    .5805438
     201909  |   .0686873   .3120224     0.22   0.826    -.5433393    .6807138
     201910  |   .2156503   .2170893     0.99   0.321    -.2101666    .6414673
     201911  |   .0197014   .1269208     0.16   0.877    -.2292515    .2686543
     201912  |  -.0481423   .0788527    -0.61   0.542    -.2028105    .1065259
             |
     winddir |
     东南风  |   .1891329   .0373122     5.07   0.000     .1159456    .2623202
       北风  |   .1266149   .0329109     3.85   0.000     .0620608     .191169
       南风  |   .1003935   .0274438     3.66   0.000     .0465629    .1542241
 无持续风向  |   .0066687   .0701021     0.10   0.924    -.1308355    .1441728
     西北风  |   .0231945   .0515473     0.45   0.653    -.0779147    .1243037
     西南风  |   .0932582   .0325798     2.86   0.004     .0293534    .1571629
             |
       _cons |  -.0748858   .2002765    -0.37   0.709    -.4677247    .3179531
------------------------------------------------------------------------------

. est store hnhb_C28

. reg c_lnC28 c_dudt $c_cov i.ym i.winddir if (js==1|boundary==0)&(policy_city==0)

      Source |       SS           df       MS      Number of obs   =     3,038
-------------+----------------------------------   F(74, 2963)     =     20.89
       Model |   27.159113        74  .367015041   Prob > F        =    0.0000
    Residual |  52.0580905     2,963  .017569386   R-squared       =    0.3428
-------------+----------------------------------   Adj R-squared   =    0.3264
       Total |  79.2172036     3,037  .026084031   Root MSE        =    .13255

------------------------------------------------------------------------------
     c_lnC28 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.0916375   .0238066    -3.85   0.000    -.1383166   -.0449584
     c_lngdp |  -.1522238   .0318301    -4.78   0.000    -.2146351   -.0898125
       c_lnp |   .1507545   .1186256     1.27   0.204    -.0818424    .3833515
  c_max_temp |  -.0062962   .0032262    -1.95   0.051    -.0126221    .0000297
  c_min_temp |   .0084548   .0043593     1.94   0.053    -.0000928    .0170023
   c_windpow |   .0243161   .0087647     2.77   0.006     .0071306    .0415016
             |
          ym |
     201502  |   .0008286   .0257214     0.03   0.974     -.049605    .0512622
     201503  |   .0604122   .0376351     1.61   0.109    -.0133814    .1342058
     201504  |   .0166713   .0514417     0.32   0.746    -.0841937    .1175363
     201505  |   .0046778   .0682065     0.07   0.945    -.1290591    .1384147
     201506  |   .0018669   .0818842     0.02   0.982    -.1586888    .1624226
     201507  |   -.008928   .0917532    -0.10   0.922    -.1888344    .1709784
     201508  |  -.0170247   .0922509    -0.18   0.854    -.1979071    .1638577
     201509  |  -.0118807   .0772467    -0.15   0.878    -.1633432    .1395819
     201510  |  -.0125166   .0575362    -0.22   0.828    -.1253316    .1002984
     201511  |  -.0336472   .0369716    -0.91   0.363    -.1061398    .0388454
     201512  |  -.0055649   .0274368    -0.20   0.839    -.0593621    .0482323
     201601  |  -.0557303   .0333482    -1.67   0.095    -.1211182    .0096576
     201602  |  -.0621212   .0336324    -1.85   0.065    -.1280664     .003824
     201603  |  -.0779488   .0415038    -1.88   0.060     -.159328    .0034304
     201604  |  -.0699092   .0615541    -1.14   0.256    -.1906022    .0507839
     201605  |  -.0749658   .0725186    -1.03   0.301    -.2171577    .0672262
     201606  |   -.092003   .0876454    -1.05   0.294     -.263855    .0798491
     201607  |  -.1798435   .0979165    -1.84   0.066    -.3718347    .0121477
     201608  |  -.1705612   .0964227    -1.77   0.077    -.3596235     .018501
     201609  |  -.1457638   .0793475    -1.84   0.066    -.3013455    .0098179
     201610  |  -.1790476   .0585148    -3.06   0.002    -.2937813   -.0643139
     201611  |  -.1506575   .0364398    -4.13   0.000    -.2221074   -.0792077
     201612  |  -.1394748    .027232    -5.12   0.000    -.1928703   -.0860794
     201701  |   .0178982   .0252686     0.71   0.479    -.0316475     .067444
     201702  |   .0291445   .0259537     1.12   0.262    -.0217446    .0800336
     201703  |   .0514459   .0326824     1.57   0.116    -.0126366    .1155285
     201704  |   .0155852   .0540005     0.29   0.773    -.0902971    .1214676
     201705  |   .0324487   .0712546     0.46   0.649    -.1072649    .1721623
     201706  |    .016535   .0820744     0.20   0.840    -.1443937    .1774637
     201707  |  -.0139959    .098356    -0.14   0.887    -.2068489     .178857
     201708  |  -.0461643   .0916541    -0.50   0.615    -.2258764    .1335478
     201709  |   .0056593   .0785729     0.07   0.943    -.1484036    .1597223
     201710  |  -.0079981   .0546121    -0.15   0.884    -.1150796    .0990835
     201711  |   .0584312   .0361823     1.61   0.106    -.0125138    .1293763
     201712  |   .0221782   .0265395     0.84   0.403    -.0298594    .0742159
     201801  |   .0768987   .0274265     2.80   0.005     .0231218    .1306756
     201802  |   .1124612   .0283611     3.97   0.000     .0568517    .1680707
     201803  |   .0957589   .0376521     2.54   0.011     .0219321    .1695858
     201804  |   .0803425   .0513717     1.56   0.118    -.0203854    .1810703
     201805  |   .0550818   .0682059     0.81   0.419     -.078654    .1888176
     201806  |   .0649858   .0832213     0.78   0.435    -.0981916    .2281633
     201807  |   .0228215   .0967426     0.24   0.814     -.166868     .212511
     201808  |   .0145893   .0970063     0.15   0.880    -.1756171    .2047958
     201809  |   .0396362   .0752114     0.53   0.598    -.1078356    .1871081
     201810  |   .0939931    .052454     1.79   0.073     -.008857    .1968431
     201811  |   .0839184   .0390759     2.15   0.032     .0072997     .160537
     201812  |   .1195279    .030721     3.89   0.000     .0592912    .1797646
     201901  |  -.0988239    .031195    -3.17   0.002      -.15999   -.0376578
     201902  |  -.1189986   .0313553    -3.80   0.000     -.180479   -.0575182
     201903  |  -.1241102   .0388891    -3.19   0.001    -.2003627   -.0478578
     201904  |  -.1749265   .0508642    -3.44   0.001    -.2746592   -.0751938
     201905  |  -.1839712   .0722363    -2.55   0.011    -.3256096   -.0423327
     201906  |  -.2231322   .0842974    -2.65   0.008    -.3884195   -.0578448
     201907  |  -.2364525   .0969163    -2.44   0.015    -.4264825   -.0464224
     201908  |  -.2098121   .0927259    -2.26   0.024    -.3916257   -.0279985
     201909  |  -.1530343   .0835525    -1.83   0.067    -.3168611    .0107926
     201910  |  -.1411289   .0603982    -2.34   0.020    -.2595556   -.0227023
     201911  |   -.138391   .0413485    -3.35   0.001    -.2194657   -.0573162
     201912  |  -.1625318   .0324794    -5.00   0.000    -.2262163   -.0988473
             |
     winddir |
     东南风  |   .0779005   .0174566     4.46   0.000     .0436723    .1121288
       东风  |   .1005712   .0265829     3.78   0.000     .0484484     .152694
       北风  |   .0199679   .0149402     1.34   0.181    -.0093264    .0492622
  北风~南风  |  -.1451718   .0464456    -3.13   0.002    -.2362408   -.0541029
       南风  |  -.0175667   .0159612    -1.10   0.271    -.0488629    .0137294
  南风~北风  |  -.0543794   .0714242    -0.76   0.447    -.1944254    .0856666
 无持续风向  |  -.0309097   .0275973    -1.12   0.263    -.0850214    .0232021
     西北风  |  -.0009429   .0148126    -0.06   0.949    -.0299868    .0281011
     西南风  |   .0399055   .0198544     2.01   0.045     .0009757    .0788354
             |
       _cons |   .0322592   .0514735     0.63   0.531    -.0686682    .1331867
------------------------------------------------------------------------------

. est store js_C28

. suest hnhb_C28 js_C28, vce(cluster monitor_id)

Simultaneous results for hnhb_C28, js_C28                Number of obs = 4,673

                             (Std. err. adjusted for 105 clusters in monitor_id)
--------------------------------------------------------------------------------
               |               Robust
               | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
hnhb_C28_mean  |
        c_dudt |  -.4752513   .1529861    -3.11   0.002    -.7750986   -.1754039
       c_lngdp |   .4592677   .1629148     2.82   0.005     .1399605    .7785749
         c_lnp |  -1.609977   .5312018    -3.03   0.002    -2.651113   -.5688404
    c_max_temp |  -.1163072   .0252211    -4.61   0.000    -.1657396   -.0668747
    c_min_temp |   .1126013   .0201409     5.59   0.000     .0731259    .1520767
     c_windpow |  -.0748469   .0747281    -1.00   0.317    -.2213114    .0716175
               |
            ym |
       201502  |   .0132989   .0344972     0.39   0.700    -.0543144    .0809121
       201503  |   .2118001   .1429037     1.48   0.138    -.0682861    .4918862
       201504  |   .1460681   .2047663     0.71   0.476    -.2552664    .5474027
       201505  |   .1197928   .2783986     0.43   0.667    -.4258584    .6654439
       201506  |   .1421417   .3206906     0.44   0.658    -.4864004    .7706838
       201507  |  -.1264447   .3260525    -0.39   0.698    -.7654959    .5126066
       201508  |   -.122342   .3038298    -0.40   0.687    -.7178374    .4731534
       201509  |  -.0449896   .2570475    -0.18   0.861    -.5487934    .4588142
       201510  |   .1703636   .2043737     0.83   0.405    -.2302014    .5709286
       201511  |  -.3901534   .0883007    -4.42   0.000    -.5632196   -.2170872
       201512  |  -.2370529    .050894    -4.66   0.000    -.3368034   -.1373024
       201601  |  -.2277192   .1118935    -2.04   0.042    -.4470263    -.008412
       201602  |  -.1542337   .0735666    -2.10   0.036    -.2984215   -.0100459
       201603  |   .0270899   .1227579     0.22   0.825    -.2135111    .2676908
       201604  |    .196212   .2298192     0.85   0.393    -.2542253    .6466493
       201605  |   .2498344   .2587774     0.97   0.334      -.25736    .7570288
       201606  |   .1140253    .313704     0.36   0.716    -.5008232    .7288737
       201607  |  -.1075434   .3113804    -0.35   0.730    -.7178379     .502751
       201608  |  -.2188555   .2863821    -0.76   0.445     -.780154     .342443
       201609  |   .1221288   .2705887     0.45   0.652    -.4082153    .6524729
       201610  |  -.1655219   .1764774    -0.94   0.348    -.5114111    .1803674
       201611  |  -.1458133   .0744112    -1.96   0.050    -.2916566      .00003
       201612  |  -.2661509   .0431802    -6.16   0.000    -.3507827   -.1815192
       201701  |  -.4507739   .0760853    -5.92   0.000    -.5998983   -.3016494
       201702  |  -.1487558   .0712774    -2.09   0.037     -.288457   -.0090545
       201703  |   .1108858   .1277788     0.87   0.386    -.1395561    .3613277
       201704  |   .1392833   .2257577     0.62   0.537    -.3031937    .5817603
       201705  |   .2189273   .3282738     0.67   0.505    -.4244775    .8623321
       201706  |   .0868713   .3248788     0.27   0.789    -.5498795    .7236221
       201707  |  -.2617764    .325166    -0.81   0.421    -.8990901    .3755373
       201708  |  -.2815139   .2875004    -0.98   0.327    -.8450044    .2819765
       201709  |    -.09544   .2742957    -0.35   0.728    -.6330497    .4421697
       201710  |  -.2384227   .1581418    -1.51   0.132    -.5483748    .0715295
       201711  |   .0275167   .1279387     0.22   0.830    -.2232384    .2782719
       201712  |  -.1152975   .0676266    -1.70   0.088    -.2478431    .0172481
       201801  |  -.2057611   .0692803    -2.97   0.003    -.3415479   -.0699743
       201802  |   .0630772   .0642821     0.98   0.326    -.0629135    .1890679
       201803  |   .1735769   .1674602     1.04   0.300     -.154639    .5017928
       201804  |   .2134261   .2421823     0.88   0.378    -.2612425    .6880946
       201805  |   .1099739   .2685121     0.41   0.682    -.4163001     .636248
       201806  |     .11554   .3313566     0.35   0.727    -.5339069     .764987
       201807  |  -.1540176   .3292121    -0.47   0.640    -.7992615    .4912263
       201808  |  -.1373638   .3135868    -0.44   0.661    -.7519826    .4772549
       201809  |  -.0206078   .2433208    -0.08   0.933    -.4975079    .4562923
       201810  |   .2285693   .1894831     1.21   0.228    -.1428107    .5999494
       201811  |  -.0248711   .1009729    -0.25   0.805    -.2227744    .1730321
       201812  |  -.1034539    .045773    -2.26   0.024    -.1931673   -.0137405
       201901  |  -.1590755   .1323604    -1.20   0.229    -.4184971     .100346
       201902  |  -.0435466   .1602697    -0.27   0.786    -.3576694    .2705761
       201903  |   .2189695   .1527018     1.43   0.152    -.0803206    .5182595
       201904  |    .202475   .1916912     1.06   0.291    -.1732329    .5781829
       201905  |   .2905852   .2871116     1.01   0.311    -.2721433    .8533137
       201906  |   .3043856   .3465953     0.88   0.380    -.3749287    .9836998
       201907  |  -.0510215   .3151132    -0.16   0.871     -.668632     .566589
       201908  |  -.0794773   .2752456    -0.29   0.773    -.6189486    .4599941
       201909  |   .0686873   .2598495     0.26   0.792    -.4406083    .5779828
       201910  |   .2156503   .1956656     1.10   0.270    -.1678471    .5991478
       201911  |   .0197014   .1185733     0.17   0.868    -.2126979    .2521007
       201912  |  -.0481423   .1301576    -0.37   0.711    -.3032465    .2069618
               |
       winddir |
       东南风  |   .1891329   .0550341     3.44   0.001     .0812681    .2969977
         北风  |   .1266149   .0460009     2.75   0.006     .0364547    .2167751
         南风  |   .1003935   .0412815     2.43   0.015     .0194832    .1813038
   无持续风向  |   .0066687   .0896328     0.07   0.941    -.1690084    .1823457
       西北风  |   .0231945   .0450092     0.52   0.606     -.065022     .111411
       西南风  |   .0932582   .0450258     2.07   0.038     .0050092    .1815071
               |
         _cons |  -.0748858   .1797751    -0.42   0.677    -.4272385     .277467
---------------+----------------------------------------------------------------
hnhb_C28_lnvar |
         _cons |  -2.688453   .1108549   -24.25   0.000    -2.905725   -2.471182
---------------+----------------------------------------------------------------
js_C28_mean    |
        c_dudt |  -.0916375   .0262204    -3.49   0.000    -.1430284   -.0402465
       c_lngdp |  -.1522238   .1369454    -1.11   0.266    -.4206318    .1161842
         c_lnp |   .1507545   .3547389     0.42   0.671     -.544521    .8460301
    c_max_temp |  -.0062962   .0052851    -1.19   0.234    -.0166549    .0040625
    c_min_temp |   .0084548   .0065294     1.29   0.195    -.0043427    .0212523
     c_windpow |   .0243161    .043548     0.56   0.577    -.0610365    .1096686
               |
            ym |
       201502  |   .0008286   .0033426     0.25   0.804    -.0057227    .0073799
       201503  |   .0604122   .0320556     1.88   0.059    -.0024156    .1232399
       201504  |   .0166713   .0498907     0.33   0.738    -.0811126    .1144552
       201505  |   .0046778   .0866517     0.05   0.957    -.1651565    .1745121
       201506  |   .0018669    .112613     0.02   0.987    -.2188506    .2225844
       201507  |   -.008928     .14155    -0.06   0.950     -.286361     .268505
       201508  |  -.0170247   .1360442    -0.13   0.900    -.2836664     .249617
       201509  |  -.0118807   .1192009    -0.10   0.921    -.2455102    .2217489
       201510  |  -.0125166   .0803478    -0.16   0.876    -.1699954    .1449622
       201511  |  -.0336472    .034233    -0.98   0.326    -.1007426    .0334482
       201512  |  -.0055649   .0135529    -0.41   0.681    -.0321282    .0209984
       201601  |  -.0557303   .0765122    -0.73   0.466    -.2056914    .0942308
       201602  |  -.0621212   .1039903    -0.60   0.550    -.2659384     .141696
       201603  |  -.0779488   .1059592    -0.74   0.462    -.2856251    .1297275
       201604  |  -.0699092   .1567852    -0.45   0.656    -.3772026    .2373842
       201605  |  -.0749658   .1783624    -0.42   0.674    -.4245496    .2746181
       201606  |   -.092003   .1930793    -0.48   0.634    -.4704315    .2864255
       201607  |  -.1798435   .2112434    -0.85   0.395     -.593873    .2341861
       201608  |  -.1705612   .1781527    -0.96   0.338    -.5197342    .1786117
       201609  |  -.1457638    .108411    -1.34   0.179    -.3582454    .0667178
       201610  |  -.1790476     .07308    -2.45   0.014    -.3222818   -.0358134
       201611  |  -.1506575   .0345848    -4.36   0.000    -.2184425   -.0828725
       201612  |  -.1394748   .0224201    -6.22   0.000    -.1834175   -.0955322
       201701  |   .0178982   .0266514     0.67   0.502    -.0343376    .0701341
       201702  |   .0291445   .0266111     1.10   0.273    -.0230123    .0813013
       201703  |   .0514459   .0332661     1.55   0.122    -.0137544    .1166463
       201704  |   .0155852   .0674676     0.23   0.817    -.1166489    .1478194
       201705  |   .0324487   .0882979     0.37   0.713    -.1406119    .2055093
       201706  |    .016535   .1136379     0.15   0.884    -.2061913    .2392613
       201707  |  -.0139959   .1381359    -0.10   0.919    -.2847374    .2567456
       201708  |  -.0461643   .1224789    -0.38   0.706    -.2862185    .1938899
       201709  |   .0056593   .1077558     0.05   0.958    -.2055382    .2168568
       201710  |  -.0079981   .0651346    -0.12   0.902    -.1356595    .1196634
       201711  |   .0584312   .0320543     1.82   0.068    -.0043941    .1212565
       201712  |   .0221782   .0285512     0.78   0.437    -.0337811    .0781376
       201801  |   .0768987   .0376989     2.04   0.041     .0030102    .1507872
       201802  |   .1124612   .0420807     2.67   0.008     .0299846    .1949379
       201803  |   .0957589   .0364915     2.62   0.009     .0242369     .167281
       201804  |   .0803425   .0481249     1.67   0.095    -.0139806    .1746656
       201805  |   .0550818   .0805533     0.68   0.494    -.1027997    .2129634
       201806  |   .0649858   .1089762     0.60   0.551    -.1486035    .2785752
       201807  |   .0228215   .1265716     0.18   0.857    -.2252544    .2708974
       201808  |   .0145893   .1262721     0.12   0.908    -.2328995    .2620782
       201809  |   .0396362   .1071943     0.37   0.712    -.1704608    .2497332
       201810  |   .0939931    .060885     1.54   0.123    -.0253393    .2133255
       201811  |   .0839184   .0561741     1.49   0.135    -.0261809    .1940176
       201812  |   .1195279   .0510794     2.34   0.019     .0194142    .2196417
       201901  |  -.0988239   .0638295    -1.55   0.122    -.2239275    .0262796
       201902  |  -.1189986   .0616887    -1.93   0.054    -.2399062     .001909
       201903  |  -.1241102   .0770975    -1.61   0.107    -.2752185     .026998
       201904  |  -.1749265   .0916687    -1.91   0.056    -.3545939    .0047409
       201905  |  -.1839712   .1333666    -1.38   0.168    -.4453648    .0774225
       201906  |  -.2231322   .1526174    -1.46   0.144    -.5222568    .0759925
       201907  |  -.2364525   .1799393    -1.31   0.189    -.5891271    .1162221
       201908  |  -.2098121   .1749784    -1.20   0.230    -.5527635    .1331393
       201909  |  -.1530343   .1543842    -0.99   0.322    -.4556218    .1495533
       201910  |  -.1411289   .1221551    -1.16   0.248    -.3805486    .0982907
       201911  |   -.138391   .0831736    -1.66   0.096    -.3014082    .0246263
       201912  |  -.1625318   .0671371    -2.42   0.015     -.294118   -.0309456
               |
       winddir |
       东南风  |   .0779005   .0374163     2.08   0.037     .0045659    .1512352
         东风  |   .1005712   .0452586     2.22   0.026      .011866    .1892764
         北风  |   .0199679   .0257269     0.78   0.438     -.030456    .0703918
    北风~南风  |  -.1451718   .0436993    -3.32   0.001    -.2308209   -.0595227
         南风  |  -.0175667   .0323444    -0.54   0.587    -.0809606    .0458271
    南风~北风  |  -.0543794   .0445563    -1.22   0.222    -.1417082    .0329494
   无持续风向  |  -.0309097   .0278556    -1.11   0.267    -.0855057    .0236864
       西北风  |  -.0009429    .033343    -0.03   0.977     -.066294    .0644082
       西南风  |   .0399055   .0303399     1.32   0.188    -.0195597    .0993707
               |
         _cons |   .0322592   .0737559     0.44   0.662    -.1122997    .1768182
---------------+----------------------------------------------------------------
js_C28_lnvar   |
         _cons |  -4.041597   .1072937   -37.67   0.000    -4.251889   -3.831306
--------------------------------------------------------------------------------

. test [hnhb_C28_mean]c_dudt = [js_C28_mean]c_dudt

 ( 1)  [hnhb_C28_mean]c_dudt - [js_C28_mean]c_dudt = 0

           chi2(  1) =    6.11
         Prob > chi2 =    0.0135

. 
. reg c_lnC29 c_dudt $c_cov i.ym i.winddir if (hnhb==1|boundary==0)&(policy_city==1)

      Source |       SS           df       MS      Number of obs   =     1,635
-------------+----------------------------------   F(71, 1563)     =     29.58
       Model |  83.3600778        71   1.1740856   Prob > F        =    0.0000
    Residual |  62.0454978     1,563  .039696416   R-squared       =    0.5733
-------------+----------------------------------   Adj R-squared   =    0.5539
       Total |  145.405576     1,634    .0889875   Root MSE        =    .19924

------------------------------------------------------------------------------
     c_lnC29 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.1806432   .0275877    -6.55   0.000     -.234756   -.1265303
     c_lngdp |  -.2183884   .0448243    -4.87   0.000    -.3063104   -.1304663
       c_lnp |  -1.038518   .1269476    -8.18   0.000    -1.287524   -.7895125
  c_max_temp |  -.0297032   .0132736    -2.24   0.025    -.0557391   -.0036673
  c_min_temp |   .0367809   .0098633     3.73   0.000     .0174341    .0561276
   c_windpow |  -.1952422   .0229228    -8.52   0.000    -.2402049   -.1502794
             |
          ym |
     201502  |   .0174105   .0563612     0.31   0.757     -.093141     .127962
     201503  |   .0886492   .1108364     0.80   0.424    -.1287546    .3060529
     201504  |   .1078107   .1550786     0.70   0.487    -.1963733    .4119947
     201505  |  -.0243898   .2233974    -0.11   0.913      -.46258    .4138005
     201506  |  -.1204239   .2673332    -0.45   0.652    -.6447935    .4039457
     201507  |  -.2976425   .2855261    -1.04   0.297    -.8576971    .2624121
     201508  |  -.3128507   .2683908    -1.17   0.244    -.8392947    .2135932
     201509  |  -.2714619   .2260343    -1.20   0.230    -.7148244    .1719006
     201510  |  -.1038323   .1755591    -0.59   0.554    -.4481885    .2405239
     201511  |  -.1657218   .0759312    -2.18   0.029    -.3146595   -.0167841
     201512  |  -.1000284   .0574129    -1.74   0.082    -.2126428    .0125861
     201601  |  -.1610176   .0730986    -2.20   0.028    -.3043992   -.0176361
     201602  |  -.1451708   .0632982    -2.29   0.022    -.2693291   -.0210125
     201603  |  -.0844892   .1271062    -0.66   0.506    -.3338059    .1648274
     201604  |  -.1410403   .2080639    -0.68   0.498     -.549154    .2670735
     201605  |  -.1101883   .2335945    -0.47   0.637    -.5683799    .3480032
     201606  |  -.1351316   .2803996    -0.48   0.630    -.6851306    .4148675
     201607  |   -.285318   .2847328    -1.00   0.316    -.8438164    .2731805
     201608  |  -.2347255   .2698872    -0.87   0.385    -.7641046    .2946536
     201609  |  -.0797972   .2412293    -0.33   0.741    -.5529643    .3933699
     201610  |  -.0747921   .1662527    -0.45   0.653     -.400894    .2513098
     201611  |   .0000466     .08483     0.00   1.000    -.1663461    .1664392
     201612  |      -.002   .0591142    -0.03   0.973    -.1179515    .1139515
     201701  |   .0622456    .059034     1.05   0.292    -.0535485    .1780398
     201702  |   .1263371     .06167     2.05   0.041     .0053724    .2473018
     201703  |   .1876551   .0985314     1.90   0.057    -.0056126    .3809228
     201704  |   .1712989   .1770279     0.97   0.333    -.1759383    .5185362
     201705  |   .2135484   .2485985     0.86   0.390    -.2740733    .7011701
     201706  |   .0816915   .2678593     0.30   0.760      -.44371     .607093
     201707  |  -.0267741   .2879173    -0.09   0.926     -.591519    .5379708
     201708  |  -.1278324   .2673313    -0.48   0.633    -.6521983    .3965334
     201709  |  -.0346437   .2421134    -0.14   0.886     -.509545    .4402577
     201710  |   .0169439   .1481192     0.11   0.909    -.2735894    .3074771
     201711  |   .2227105   .0926071     2.40   0.016     .0410632    .4043577
     201712  |   .1697004   .0539109     3.15   0.002     .0639551    .2754457
     201801  |   .0311651   .0682381     0.46   0.648    -.1026828    .1650131
     201802  |   .2073927   .0576751     3.60   0.000      .094264    .3205213
     201803  |   .2371077   .1170702     2.03   0.043     .0074765    .4667389
     201804  |   .2169887    .177219     1.22   0.221    -.1306233    .5646006
     201805  |  -.0007367    .226934    -0.00   0.997    -.4458639    .4443905
     201806  |  -.0703522   .2833551    -0.25   0.804    -.6261484    .4854441
     201807  |  -.1635874   .2979623    -0.55   0.583    -.7480353    .4208605
     201808  |  -.2214943   .2811164    -0.79   0.431    -.7728992    .3299107
     201809  |  -.1445138   .2215568    -0.65   0.514    -.5790938    .2900662
     201810  |   .0375484   .1591181     0.24   0.813    -.2745589    .3496558
     201811  |  -.0427413   .0988177    -0.43   0.665    -.2365706     .151088
     201812  |   -.035339   .0607333    -0.58   0.561    -.1544663    .0837883
     201901  |  -.4587342   .0614919    -7.46   0.000    -.5793495   -.3381189
     201902  |  -.5820333    .063583    -9.15   0.000    -.7067502   -.4573164
     201903  |  -.4199793    .119114    -3.53   0.000    -.6536194   -.1863391
     201904  |  -.4954612     .15915    -3.11   0.002    -.8076312   -.1832912
     201905  |  -.5080216   .2413091    -2.11   0.035    -.9813453    -.034698
     201906  |  -.5358678   .2967826    -1.81   0.071    -1.118002    .0462663
     201907  |  -.6486931   .2939072    -2.21   0.027    -1.225187   -.0721992
     201908  |  -.6294535   .2571219    -2.45   0.014    -1.133794   -.1251133
     201909  |  -.6344357   .2384249    -2.66   0.008    -1.102102   -.1667694
     201910  |  -.5463881   .1658839    -3.29   0.001    -.8717666   -.2210097
     201911  |  -.4588547   .0969837    -4.73   0.000    -.6490865   -.2686229
     201912  |  -.5018124   .0602535    -8.33   0.000    -.6199986   -.3836261
             |
     winddir |
     东南风  |  -.0632054   .0285113    -2.22   0.027    -.1191299    -.007281
       北风  |  -.0779567   .0251481    -3.10   0.002    -.1272843   -.0286291
       南风  |  -.1149786   .0209706    -5.48   0.000    -.1561121   -.0738452
 无持续风向  |    .105317    .053567     1.97   0.049     .0002463    .2103877
     西北风  |  -.0656441   .0393887    -1.67   0.096    -.1429044    .0116162
     西南风  |   .0872298   .0248951     3.50   0.000     .0383984    .1360612
             |
       _cons |   .1793395   .1530368     1.17   0.241    -.1208395    .4795185
------------------------------------------------------------------------------

. est store hnhb_C29

. reg c_lnC29 c_dudt $c_cov i.ym i.winddir if (js==1|boundary==0)&(policy_city==0)

      Source |       SS           df       MS      Number of obs   =     3,230
-------------+----------------------------------   F(76, 3153)     =     45.60
       Model |  51.1621914        76  .673186728   Prob > F        =    0.0000
    Residual |  46.5482206     3,153  .014763153   R-squared       =    0.5236
-------------+----------------------------------   Adj R-squared   =    0.5121
       Total |   97.710412     3,229   .03026027   Root MSE        =     .1215

------------------------------------------------------------------------------
     c_lnC29 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |   .0509174   .0183157     2.78   0.005     .0150054    .0868294
     c_lngdp |   .0604385    .028223     2.14   0.032     .0051013    .1157758
       c_lnp |   1.189437   .1035809    11.48   0.000     .9863443     1.39253
  c_max_temp |  -.0088286   .0028709    -3.08   0.002    -.0144575   -.0031997
  c_min_temp |  -.0063321   .0038563    -1.64   0.101    -.0138932     .001229
   c_windpow |   .0586562   .0073969     7.93   0.000     .0441529    .0731595
             |
          ym |
     201502  |   .0094218   .0223848     0.42   0.674    -.0344684    .0533121
     201503  |   .1231102   .0323903     3.80   0.000      .059602    .1866183
     201504  |   .1721115   .0444059     3.88   0.000     .0850441     .259179
     201505  |   .2911437   .0597093     4.88   0.000     .1740708    .4082167
     201506  |   .3728299   .0718881     5.19   0.000     .2318777    .5137822
     201507  |   .4064886   .0802803     5.06   0.000     .2490815    .5638956
     201508  |   .4086125   .0806139     5.07   0.000     .2505515    .5666735
     201509  |   .3445362   .0675951     5.10   0.000     .2120013    .4770711
     201510  |    .238055    .050139     4.75   0.000     .1397465    .3363635
     201511  |   .0820818   .0321468     2.55   0.011     .0190509    .1451126
     201512  |   .0170391   .0237307     0.72   0.473    -.0294901    .0635682
     201601  |   .0035451   .0292418     0.12   0.904    -.0537897      .06088
     201602  |   .0561673    .028972     1.94   0.053    -.0006385    .1129731
     201603  |   .1463349    .036022     4.06   0.000     .0757061    .2169637
     201604  |   .2809733   .0534324     5.26   0.000     .1762074    .3857392
     201605  |   .3419364   .0629726     5.43   0.000     .2184651    .4654077
     201606  |   .3984753   .0760215     5.24   0.000     .2494188    .5475319
     201607  |   .4111421   .0854084     4.81   0.000     .2436804    .5786037
     201608  |     .39397   .0845655     4.66   0.000     .2281611    .5597789
     201609  |   .2807425   .0693989     4.05   0.000     .1446709    .4168142
     201610  |   .1423131   .0511179     2.78   0.005     .0420854    .2425409
     201611  |   .0316392   .0314198     1.01   0.314    -.0299662    .0932445
     201612  |    -.05326   .0234742    -2.27   0.023    -.0992863   -.0072337
     201701  |  -.1709708   .0226527    -7.55   0.000    -.2153863   -.1265553
     201702  |  -.1422532   .0232136    -6.13   0.000    -.1877685   -.0967379
     201703  |  -.0872408   .0290059    -3.01   0.003    -.1441131   -.0303685
     201704  |   .0706877    .047518     1.49   0.137    -.0224816     .163857
     201705  |   .1310667   .0625844     2.09   0.036     .0083564     .253777
     201706  |   .2058231   .0720668     2.86   0.004     .0645206    .3471256
     201707  |   .2688718   .0864254     3.11   0.002     .0994161    .4383275
     201708  |    .207159   .0807617     2.57   0.010     .0488081    .3655099
     201709  |   .1801294   .0690228     2.61   0.009     .0447952    .3154636
     201710  |   .0485061   .0481383     1.01   0.314    -.0458795    .1428917
     201711  |  -.0305601   .0320281    -0.95   0.340    -.0933582    .0322381
     201712  |  -.1765731   .0237274    -7.44   0.000    -.2230957   -.1300504
     201801  |  -.2094785   .0246447    -8.50   0.000    -.2577997   -.1611573
     201802  |  -.1788271   .0252543    -7.08   0.000    -.2283436   -.1293105
     201803  |  -.0671508   .0331305    -2.03   0.043    -.1321103   -.0021913
     201804  |   .0113696    .045145     0.25   0.801     -.077147    .0998861
     201805  |   .0959721   .0599754     1.60   0.110    -.0216226    .2135669
     201806  |   .1965154   .0731227     2.69   0.007     .0531424    .3398883
     201807  |    .229647   .0850577     2.70   0.007     .0628729    .3964212
     201808  |   .2287875   .0853215     2.68   0.007     .0614963    .3960788
     201809  |   .1445478   .0663069     2.18   0.029     .0145387    .2745569
     201810  |   .0377728   .0462909     0.82   0.415    -.0529906    .1285361
     201811  |  -.0187035   .0345612    -0.54   0.588    -.0864683    .0490612
     201812  |  -.1097138   .0273168    -4.02   0.000    -.1632742   -.0561534
     201901  |  -.3238543   .0270966   -11.95   0.000    -.3769831   -.2707254
     201902  |  -.3234272   .0271513   -11.91   0.000    -.3766632   -.2701912
     201903  |  -.2212481   .0339525    -6.52   0.000    -.2878195   -.1546768
     201904  |  -.1713139   .0445493    -3.85   0.000    -.2586625   -.0839653
     201905  |  -.0128256   .0636898    -0.20   0.840    -.1377033     .112052
     201906  |  -.0100215   .0742931    -0.13   0.893    -.1556893    .1356462
     201907  |   .0408004   .0851344     0.48   0.632    -.1261241    .2077249
     201908  |    .032025   .0812985     0.39   0.694    -.1273784    .1914283
     201909  |   .0301438   .0731061     0.41   0.680    -.1131966    .1734842
     201910  |  -.0877725   .0530693    -1.65   0.098    -.1918263    .0162813
     201911  |  -.2242523   .0359403    -6.24   0.000     -.294721   -.1537835
     201912  |  -.2830213   .0281904   -10.04   0.000    -.3382947    -.227748
             |
     winddir |
东北风~北风  |  -.2280222   .0886418    -2.57   0.010    -.4018236   -.0542207
     东南风  |   .0648035   .0150906     4.29   0.000     .0352151    .0943919
       东风  |  -.0169454   .0234873    -0.72   0.471    -.0629975    .0291066
       北风  |   .0137998   .0132558     1.04   0.298     -.012191    .0397907
  北风~南风  |  -.1021029   .0371156    -2.75   0.006    -.1748761   -.0293297
       南风  |   .0013023   .0139723     0.09   0.926    -.0260935    .0286982
南风~东南风  |  -.2067848   .0886686    -2.33   0.020    -.3806388   -.0329309
  南风~北风  |  -.0937937   .0529446    -1.77   0.077     -.197603    .0100156
 无持续风向  |   .0040206   .0187779     0.21   0.830    -.0327976    .0408389
     西北风  |   .0155039   .0131772     1.18   0.239     -.010333    .0413407
     西南风  |  -.0683354   .0175702    -3.89   0.000    -.1027855   -.0338852
             |
       _cons |  -.0800061   .0451466    -1.77   0.076    -.1685257    .0085135
------------------------------------------------------------------------------

. est store js_C29

. suest hnhb_C29 js_C29, vce(cluster monitor_id)

Simultaneous results for hnhb_C29, js_C29                Number of obs = 4,865

                             (Std. err. adjusted for 105 clusters in monitor_id)
--------------------------------------------------------------------------------
               |               Robust
               | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
hnhb_C29_mean  |
        c_dudt |  -.1806432   .0690123    -2.62   0.009    -.3159047   -.0453816
       c_lngdp |  -.2183884    .121136    -1.80   0.071    -.4558106    .0190338
         c_lnp |  -1.038518   .3568828    -2.91   0.004    -1.737995   -.3390407
    c_max_temp |  -.0297032   .0243451    -1.22   0.222    -.0774187    .0180123
    c_min_temp |   .0367809   .0191526     1.92   0.055    -.0007575    .0743193
     c_windpow |  -.1952422   .0634268    -3.08   0.002    -.3195565   -.0709279
               |
            ym |
       201502  |   .0174105   .0488516     0.36   0.722     -.078337    .1131579
       201503  |   .0886492   .2461201     0.36   0.719    -.3937373    .5710356
       201504  |   .1078107    .375861     0.29   0.774    -.6288634    .8444848
       201505  |  -.0243898   .5691109    -0.04   0.966    -1.139827    1.091047
       201506  |  -.1204239    .693018    -0.17   0.862    -1.478714    1.237866
       201507  |  -.2976425   .7530341    -0.40   0.693    -1.773562    1.178277
       201508  |  -.3128507   .7096955    -0.44   0.659    -1.703828    1.078127
       201509  |  -.2714619   .5966527    -0.45   0.649     -1.44088    .8979559
       201510  |  -.1038323   .4398288    -0.24   0.813     -.965881    .7582163
       201511  |  -.1657218   .1330738    -1.25   0.213    -.4265417     .095098
       201512  |  -.1000284   .0337529    -2.96   0.003    -.1661829   -.0338739
       201601  |  -.1610176   .1151632    -1.40   0.162    -.3867334    .0646981
       201602  |  -.1451708   .0817757    -1.78   0.076    -.3054482    .0151066
       201603  |  -.0844892   .2994625    -0.28   0.778    -.6714249    .5024464
       201604  |  -.1410403   .5264071    -0.27   0.789    -1.172779    .8906986
       201605  |  -.1101883   .5950265    -0.19   0.853    -1.276419    1.056042
       201606  |  -.1351316   .7261995    -0.19   0.852    -1.558456    1.288193
       201607  |   -.285318   .7572008    -0.38   0.706    -1.769404    1.198768
       201608  |  -.2347255   .7176483    -0.33   0.744     -1.64129    1.171839
       201609  |  -.0797972   .6264082    -0.13   0.899    -1.307535     1.14794
       201610  |  -.0747921   .4189641    -0.18   0.858    -.8959467    .7463625
       201611  |   .0000466   .1797031     0.00   1.000     -.352165    .3522582
       201612  |      -.002   .0535898    -0.04   0.970    -.1070342    .1030342
       201701  |   .0622456   .0423745     1.47   0.142    -.0208068    .1452981
       201702  |   .1263371   .0757661     1.67   0.095    -.0221617    .2748358
       201703  |   .1876551   .2185698     0.86   0.391    -.2407338     .616044
       201704  |   .1712989   .4469961     0.38   0.702    -.7047974    1.047395
       201705  |   .2135484   .6401401     0.33   0.739    -1.041103      1.4682
       201706  |   .0816915    .701006     0.12   0.907    -1.292255    1.455638
       201707  |  -.0267741   .7699209    -0.03   0.972    -1.535791    1.482243
       201708  |  -.1278324   .7194785    -0.18   0.859    -1.537984     1.28232
       201709  |  -.0346437   .6380919    -0.05   0.957    -1.285281    1.215993
       201710  |   .0169439   .3812329     0.04   0.965    -.7302589    .7641466
       201711  |   .2227105   .1979033     1.13   0.260    -.1651728    .6105938
       201712  |   .1697004   .0274174     6.19   0.000     .1159633    .2234375
       201801  |   .0311651   .0887095     0.35   0.725    -.1427023    .2050326
       201802  |   .2073927   .0541698     3.83   0.000     .1012219    .3135635
       201803  |   .2371077   .2732247     0.87   0.385    -.2984029    .7726183
       201804  |   .2169887   .4428146     0.49   0.624     -.650912    1.084889
       201805  |  -.0007367   .5951788    -0.00   0.999    -1.167266    1.165792
       201806  |  -.0703522   .7496575    -0.09   0.925    -1.539654    1.398949
       201807  |  -.1635874   .7974248    -0.21   0.837    -1.726511    1.399336
       201808  |  -.2214943   .7622453    -0.29   0.771    -1.715468    1.272479
       201809  |  -.1445138   .5810173    -0.25   0.804    -1.283287    .9942592
       201810  |   .0375484   .3917311     0.10   0.924    -.7302304    .8053273
       201811  |  -.0427413   .2352782    -0.18   0.856     -.503878    .4183954
       201812  |   -.035339   .0654664    -0.54   0.589    -.1636507    .0929727
       201901  |  -.4587342   .0990712    -4.63   0.000    -.6529102   -.2645582
       201902  |  -.5820333   .1669449    -3.49   0.000    -.9092393   -.2548273
       201903  |  -.4199793   .3058097    -1.37   0.170    -1.019355    .1793967
       201904  |  -.4954612   .4434047    -1.12   0.264    -1.364518    .3735961
       201905  |  -.5080216   .6517217    -0.78   0.436    -1.785373    .7693294
       201906  |  -.5358678   .8042145    -0.67   0.505    -2.112099    1.040364
       201907  |  -.6486931   .8251188    -0.79   0.432    -2.265896    .9685101
       201908  |  -.6294535   .7288736    -0.86   0.388    -2.058019    .7991125
       201909  |  -.6344357   .6785105    -0.94   0.350    -1.964292    .6954205
       201910  |  -.5463881   .4873116    -1.12   0.262    -1.501501    .4087251
       201911  |  -.4588547   .2760661    -1.66   0.096    -.9999344     .082225
       201912  |  -.5018124   .1458223    -3.44   0.001    -.7876187    -.216006
               |
       winddir |
       东南风  |  -.0632054   .0839663    -0.75   0.452    -.2277763    .1013654
         北风  |  -.0779567    .064305    -1.21   0.225    -.2039922    .0480788
         南风  |  -.1149786   .0677746    -1.70   0.090    -.2478144    .0178571
   无持续风向  |    .105317   .0717601     1.47   0.142    -.0353303    .2459643
       西北风  |  -.0656441   .0366055    -1.79   0.073    -.1373896    .0061013
       西南风  |   .0872298   .0307707     2.83   0.005     .0269203    .1475393
               |
         _cons |   .1793395   .4204907     0.43   0.670    -.6448071    1.003486
---------------+----------------------------------------------------------------
hnhb_C29_lnvar |
         _cons |  -3.226494   .2259317   -14.28   0.000    -3.669312   -2.783676
---------------+----------------------------------------------------------------
js_C29_mean    |
        c_dudt |   .0509174   .0260452     1.95   0.051    -.0001303    .1019652
       c_lngdp |   .0604385   .1001963     0.60   0.546    -.1359426    .2568196
         c_lnp |   1.189437   .3794766     3.13   0.002     .4456765    1.933198
    c_max_temp |  -.0088286   .0054748    -1.61   0.107    -.0195591    .0019019
    c_min_temp |  -.0063321   .0073714    -0.86   0.390    -.0207798    .0081156
     c_windpow |   .0586562   .0262346     2.24   0.025     .0072373    .1100751
               |
            ym |
       201502  |   .0094218   .0056905     1.66   0.098    -.0017313     .020575
       201503  |   .1231102   .0349459     3.52   0.000     .0546174    .1916029
       201504  |   .1721115   .0587407     2.93   0.003     .0569819    .2872412
       201505  |   .2911437   .0903037     3.22   0.001     .1141516    .4681358
       201506  |   .3728299   .1146779     3.25   0.001     .1480655    .5975944
       201507  |   .4064886   .1374943     2.96   0.003     .1370046    .6759725
       201508  |   .4086125   .1347956     3.03   0.002      .144418     .672807
       201509  |   .3445362    .112141     3.07   0.002      .124744    .5643284
       201510  |    .238055    .078644     3.03   0.002     .0839156    .3921944
       201511  |   .0820818   .0410832     2.00   0.046     .0015602    .1626034
       201512  |   .0170391   .0149043     1.14   0.253    -.0121728    .0462509
       201601  |   .0035451   .0562532     0.06   0.950    -.1067092    .1137994
       201602  |   .0561673    .071989     0.78   0.435    -.0849286    .1972632
       201603  |   .1463349   .0790782     1.85   0.064    -.0086554    .3013252
       201604  |   .2809733   .1171722     2.40   0.016       .05132    .5106267
       201605  |   .3419364   .1364883     2.51   0.012     .0744243    .6094485
       201606  |   .3984753   .1551164     2.57   0.010     .0944528    .7024978
       201607  |   .4111421   .1721341     2.39   0.017     .0737655    .7485187
       201608  |     .39397   .1590584     2.48   0.013     .0822211    .7057188
       201609  |   .2807425   .1132946     2.48   0.013     .0586892    .5027959
       201610  |   .1423131   .0803823     1.77   0.077    -.0152332    .2998595
       201611  |   .0316392   .0393087     0.80   0.421    -.0454046    .1086829
       201612  |    -.05326   .0174677    -3.05   0.002     -.087496    -.019024
       201701  |  -.1709708    .024719    -6.92   0.000    -.2194192   -.1225225
       201702  |  -.1422532   .0257036    -5.53   0.000    -.1926314    -.091875
       201703  |  -.0872408   .0366781    -2.38   0.017    -.1591285   -.0153531
       201704  |   .0706877    .069843     1.01   0.311    -.0662021    .2075775
       201705  |   .1310667   .0943721     1.39   0.165    -.0538992    .3160326
       201706  |   .2058231   .1171175     1.76   0.079     -.023723    .4353692
       201707  |   .2688718   .1427871     1.88   0.060    -.0109859    .5487294
       201708  |    .207159   .1312372     1.58   0.114    -.0500611    .4643791
       201709  |   .1801294   .1122172     1.61   0.108    -.0398123    .4000712
       201710  |   .0485061   .0724643     0.67   0.503    -.0935214    .1905335
       201711  |  -.0305601   .0374609    -0.82   0.415     -.103982    .0428619
       201712  |  -.1765731   .0258997    -6.82   0.000    -.2273355   -.1258106
       201801  |  -.2094785   .0339032    -6.18   0.000    -.2759274   -.1430295
       201802  |  -.1788271   .0360361    -4.96   0.000    -.2494565   -.1081976
       201803  |  -.0671508   .0426127    -1.58   0.115    -.1506702    .0163687
       201804  |   .0113696   .0623131     0.18   0.855    -.1107619     .133501
       201805  |   .0959721   .0909528     1.06   0.291    -.0822921    .2742364
       201806  |   .1965154   .1169249     1.68   0.093    -.0326533     .425684
       201807  |    .229647   .1365091     1.68   0.093    -.0379059       .4972
       201808  |   .2287875   .1366752     1.67   0.094    -.0390909     .496666
       201809  |   .1445478   .1083377     1.33   0.182    -.0677901    .3568857
       201810  |   .0377728   .0702137     0.54   0.591    -.0998435     .175389
       201811  |  -.0187035   .0556578    -0.34   0.737    -.1277908    .0903837
       201812  |  -.1097138   .0511274    -2.15   0.032    -.2099217   -.0095059
       201901  |  -.3238543   .0530677    -6.10   0.000    -.4278651   -.2198434
       201902  |  -.3234272   .0523033    -6.18   0.000    -.4259398   -.2209146
       201903  |  -.2212481   .0583001    -3.79   0.000    -.3355141   -.1069821
       201904  |  -.1713139   .0713858    -2.40   0.016    -.3112275   -.0314004
       201905  |  -.0128256    .101225    -0.13   0.899     -.211223    .1855718
       201906  |  -.0100215   .1244784    -0.08   0.936    -.2539947    .2339516
       201907  |   .0408004   .1422416     0.29   0.774     -.237988    .3195887
       201908  |    .032025   .1427925     0.22   0.823    -.2478433    .3118932
       201909  |   .0301438   .1252513     0.24   0.810    -.2153442    .2756318
       201910  |  -.0877725   .0920454    -0.95   0.340    -.2681782    .0926332
       201911  |  -.2242523   .0633275    -3.54   0.000    -.3483719   -.1001327
       201912  |  -.2830213   .0462001    -6.13   0.000    -.3735719   -.1924708
               |
       winddir |
  东北风~北风  |  -.2280222   .0287591    -7.93   0.000     -.284389   -.1716554
       东南风  |   .0648035   .0179373     3.61   0.000     .0296469    .0999601
         东风  |  -.0169454   .0196103    -0.86   0.388    -.0553808      .02149
         北风  |   .0137998    .015006     0.92   0.358    -.0156114     .043211
    北风~南风  |  -.1021029   .0191876    -5.32   0.000      -.13971   -.0644958
         南风  |   .0013023   .0174797     0.07   0.941    -.0329572    .0355619
  南风~东南风  |  -.2067848   .0269835    -7.66   0.000    -.2596716   -.1538981
    南风~北风  |  -.0937937   .0417118    -2.25   0.025    -.1755473   -.0120401
   无持续风向  |   .0040206   .0243895     0.16   0.869    -.0437819    .0518232
       西北风  |   .0155039   .0241285     0.64   0.521    -.0317871    .0627948
       西南风  |  -.0683354   .0285528    -2.39   0.017    -.1242978    -.012373
               |
         _cons |  -.0800061   .0738838    -1.08   0.279    -.2248157    .0648036
---------------+----------------------------------------------------------------
js_C29_lnvar   |
         _cons |  -4.215621    .106506   -39.58   0.000    -4.424369   -4.006873
--------------------------------------------------------------------------------

. test [hnhb_C29_mean]c_dudt = [js_C29_mean]c_dudt

 ( 1)  [hnhb_C29_mean]c_dudt - [js_C29_mean]c_dudt = 0

           chi2(  1) =    9.85
         Prob > chi2 =    0.0017

. 
. reg c_lnC32 c_dudt $c_cov i.ym i.winddir if (hnhb==1|boundary==0)&(policy_city==1)

      Source |       SS           df       MS      Number of obs   =     1,635
-------------+----------------------------------   F(71, 1563)     =      7.49
       Model |  15.7376964        71  .221657696   Prob > F        =    0.0000
    Residual |   46.240369     1,563  .029584369   R-squared       =    0.2539
-------------+----------------------------------   Adj R-squared   =    0.2200
       Total |  61.9780654     1,634  .037930273   Root MSE        =      .172

------------------------------------------------------------------------------
     c_lnC32 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.3397468   .0238161   -14.27   0.000    -.3864618   -.2930319
     c_lngdp |   .2566773   .0386962     6.63   0.000     .1807753    .3325793
       c_lnp |   .3177115   .1095923     2.90   0.004      .102748    .5326749
  c_max_temp |  -.0102725   .0114589    -0.90   0.370     -.032749     .012204
  c_min_temp |  -.0114432   .0085149    -1.34   0.179     -.028145    .0052586
   c_windpow |  -.1184788    .019789    -5.99   0.000    -.1572945    -.079663
             |
          ym |
     201502  |   .0784944   .0486559     1.61   0.107    -.0169433    .1739321
     201503  |   .2753697   .0956837     2.88   0.004     .0876877    .4630517
     201504  |   .4397621   .1338774     3.28   0.001     .1771639    .7023604
     201505  |   .5384661   .1928562     2.79   0.005     .1601819    .9167503
     201506  |   .5851067   .2307855     2.54   0.011      .132425    1.037789
     201507  |   .5631998   .2464912     2.28   0.022     .0797116    1.046688
     201508  |   .5149893   .2316985     2.22   0.026     .0605168    .9694619
     201509  |   .4148785   .1951326     2.13   0.034     .0321291    .7976278
     201510  |   .3284224    .151558     2.17   0.030      .031144    .6257008
     201511  |   .0965614   .0655504     1.47   0.141    -.0320146    .2251375
     201512  |   .0034515   .0495639     0.07   0.944    -.0937672    .1006701
     201601  |  -.2062893   .0631051    -3.27   0.001    -.3300689   -.0825097
     201602  |  -.1024016   .0546445    -1.87   0.061     -.209586    .0047827
     201603  |   .1030222   .1097292     0.94   0.348    -.1122098    .3182542
     201604  |     .28839    .179619     1.61   0.109    -.0639295    .6407096
     201605  |   .3759411   .2016592     1.86   0.062      -.01961    .7714923
     201606  |   .5035706   .2420655     2.08   0.038     .0287632     .978378
     201607  |   .5325607   .2458063     2.17   0.030     .0504159    1.014706
     201608  |   .4787038   .2329903     2.05   0.040     .0216974    .9357102
     201609  |    .504998   .2082502     2.42   0.015     .0965188    .9134773
     201610  |   .3423447   .1435239     2.39   0.017      .060825    .6238644
     201611  |    .169227   .0732327     2.31   0.021     .0255823    .3128717
     201612  |   .0350789   .0510326     0.69   0.492    -.0650206    .1351784
     201701  |  -.0536689   .0509633    -1.05   0.292    -.1536325    .0462947
     201702  |  -.0087755    .053239    -0.16   0.869    -.1132029    .0956518
     201703  |   .2089808   .0850609     2.46   0.014     .0421352    .3758264
     201704  |   .4359281    .152826     2.85   0.004     .1361625    .7356937
     201705  |    .634055    .214612     2.95   0.003     .2130973    1.055013
     201706  |   .6210674   .2312397     2.69   0.007     .1674947     1.07464
     201707  |   .7021088   .2485555     2.82   0.005     .2145715    1.189646
     201708  |   .5460119   .2307838     2.37   0.018     .0933334    .9986904
     201709  |   .5230484   .2090135     2.50   0.012     .1130719    .9330249
     201710  |    .337388   .1278695     2.64   0.008     .0865743    .5882018
     201711  |   .2421587   .0799466     3.03   0.002     .0853449    .3989726
     201712  |   .0568216   .0465406     1.22   0.222    -.0344669    .1481102
     201801  |  -.0532566   .0589091    -0.90   0.366    -.1688059    .0622926
     201802  |   .1433021   .0497902     2.88   0.004     .0456395    .2409646
     201803  |   .3854758   .1010653     3.81   0.000     .1872381    .5837136
     201804  |   .5266932   .1529909     3.44   0.001     .2266041    .8267823
     201805  |   .5249256   .1959093     2.68   0.007     .1406528    .9091984
     201806  |   .6263877    .244617     2.56   0.011     .1465756      1.1062
     201807  |   .6713576   .2572271     2.61   0.009     .1668109    1.175904
     201808  |   .5776414   .2426843     2.38   0.017     .1016203    1.053662
     201809  |   .4118393   .1912673     2.15   0.031     .0366718    .7870068
     201810  |   .3372594   .1373646     2.46   0.014      .067821    .6066978
     201811  |   .1810158   .0853081     2.12   0.034     .0136854    .3483462
     201812  |  -.0298531   .0524303    -0.57   0.569    -.1326942    .0729881
     201901  |  -.0337427   .0530852    -0.64   0.525    -.1378683     .070383
     201902  |  -.0575188   .0548904    -1.05   0.295    -.1651853    .0501478
     201903  |   .2003339   .1028297     1.95   0.052    -.0013648    .4020325
     201904  |   .2852571   .1373922     2.08   0.038     .0157646    .5547496
     201905  |   .4659014   .2083191     2.24   0.025     .0572869    .8745158
     201906  |   .5951267   .2562088     2.32   0.020     .0925776    1.097676
     201907  |    .558769   .2537264     2.20   0.028      .061089    1.056449
     201908  |     .52014   .2219702     2.34   0.019     .0847493    .9555307
     201909  |   .4083051   .2058293     1.98   0.047     .0045745    .8120356
     201910  |   .3248676   .1432055     2.27   0.023     .0439724    .6057628
     201911  |    .166193   .0837248     1.98   0.047     .0019683    .3304178
     201912  |   .0013558   .0520161     0.03   0.979     -.100673    .1033845
             |
     winddir |
     东南风  |   .0046893   .0246135     0.19   0.849    -.0435895    .0529682
       北风  |   -.016323     .02171    -0.75   0.452    -.0589069    .0262609
       南风  |  -.0855417   .0181036    -4.73   0.000    -.1210517   -.0500317
 无持续风向  |   .0774567   .0462437     1.67   0.094    -.0132495     .168163
     西北风  |  -.0171432   .0340038    -0.50   0.614    -.0838411    .0495546
     西南风  |   .0711287   .0214917     3.31   0.001     .0289732    .1132842
             |
       _cons |  -.2810938   .1321147    -2.13   0.034    -.5402347    -.021953
------------------------------------------------------------------------------

. est store hnhb_C32

. reg c_lnC32 c_dudt $c_cov i.ym i.winddir if (js==1|boundary==0)&(policy_city==0)

      Source |       SS           df       MS      Number of obs   =     3,230
-------------+----------------------------------   F(76, 3153)     =     10.01
       Model |  23.6232614        76  .310832387   Prob > F        =    0.0000
    Residual |  97.9167477     3,153  .031055106   R-squared       =    0.1944
-------------+----------------------------------   Adj R-squared   =    0.1749
       Total |  121.540009     3,229  .037640139   Root MSE        =    .17622

------------------------------------------------------------------------------
     c_lnC32 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |   .1622125   .0265645     6.11   0.000     .1101271     .214298
     c_lngdp |   .0612902   .0409336     1.50   0.134    -.0189689    .1415494
       c_lnp |   .9471035   .1502299     6.30   0.000     .6525452    1.241662
  c_max_temp |   .0014203   .0041638     0.34   0.733    -.0067437    .0095843
  c_min_temp |   .0026452    .005593     0.47   0.636    -.0083212    .0136115
   c_windpow |   .0396382   .0107283     3.69   0.000     .0186031    .0606733
             |
          ym |
     201502  |   .0000133   .0324661     0.00   1.000    -.0636435    .0636702
     201503  |   .0131551   .0469777     0.28   0.779    -.0789548     .105265
     201504  |   .0070194   .0644048     0.11   0.913    -.1192601    .1332989
     201505  |  -.0591598   .0866002    -0.68   0.495    -.2289582    .1106386
     201506  |  -.0621767   .1042639    -0.60   0.551    -.2666087    .1422553
     201507  |  -.0525486   .1164357    -0.45   0.652     -.280846    .1757488
     201508  |  -.0683272   .1169195    -0.58   0.559    -.2975732    .1609188
     201509  |  -.0493716   .0980375    -0.50   0.615    -.2415954    .1428522
     201510  |  -.0520127   .0727199    -0.72   0.475    -.1945958    .0905703
     201511  |  -.0286316   .0466246    -0.61   0.539    -.1200493     .062786
     201512  |    -.00538   .0344181    -0.16   0.876    -.0728642    .0621042
     201601  |  -.0142818   .0424112    -0.34   0.736    -.0974382    .0688746
     201602  |  -.0568536   .0420199    -1.35   0.176    -.1392427    .0255355
     201603  |  -.0858895   .0522449    -1.64   0.100     -.188327     .016548
     201604  |  -.0926831   .0774965    -1.20   0.232    -.2446317    .0592656
     201605  |  -.1038309   .0913331    -1.14   0.256    -.2829093    .0752474
     201606  |   -.133957   .1102588    -1.21   0.224    -.3501433    .0822292
     201607  |  -.1758293   .1238732    -1.42   0.156    -.4187095     .067051
     201608  |  -.1519004   .1226507    -1.24   0.216    -.3923836    .0885829
     201609  |  -.2097381   .1006537    -2.08   0.037    -.4070914   -.0123847
     201610  |  -.2169173   .0741396    -2.93   0.003    -.3622839   -.0715506
     201611  |  -.1773193   .0455702    -3.89   0.000    -.2666694   -.0879691
     201612  |  -.1561045   .0340462    -4.59   0.000    -.2228594   -.0893496
     201701  |  -.2301029   .0328546    -7.00   0.000    -.2945215   -.1656843
     201702  |  -.2404792   .0336682    -7.14   0.000     -.306493   -.1744655
     201703  |  -.2585541   .0420691    -6.15   0.000    -.3410396   -.1760685
     201704  |  -.3002318   .0689184    -4.36   0.000    -.4353611   -.1651024
     201705  |  -.3469911   .0907702    -3.82   0.000    -.5249657   -.1690165
     201706  |  -.3097208    .104523    -2.96   0.003    -.5146608   -.1047807
     201707  |  -.3245578   .1253482    -2.59   0.010    -.5703301   -.0787854
     201708  |  -.3489255   .1171339    -2.98   0.003    -.5785919    -.119259
     201709  |  -.3092381   .1001082    -3.09   0.002    -.5055219   -.1129543
     201710  |  -.2937376   .0698181    -4.21   0.000    -.4306311   -.1568441
     201711  |  -.2235767   .0464525    -4.81   0.000    -.3146568   -.1324965
     201712  |  -.2926321   .0344133    -8.50   0.000    -.3601069   -.2251573
     201801  |  -.1682371   .0357437    -4.71   0.000    -.2383204   -.0981538
     201802  |  -.1857036    .036628    -5.07   0.000    -.2575207   -.1138865
     201803  |  -.1948015   .0480513    -4.05   0.000    -.2890164   -.1005866
     201804  |   -.224269   .0654767    -3.43   0.001    -.3526502   -.0958878
     201805  |  -.2713035   .0869862    -3.12   0.002    -.4418587   -.1007483
     201806  |  -.2420331   .1060545    -2.28   0.023     -.449976   -.0340902
     201807  |  -.2656247   .1233647    -2.15   0.031    -.5075078   -.0237415
     201808  |   -.275641   .1237472    -2.23   0.026    -.5182741   -.0330078
     201809  |  -.2421792   .0961692    -2.52   0.012    -.4307397   -.0536187
     201810  |  -.2214034   .0671387    -3.30   0.001    -.3530433   -.0897635
     201811  |  -.2075876   .0501264    -4.14   0.000    -.3058712    -.109304
     201812  |  -.1670057   .0396192    -4.22   0.000    -.2446878   -.0893236
     201901  |  -.1599599      .0393    -4.07   0.000     -.237016   -.0829037
     201902  |  -.1809578   .0393793    -4.60   0.000    -.2581693   -.1037462
     201903  |  -.2216045   .0492435    -4.50   0.000    -.3181571   -.1250519
     201904  |  -.2457666   .0646127    -3.80   0.000    -.3724539   -.1190794
     201905  |  -.3174203   .0923734    -3.44   0.001    -.4985383   -.1363023
     201906  |  -.3272133   .1077521    -3.04   0.002    -.5384845    -.115942
     201907  |    -.31387   .1234759    -2.54   0.011    -.5559712   -.0717687
     201908  |  -.2993512   .1179124    -2.54   0.011    -.5305441   -.0681583
     201909  |  -.2350518   .1060305    -2.22   0.027    -.4429475    -.027156
     201910  |  -.2398125   .0769698    -3.12   0.002    -.3907284   -.0888966
     201911  |    -.22584   .0521265    -4.33   0.000    -.3280453   -.1236346
     201912  |  -.2202453   .0408863    -5.39   0.000    -.3004118   -.1400789
             |
     winddir |
东北风~北风  |   .0090829   .1285629     0.07   0.944    -.2429924    .2611582
     东南风  |   .0748438   .0218869     3.42   0.001     .0319297    .1177578
       东风  |  -9.64e-06   .0340652    -0.00   1.000    -.0668018    .0667826
       北风  |   .0156801   .0192257     0.82   0.415    -.0220161    .0533762
  北风~南风  |  -.1182383   .0538312    -2.20   0.028    -.2237859   -.0126906
       南风  |  -.0053932    .020265    -0.27   0.790    -.0451271    .0343407
南风~东南风  |   .0118877   .1286017     0.09   0.926    -.2402638    .2640392
  南风~北风  |  -.0549518   .0767889    -0.72   0.474    -.2055131    .0956095
 无持续风向  |   .0207697   .0272349     0.76   0.446    -.0326301    .0741696
     西北风  |   .0338369   .0191118     1.77   0.077    -.0036359    .0713097
     西南风  |    .030732   .0254832     1.21   0.228    -.0192332    .0806973
             |
       _cons |   .1706922   .0654789     2.61   0.009     .0423066    .2990778
------------------------------------------------------------------------------

. est store js_C32

. suest hnhb_C32 js_C32, vce(cluster monitor_id)

Simultaneous results for hnhb_C32, js_C32                Number of obs = 4,865

                             (Std. err. adjusted for 105 clusters in monitor_id)
--------------------------------------------------------------------------------
               |               Robust
               | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
hnhb_C32_mean  |
        c_dudt |  -.3397468   .0661933    -5.13   0.000    -.4694833   -.2100104
       c_lngdp |   .2566773   .0963927     2.66   0.008      .067751    .4456035
         c_lnp |   .3177115   .3098259     1.03   0.305    -.2895362    .9249592
    c_max_temp |  -.0102725   .0225144    -0.46   0.648    -.0543999    .0338549
    c_min_temp |  -.0114432   .0219672    -0.52   0.602    -.0544981    .0316117
     c_windpow |  -.1184788   .0555595    -2.13   0.033    -.2273734   -.0095842
               |
            ym |
       201502  |   .0784944   .0363637     2.16   0.031     .0072228    .1497659
       201503  |   .2753697   .1549089     1.78   0.075    -.0282463    .5789856
       201504  |   .4397621   .2370441     1.86   0.064    -.0248358    .9043601
       201505  |   .5384661   .3408402     1.58   0.114    -.1295683    1.206501
       201506  |   .5851067    .403113     1.45   0.147    -.2049803    1.375194
       201507  |   .5631998   .4434527     1.27   0.204    -.3059516    1.432351
       201508  |   .5149893   .4150946     1.24   0.215    -.2985811     1.32856
       201509  |   .4148785   .3474754     1.19   0.232    -.2661608    1.095918
       201510  |   .3284224   .2536395     1.29   0.195    -.1687019    .8255467
       201511  |   .0965614   .1138947     0.85   0.397    -.1266681     .319791
       201512  |   .0034515   .0429086     0.08   0.936    -.0806479    .0875509
       201601  |  -.2062893    .080186    -2.57   0.010    -.3634509   -.0491277
       201602  |  -.1024016   .0584204    -1.75   0.080    -.2169036    .0121003
       201603  |   .1030222   .1711353     0.60   0.547    -.2323968    .4384413
       201604  |     .28839   .3092958     0.93   0.351    -.3178186    .8945987
       201605  |   .3759411   .3496283     1.08   0.282    -.3093178      1.0612
       201606  |   .5035706   .4206632     1.20   0.231    -.3209141    1.328055
       201607  |   .5325607   .4403597     1.21   0.227    -.3305284     1.39565
       201608  |   .4787038   .4238715     1.13   0.259     -.352069    1.309477
       201609  |    .504998   .3658456     1.38   0.167    -.2120461    1.222042
       201610  |   .3423447   .2532295     1.35   0.176    -.1539759    .8386653
       201611  |    .169227   .1157971     1.46   0.144    -.0577312    .3961852
       201612  |   .0350789   .0483856     0.72   0.468    -.0597552     .129913
       201701  |  -.0536689   .0597068    -0.90   0.369    -.1706921    .0633543
       201702  |  -.0087755   .0614593    -0.14   0.886    -.1292335    .1116824
       201703  |   .2089808   .1258949     1.66   0.097    -.0377686    .4557302
       201704  |   .4359281   .2564321     1.70   0.089    -.0666695    .9385258
       201705  |    .634055   .3723719     1.70   0.089    -.0957805    1.363891
       201706  |   .6210674   .4057278     1.53   0.126    -.1741445    1.416279
       201707  |   .7021088   .4539135     1.55   0.122    -.1875454    1.591763
       201708  |   .5460119   .4214302     1.30   0.195    -.2799761       1.372
       201709  |   .5230484   .3643397     1.44   0.151    -.1910443    1.237141
       201710  |    .337388   .2198464     1.53   0.125     -.093503    .7682791
       201711  |   .2421587   .1160743     2.09   0.037     .0146574    .4696601
       201712  |   .0568216    .030098     1.89   0.059    -.0021693    .1158125
       201801  |  -.0532566   .0675207    -0.79   0.430    -.1855947    .0790814
       201802  |   .1433021   .0442106     3.24   0.001     .0566509    .2299532
       201803  |   .3854758   .1601849     2.41   0.016     .0715193    .6994324
       201804  |   .5266932   .2572592     2.05   0.041     .0224744    1.030912
       201805  |   .5249256   .3346129     1.57   0.117    -.1309037    1.180755
       201806  |   .6263877   .4174268     1.50   0.133    -.1917538    1.444529
       201807  |   .6713576   .4547881     1.48   0.140    -.2200107    1.562726
       201808  |   .5776414   .4286233     1.35   0.178    -.2624448    1.417728
       201809  |   .4118393   .3190496     1.29   0.197    -.2134865    1.037165
       201810  |   .3372594   .2128177     1.58   0.113    -.0798556    .7543744
       201811  |   .1810158   .1182438     1.53   0.126    -.0507379    .4127694
       201812  |  -.0298531   .0345381    -0.86   0.387    -.0975465    .0378404
       201901  |  -.0337427   .0844903    -0.40   0.690    -.1993405    .1318552
       201902  |  -.0575188    .098946    -0.58   0.561    -.2514493    .1364118
       201903  |   .2003339   .1559103     1.28   0.199    -.1052448    .5059125
       201904  |   .2852571   .2262639     1.26   0.207     -.158212    .7287263
       201905  |   .4659014   .3457951     1.35   0.178    -.2118446    1.143647
       201906  |   .5951267   .4334868     1.37   0.170    -.2544917    1.444745
       201907  |    .558769   .4465213     1.25   0.211    -.3163967    1.433935
       201908  |     .52014   .3955248     1.32   0.188    -.2550743    1.295354
       201909  |   .4083051   .3580929     1.14   0.254    -.2935442    1.110154
       201910  |   .3248676   .2497264     1.30   0.193    -.1645871    .8143223
       201911  |    .166193   .1367476     1.22   0.224    -.1018273    .4342133
       201912  |   .0013558   .0858822     0.02   0.987    -.1669702    .1696817
               |
       winddir |
       东南风  |   .0046893   .0609044     0.08   0.939     -.114681    .1240597
         北风  |   -.016323   .0406904    -0.40   0.688    -.0960748    .0634287
         南风  |  -.0855417    .039216    -2.18   0.029    -.1624037   -.0086797
   无持续风向  |   .0774567   .0637697     1.21   0.225    -.0475296     .202443
       西北风  |  -.0171432   .0239639    -0.72   0.474    -.0641116    .0298252
       西南风  |   .0711287   .0290283     2.45   0.014     .0142343     .128023
               |
         _cons |  -.2810938   .2306097    -1.22   0.223    -.7330806     .170893
---------------+----------------------------------------------------------------
hnhb_C32_lnvar |
         _cons |  -3.520509   .1364828   -25.79   0.000     -3.78801   -3.253008
---------------+----------------------------------------------------------------
js_C32_mean    |
        c_dudt |   .1622125   .0309074     5.25   0.000     .1016351    .2227899
       c_lngdp |   .0612902   .1650098     0.37   0.710    -.2621231    .3847035
         c_lnp |   .9471035   .6757431     1.40   0.161    -.3773286    2.271536
    c_max_temp |   .0014203   .0071802     0.20   0.843    -.0126526    .0154932
    c_min_temp |   .0026452   .0092536     0.29   0.775    -.0154916    .0207819
     c_windpow |   .0396382   .0240251     1.65   0.099    -.0074501    .0867265
               |
            ym |
       201502  |   .0000133   .0066486     0.00   0.998    -.0130177    .0130443
       201503  |   .0131551   .0364914     0.36   0.718    -.0583668     .084677
       201504  |   .0070194   .0702171     0.10   0.920    -.1306035    .1446423
       201505  |  -.0591598   .0973955    -0.61   0.544    -.2500515    .1317319
       201506  |  -.0621767   .1235869    -0.50   0.615    -.3044026    .1800492
       201507  |  -.0525486   .1440218    -0.36   0.715    -.3348261    .2297288
       201508  |  -.0683272   .1430406    -0.48   0.633    -.3486817    .2120273
       201509  |  -.0493716   .1125954    -0.44   0.661    -.2700546    .1713114
       201510  |  -.0520127   .0812954    -0.64   0.522    -.2113488    .1073234
       201511  |  -.0286316   .0454427    -0.63   0.529    -.1176978    .0604345
       201512  |    -.00538   .0148795    -0.36   0.718    -.0345433    .0237834
       201601  |  -.0142818   .0524843    -0.27   0.786    -.1171492    .0885856
       201602  |  -.0568536   .0662462    -0.86   0.391    -.1866938    .0729866
       201603  |  -.0858895   .0800378    -1.07   0.283    -.2427607    .0709816
       201604  |  -.0926831   .1183811    -0.78   0.434    -.3247058    .1393397
       201605  |  -.1038309   .1360845    -0.76   0.445    -.3705517    .1628899
       201606  |   -.133957   .1590618    -0.84   0.400    -.4457125    .1777985
       201607  |  -.1758293   .1807367    -0.97   0.331    -.5300666    .1784081
       201608  |  -.1519004   .1613534    -0.94   0.346    -.4681471    .1643464
       201609  |  -.2097381   .1303646    -1.61   0.108     -.465248    .0457719
       201610  |  -.2169173   .0999802    -2.17   0.030    -.4128749   -.0209596
       201611  |  -.1773193    .058924    -3.01   0.003    -.2928081   -.0618304
       201612  |  -.1561045   .0365573    -4.27   0.000    -.2277554   -.0844536
       201701  |  -.2301029   .0406936    -5.65   0.000     -.309861   -.1503449
       201702  |  -.2404792     .04478    -5.37   0.000    -.3282465    -.152712
       201703  |  -.2585541   .0547879    -4.72   0.000    -.3659364   -.1511717
       201704  |  -.3002318   .0881775    -3.40   0.001    -.4730566    -.127407
       201705  |  -.3469911    .114108    -3.04   0.002    -.5706387   -.1233434
       201706  |  -.3097208   .1302053    -2.38   0.017    -.5649184   -.0545231
       201707  |  -.3245578   .1571007    -2.07   0.039    -.6324694   -.0166461
       201708  |  -.3489255   .1457171    -2.39   0.017    -.6345257   -.0633253
       201709  |  -.3092381    .124923    -2.48   0.013    -.5540827   -.0643934
       201710  |  -.2937376   .0852429    -3.45   0.001    -.4608106   -.1266646
       201711  |  -.2235767    .051065    -4.38   0.000    -.3236621   -.1234912
       201712  |  -.2926321   .0440011    -6.65   0.000    -.3788727   -.2063915
       201801  |  -.1682371   .0523329    -3.21   0.001    -.2708077   -.0656666
       201802  |  -.1857036   .0523286    -3.55   0.000    -.2882657   -.0831414
       201803  |  -.1948015   .0642897    -3.03   0.002     -.320807    -.068796
       201804  |   -.224269   .0845164    -2.65   0.008    -.3899181   -.0586199
       201805  |  -.2713035   .1044903    -2.60   0.009    -.4761006   -.0665063
       201806  |  -.2420331   .1374494    -1.76   0.078     -.511429    .0273628
       201807  |  -.2656247   .1584569    -1.68   0.094    -.5761945    .0449452
       201808  |   -.275641    .159089    -1.73   0.083    -.5874497    .0361678
       201809  |  -.2421792   .1293162    -1.87   0.061    -.4956343     .011276
       201810  |  -.2214034   .0937353    -2.36   0.018    -.4051213   -.0376856
       201811  |  -.2075876   .0808642    -2.57   0.010    -.3660785   -.0490967
       201812  |  -.1670057   .0706789    -2.36   0.018    -.3055337   -.0284777
       201901  |  -.1599599   .0652624    -2.45   0.014    -.2878719   -.0320478
       201902  |  -.1809578   .0637236    -2.84   0.005    -.3058537   -.0560618
       201903  |  -.2216045   .0839698    -2.64   0.008    -.3861823   -.0570267
       201904  |  -.2457666   .1012524    -2.43   0.015    -.4442177   -.0473156
       201905  |  -.3174203   .1403144    -2.26   0.024    -.5924315   -.0424091
       201906  |  -.3272133   .1588298    -2.06   0.039    -.6385139   -.0159126
       201907  |    -.31387   .1763066    -1.78   0.075    -.6594245    .0316845
       201908  |  -.2993512   .1662398    -1.80   0.072    -.6251753    .0264729
       201909  |  -.2350518   .1421537    -1.65   0.098    -.5136679    .0435644
       201910  |  -.2398125   .1096251    -2.19   0.029    -.4546737   -.0249513
       201911  |    -.22584   .0790596    -2.86   0.004    -.3807939   -.0708861
       201912  |  -.2202453   .0690266    -3.19   0.001    -.3555349   -.0849558
               |
       winddir |
  东北风~北风  |   .0090829    .041298     0.22   0.826    -.0718596    .0900254
       东南风  |   .0748438   .0326461     2.29   0.022     .0108586    .1388289
         东风  |  -9.64e-06     .02677    -0.00   1.000    -.0524779    .0524586
         北风  |   .0156801   .0145329     1.08   0.281    -.0128039    .0441641
    北风~南风  |  -.1182383   .0389117    -3.04   0.002    -.1945038   -.0419728
         南风  |  -.0053932   .0137663    -0.39   0.695    -.0323746    .0215881
  南风~东南风  |   .0118877   .0420292     0.28   0.777    -.0704879    .0942634
    南风~北风  |  -.0549518   .0462465    -1.19   0.235    -.1455933    .0356896
   无持续风向  |   .0207697   .0330038     0.63   0.529    -.0439166     .085456
       西北风  |   .0338369   .0248244     1.36   0.173     -.014818    .0824918
       西南风  |    .030732   .0411688     0.75   0.455    -.0499574    .1114214
               |
         _cons |   .1706922   .0810463     2.11   0.035     .0118445      .32954
---------------+----------------------------------------------------------------
js_C32_lnvar   |
         _cons |  -3.471992   .1739787   -19.96   0.000    -3.812984      -3.131
--------------------------------------------------------------------------------

. test [hnhb_C32_mean]c_dudt = [js_C32_mean]c_dudt

 ( 1)  [hnhb_C32_mean]c_dudt - [js_C32_mean]c_dudt = 0

           chi2(  1) =   47.21
         Prob > chi2 =    0.0000

. 
. reg c_lnC25 c_dudt $c_cov i.ym i.winddir if (hnhb==1|boundary==0)&(policy_city==1)

      Source |       SS           df       MS      Number of obs   =     1,635
-------------+----------------------------------   F(71, 1563)     =     11.90
       Model |  19.0097217        71  .267742559   Prob > F        =    0.0000
    Residual |   35.172437     1,563  .022503159   R-squared       =    0.3508
-------------+----------------------------------   Adj R-squared   =    0.3214
       Total |  54.1821587     1,634  .033159216   Root MSE        =    .15001

------------------------------------------------------------------------------
     c_lnC25 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.3109809   .0207712   -14.97   0.000    -.3517232   -.2702385
     c_lngdp |   .2862358   .0337489     8.48   0.000     .2200379    .3524336
       c_lnp |  -1.557097   .0955808   -16.29   0.000    -1.744577   -1.369617
  c_max_temp |  -.0487537   .0099939    -4.88   0.000    -.0683565   -.0291508
  c_min_temp |   .0384104   .0074262     5.17   0.000     .0238439    .0529769
   c_windpow |  -.1463675   .0172589    -8.48   0.000    -.1802207   -.1125144
             |
          ym |
     201502  |   .0174364   .0424352     0.41   0.681    -.0657995    .1006723
     201503  |    .193629   .0834504     2.32   0.020     .0299424    .3573156
     201504  |   .2641895    .116761     2.26   0.024     .0351648    .4932143
     201505  |   .2573081   .1681993     1.53   0.126     -.072612    .5872283
     201506  |    .300414   .2012793     1.49   0.136    -.0943918    .6952199
     201507  |   .0902967    .214977     0.42   0.675    -.3313769    .5119704
     201508  |   .0881883   .2020755     0.44   0.663    -.3081794     .484556
     201509  |   .0929744   .1701847     0.55   0.585      -.24084    .4267887
     201510  |   .1601083   .1321811     1.21   0.226    -.0991627    .4193793
     201511  |  -.1131886   .0571697    -1.98   0.048     -.225326   -.0010511
     201512  |  -.1476522   .0432271    -3.42   0.001    -.2324414   -.0628631
     201601  |  -.2833586    .055037    -5.15   0.000    -.3913128   -.1754044
     201602  |  -.2352787   .0476582    -4.94   0.000    -.3287594    -.141798
     201603  |  -.0742729   .0957002    -0.78   0.438    -.2619872    .1134414
     201604  |   .0597627   .1566545     0.38   0.703    -.2475124    .3670378
     201605  |   .1117374   .1758768     0.64   0.525     -.233242    .4567169
     201606  |   .1402909   .2111171     0.66   0.506    -.2738118    .5543936
     201607  |   .0289657   .2143797     0.14   0.893    -.3915363    .4494677
     201608  |   .0614862   .2032022     0.30   0.762    -.3370913    .4600638
     201609  |    .156032   .1816252     0.86   0.390    -.2002227    .5122867
     201610  |   .0141181   .1251742     0.11   0.910     -.231409    .2596452
     201611  |  -.0556123   .0638698    -0.87   0.384    -.1808919    .0696673
     201612  |  -.1391924    .044508    -3.13   0.002    -.2264941   -.0518908
     201701  |  -.1980656   .0444476    -4.46   0.000    -.2852488   -.1108825
     201702  |   -.027346   .0464323    -0.59   0.556    -.1184222    .0637301
     201703  |   .1409359   .0741858     1.90   0.058    -.0045783    .2864501
     201704  |   .2646751    .133287     1.99   0.047     .0032349    .5261153
     201705  |   .3942034   .1871736     2.11   0.035     .0270656    .7613412
     201706  |    .307747   .2016754     1.53   0.127    -.0878358    .7033299
     201707  |   .2036316   .2167773     0.94   0.348    -.2215735    .6288367
     201708  |   .1306442   .2012778     0.65   0.516    -.2641588    .5254473
     201709  |   .1547947   .1822909     0.85   0.396    -.2027658    .5123552
     201710  |   .0596025   .1115212     0.53   0.593    -.1591444    .2783494
     201711  |   .1335553   .0697253     1.92   0.056    -.0032097    .2703203
     201712  |   .0006085   .0405903     0.01   0.988    -.0790087    .0802258
     201801  |  -.1737243   .0513775    -3.38   0.001    -.2745004   -.0729481
     201802  |   .0325702   .0434244     0.75   0.453    -.0526061    .1177465
     201803  |   .1886002   .0881439     2.14   0.033     .0157073     .361493
     201804  |   .2685286   .1334309     2.01   0.044     .0068062    .5302509
     201805  |   .1800996   .1708621     1.05   0.292    -.1550434    .5152427
     201806  |   .1898514   .2133424     0.89   0.374    -.2286161    .6083188
     201807  |   .1090324   .2243403     0.49   0.627    -.3310073    .5490722
     201808  |    .126481   .2116568     0.60   0.550    -.2886802    .5416422
     201809  |   .0563779   .1668135     0.34   0.735     -.270824    .3835797
     201810  |   .0903412   .1198024     0.75   0.451    -.1446491    .3253316
     201811  |  -.0625673   .0744014    -0.84   0.401    -.2085043    .0833697
     201812  |   -.116592    .045727    -2.55   0.011    -.2062847   -.0268992
     201901  |  -.1586834   .0462982    -3.43   0.001    -.2494964   -.0678703
     201902  |  -.0734694   .0478726    -1.53   0.125    -.1673707    .0204318
     201903  |    .146974   .0896828     1.64   0.101    -.0289372    .3228853
     201904  |   .2174934   .1198265     1.82   0.070    -.0175442    .4525309
     201905  |   .3042795   .1816853     1.67   0.094    -.0520931    .6606521
     201906  |   .3689058   .2234522     1.65   0.099    -.0693918    .8072034
     201907  |   .1630882   .2212872     0.74   0.461    -.2709628    .5971393
     201908  |   .1305369    .193591     0.67   0.500    -.2491886    .5102624
     201909  |   .1375216   .1795137     0.77   0.444    -.2145916    .4896347
     201910  |   .1989592   .1248965     1.59   0.111    -.0460232    .4439416
     201911  |   .0540365   .0730205     0.74   0.459    -.0891919    .1972649
     201912  |  -.0648668   .0453658    -1.43   0.153     -.153851    .0241175
             |
     winddir |
     东南风  |   .1272369   .0214666     5.93   0.000     .0851305    .1693432
       北风  |   .0708555   .0189344     3.74   0.000     .0337161     .107995
       南风  |   .0716796   .0157891     4.54   0.000     .0407096    .1026496
 无持续风向  |  -.1089332   .0403314    -2.70   0.007    -.1880426   -.0298239
     西北风  |   .0713849   .0296564     2.41   0.016     .0132144    .1295553
     西南风  |   .0937649   .0187439     5.00   0.000     .0569991    .1305308
             |
       _cons |  -.1474991   .1152237    -1.28   0.201    -.3735085    .0785102
------------------------------------------------------------------------------

. est store hnhb_C25

. reg c_lnC25 c_dudt $c_cov i.ym i.winddir if (js==1|boundary==0)&(policy_city==0)

      Source |       SS           df       MS      Number of obs   =     3,023
-------------+----------------------------------   F(76, 2946)     =     23.72
       Model |  20.5813581        76  .270807343   Prob > F        =    0.0000
    Residual |  33.6392786     2,946  .011418628   R-squared       =    0.3796
-------------+----------------------------------   Adj R-squared   =    0.3636
       Total |  54.2206367     3,022  .017941971   Root MSE        =    .10686

------------------------------------------------------------------------------
     c_lnC25 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.0529024   .0161325    -3.28   0.001    -.0845345   -.0212703
     c_lngdp |    .388705   .0250237    15.53   0.000     .3396393    .4377707
       c_lnp |    -1.8235   .0930239   -19.60   0.000    -2.005899   -1.641102
  c_max_temp |   .0091968    .002631     3.50   0.000      .004038    .0143556
  c_min_temp |   .0040609    .003574     1.14   0.256     -.002947    .0110687
   c_windpow |  -.1272121    .007002   -18.17   0.000    -.1409414   -.1134827
             |
          ym |
     201502  |   .0017534   .0196974     0.09   0.929    -.0368687    .0403754
     201503  |  -.0409775   .0288613    -1.42   0.156     -.097568    .0156129
     201504  |  -.0896081   .0400233    -2.24   0.025    -.1680846   -.0111317
     201505  |  -.2047775   .0541695    -3.78   0.000    -.3109915   -.0985635
     201506  |  -.2876098   .0654125    -4.40   0.000    -.4158687    -.159351
     201507  |  -.3112283   .0732386    -4.25   0.000    -.4548322   -.1676243
     201508  |  -.3270491   .0735428    -4.45   0.000    -.4712496   -.1828485
     201509  |  -.2799489    .061521    -4.55   0.000    -.4005775   -.1593203
     201510  |  -.2162962   .0454601    -4.76   0.000     -.305433   -.1271595
     201511  |  -.0555067   .0289436    -1.92   0.055    -.1122584    .0012451
     201512  |  -.0317402   .0209589    -1.51   0.130    -.0728357    .0093554
     201601  |  -.2760885   .0261464   -10.56   0.000    -.3273555   -.2248216
     201602  |  -.3446362    .026178   -13.17   0.000    -.3959652   -.2933071
     201603  |  -.3308429   .0325347   -10.17   0.000     -.394636   -.2670499
     201604  |  -.4727122   .0487061    -9.71   0.000    -.5682137   -.3772107
     201605  |  -.5276976   .0574798    -9.18   0.000    -.6404022    -.414993
     201606  |  -.5623639   .0694544    -8.10   0.000    -.6985479   -.4261799
     201607  |   -.616468   .0782118    -7.88   0.000    -.7698233   -.4631128
     201608  |  -.5181747   .0772695    -6.71   0.000    -.6696823   -.3666671
     201609  |     -.2989   .0631363    -4.73   0.000    -.4226956   -.1751043
     201610  |  -.2175359   .0464585    -4.68   0.000    -.3086302   -.1264416
     201611  |  -.0844224   .0281004    -3.00   0.003    -.1395209    -.029324
     201612  |  -.0314932   .0207259    -1.52   0.129    -.0721319    .0091454
     201701  |    .043139   .0199401     2.16   0.031      .004041    .0822369
     201702  |   .0273756   .0204371     1.34   0.181    -.0126968     .067448
     201703  |  -.0389922   .0258016    -1.51   0.131    -.0895831    .0115987
     201704  |  -.1181327   .0428504    -2.76   0.006    -.2021524   -.0341129
     201705  |  -.1744113   .0567175    -3.08   0.002    -.2856213   -.0632013
     201706  |  -.2568043   .0655741    -3.92   0.000      -.38538   -.1282286
     201707  |  -.3052573   .0789048    -3.87   0.000    -.4599714   -.1505433
     201708  |  -.2597716   .0737694    -3.52   0.000    -.4044164   -.1151268
     201709  |  -.2371149   .0628458    -3.77   0.000    -.3603411   -.1138888
     201710  |  -.1365816   .0436568    -3.13   0.002    -.2221825   -.0509806
     201711  |   .0030714   .0285351     0.11   0.914    -.0528793    .0590221
     201712  |   .0206604   .0209115     0.99   0.323    -.0203422     .061663
     201801  |  -.0753143   .0228157    -3.30   0.001    -.1200506   -.0305781
     201802  |  -.0443575   .0232614    -1.91   0.057    -.0899677    .0012528
     201803  |  -.1048737   .0303827    -3.45   0.001    -.1644472   -.0453002
     201804  |   -.174201    .041671    -4.18   0.000    -.2559082   -.0924939
     201805  |  -.2984947   .0546881    -5.46   0.000    -.4057255   -.1912639
     201806  |  -.3858221   .0671632    -5.74   0.000    -.5175136   -.2541306
     201807  |  -.3894046   .0781135    -4.99   0.000    -.5425672    -.236242
     201808  |   -.398129   .0780976    -5.10   0.000    -.5512604   -.2449976
     201809  |  -.3771007   .0609401    -6.19   0.000    -.4965902   -.2576112
     201810  |  -.2498412   .0425613    -5.87   0.000    -.3332941   -.1663884
     201811  |  -.2707358    .031753    -8.53   0.000    -.3329961   -.2084755
     201812  |  -.2538053   .0252193   -10.06   0.000    -.3032546    -.204356
     201901  |   -.077689   .0248813    -3.12   0.002    -.1264755   -.0289026
     201902  |  -.0892184   .0248671    -3.59   0.000     -.137977   -.0404598
     201903  |  -.1397163   .0313433    -4.46   0.000    -.2011733   -.0782594
     201904  |  -.1541869   .0411104    -3.75   0.000     -.234795   -.0735788
     201905  |  -.2857209   .0582725    -4.90   0.000    -.3999799   -.1714619
     201906  |  -.3185286    .068334    -4.66   0.000    -.4525158   -.1845414
     201907  |  -.3765164   .0779443    -4.83   0.000    -.5293473   -.2236856
     201908  |  -.3657888   .0741554    -4.93   0.000    -.5111905   -.2203871
     201909  |  -.3630412   .0665436    -5.46   0.000    -.4935178   -.2325646
     201910  |  -.2566361   .0481482    -5.33   0.000    -.3510437   -.1622286
     201911  |  -.1653955   .0328323    -5.04   0.000     -.229772   -.1010189
     201912  |  -.0981965   .0260197    -3.77   0.000    -.1492153   -.0471778
             |
     winddir |
东北风~北风  |   .1532245   .0780012     1.96   0.050     .0002822    .3061669
     东南风  |  -.0029427   .0135701    -0.22   0.828    -.0295505    .0236651
       东风  |   .0199539   .0208147     0.96   0.338     -.020859    .0607668
       北风  |   .0132958   .0118953     1.12   0.264     -.010028    .0366197
  北风~南风  |  -.0501434   .0327382    -1.53   0.126    -.1143354    .0140487
       南风  |  -.0333952   .0124926    -2.67   0.008    -.0578904      -.0089
南风~东南风  |   .1192451   .0780131     1.53   0.126    -.0337206    .2722108
  南风~北风  |   .1118206   .0466199     2.40   0.017     .0204096    .2032315
 无持续风向  |  -.0894295   .0167236    -5.35   0.000    -.1222206   -.0566385
     西北风  |   .0519074   .0121532     4.27   0.000     .0280778     .075737
     西南风  |  -.0143337   .0164266    -0.87   0.383    -.0465426    .0178752
             |
       _cons |   .2230853   .0408938     5.46   0.000      .142902    .3032686
------------------------------------------------------------------------------

. est store js_C25

. suest hnhb_C25 js_C25, vce(cluster monitor_id)

Simultaneous results for hnhb_C25, js_C25                Number of obs = 4,658

                             (Std. err. adjusted for 105 clusters in monitor_id)
--------------------------------------------------------------------------------
               |               Robust
               | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
hnhb_C25_mean  |
        c_dudt |  -.3109809   .0776211    -4.01   0.000    -.4631155   -.1588463
       c_lngdp |   .2862358    .107817     2.65   0.008     .0749184    .4975532
         c_lnp |  -1.557097    .406557    -3.83   0.000    -2.353934   -.7602596
    c_max_temp |  -.0487537    .014391    -3.39   0.001    -.0769595   -.0205478
    c_min_temp |   .0384104   .0114621     3.35   0.001      .015945    .0608758
     c_windpow |  -.1463675   .0426599    -3.43   0.001    -.2299794   -.0627557
               |
            ym |
       201502  |   .0174364   .0279795     0.62   0.533    -.0374024    .0722752
       201503  |    .193629   .1062159     1.82   0.068    -.0145503    .4018082
       201504  |   .2641895   .1543807     1.71   0.087    -.0383911    .5667701
       201505  |   .2573081   .2162708     1.19   0.234    -.1665748     .681191
       201506  |    .300414   .2474234     1.21   0.225     -.184527     .785355
       201507  |   .0902967   .2523277     0.36   0.720    -.4042564    .5848499
       201508  |   .0881883   .2317128     0.38   0.704    -.3659604    .5423369
       201509  |   .0929744   .1947217     0.48   0.633    -.2886731    .4746218
       201510  |   .1601083   .1481916     1.08   0.280    -.1303419    .4505585
       201511  |  -.1131886    .057754    -1.96   0.050    -.2263843    7.21e-06
       201512  |  -.1476522   .0282247    -5.23   0.000    -.2029716   -.0923329
       201601  |  -.2833586   .0719854    -3.94   0.000    -.4244474   -.1422698
       201602  |  -.2352787   .0588262    -4.00   0.000    -.3505759   -.1199814
       201603  |  -.0742729   .1126376    -0.66   0.510    -.2950386    .1464928
       201604  |   .0597627    .187261     0.32   0.750    -.3072621    .4267875
       201605  |   .1117374   .2067736     0.54   0.589    -.2935315    .5170063
       201606  |   .1402909   .2560035     0.55   0.584    -.3614666    .6420485
       201607  |   .0289657   .2604371     0.11   0.911    -.4814815    .5394129
       201608  |   .0614862   .2493882     0.25   0.805    -.4273056    .5502781
       201609  |    .156032   .2259035     0.69   0.490    -.2867307    .5987948
       201610  |   .0141181   .1668952     0.08   0.933    -.3129905    .3412267
       201611  |  -.0556123   .0839582    -0.66   0.508    -.2201673    .1089427
       201612  |  -.1391924   .0496652    -2.80   0.005    -.2365344   -.0418505
       201701  |  -.1980656   .0259024    -7.65   0.000    -.2488334   -.1472978
       201702  |   -.027346   .0468915    -0.58   0.560    -.1192516    .0645595
       201703  |   .1409359    .098177     1.44   0.151    -.0514875    .3333593
       201704  |   .2646751   .1825564     1.45   0.147    -.0931289    .6224791
       201705  |   .3942034   .2603292     1.51   0.130    -.1160324    .9044393
       201706  |    .307747   .2634445     1.17   0.243    -.2085947    .8240888
       201707  |   .2036316   .2757231     0.74   0.460    -.3367758     .744039
       201708  |   .1306442   .2493942     0.52   0.600    -.3581594    .6194478
       201709  |   .1547947   .2232127     0.69   0.488     -.282694    .5922835
       201710  |   .0596025   .1409757     0.42   0.672    -.2167048    .3359099
       201711  |   .1335553   .0992034     1.35   0.178    -.0608798    .3279904
       201712  |   .0006085   .0376925     0.02   0.987    -.0732675    .0744845
       201801  |  -.1737243   .0530491    -3.27   0.001    -.2776986   -.0697499
       201802  |   .0325702   .0612343     0.53   0.595    -.0874468    .1525872
       201803  |   .1886002   .1388008     1.36   0.174    -.0834444    .4606448
       201804  |   .2685286   .1961891     1.37   0.171     -.115995    .6530522
       201805  |   .1800996   .2236085     0.81   0.421    -.2581649    .6183642
       201806  |   .1898514   .2715239     0.70   0.484    -.3423256    .7220284
       201807  |   .1090324   .2794989     0.39   0.696    -.4387753    .6568401
       201808  |    .126481   .2677615     0.47   0.637     -.398322     .651284
       201809  |   .0563779   .2044351     0.28   0.783    -.3443075    .4570632
       201810  |   .0903412    .154232     0.59   0.558    -.2119479    .3926304
       201811  |  -.0625673   .0960578    -0.65   0.515    -.2508371    .1257025
       201812  |   -.116592   .0512665    -2.27   0.023    -.2170725   -.0161114
       201901  |  -.1586834   .0743134    -2.14   0.033    -.3043349   -.0130318
       201902  |  -.0734694   .0834069    -0.88   0.378    -.2369439    .0900051
       201903  |    .146974   .1048954     1.40   0.161    -.0586172    .3525653
       201904  |   .2174934   .1416548     1.54   0.125    -.0601449    .4951316
       201905  |   .3042795   .2262176     1.35   0.179    -.1390988    .7476578
       201906  |   .3689058   .2815921     1.31   0.190    -.1830046    .9208161
       201907  |   .1630882   .2561828     0.64   0.524    -.3390209    .6651974
       201908  |   .1305369   .2197661     0.59   0.553    -.3001968    .5612706
       201909  |   .1375216   .2047784     0.67   0.502    -.2638367    .5388798
       201910  |   .1989592   .1558367     1.28   0.202    -.1064752    .5043935
       201911  |   .0540365   .0759177     0.71   0.477    -.0947594    .2028324
       201912  |  -.0648668   .0643331    -1.01   0.313    -.1909573    .0612238
               |
       winddir |
       东南风  |   .1272369   .0340941     3.73   0.000     .0604136    .1940601
         北风  |   .0708555   .0237486     2.98   0.003     .0243091     .117402
         南风  |   .0716796    .016705     4.29   0.000     .0389384    .1044208
   无持续风向  |  -.1089332   .0248562    -4.38   0.000    -.1576505   -.0602159
       西北风  |   .0713849   .0205329     3.48   0.001     .0311412    .1116286
       西南风  |   .0937649   .0290458     3.23   0.001     .0368362    .1506937
               |
         _cons |  -.1474991   .1493938    -0.99   0.323    -.4403056    .1453074
---------------+----------------------------------------------------------------
hnhb_C25_lnvar |
         _cons |    -3.7941   .1852704   -20.48   0.000    -4.157223   -3.430976
---------------+----------------------------------------------------------------
js_C25_mean    |
        c_dudt |  -.0529024   .0262331    -2.02   0.044    -.1043184   -.0014864
       c_lngdp |    .388705   .1088222     3.57   0.000     .1754174    .6019927
         c_lnp |    -1.8235   .6682026    -2.73   0.006    -3.133154   -.5138473
    c_max_temp |   .0091968   .0037314     2.46   0.014     .0018834    .0165102
    c_min_temp |   .0040609   .0053264     0.76   0.446    -.0063787    .0145005
     c_windpow |  -.1272121    .019938    -6.38   0.000    -.1662898   -.0881343
               |
            ym |
       201502  |   .0017534   .0071608     0.24   0.807    -.0122815    .0157883
       201503  |  -.0409775   .0221698    -1.85   0.065    -.0844295    .0024744
       201504  |  -.0896081   .0435662    -2.06   0.040    -.1749963     -.00422
       201505  |  -.2047775   .0639166    -3.20   0.001    -.3300518   -.0795033
       201506  |  -.2876098   .0847948    -3.39   0.001    -.4538046   -.1214151
       201507  |  -.3112283    .098126    -3.17   0.002    -.5035517   -.1189048
       201508  |  -.3270491   .0981519    -3.33   0.001    -.5194233   -.1346748
       201509  |  -.2799489   .0792332    -3.53   0.000    -.4352432   -.1246546
       201510  |  -.2162962   .0562389    -3.85   0.000    -.3265225   -.1060699
       201511  |  -.0555067   .0307561    -1.80   0.071    -.1157876    .0047743
       201512  |  -.0317402   .0120148    -2.64   0.008    -.0552887   -.0081916
       201601  |  -.2760885   .0365155    -7.56   0.000    -.3476576   -.2045195
       201602  |  -.3446362   .0448606    -7.68   0.000    -.4325614   -.2567109
       201603  |  -.3308429   .0549008    -6.03   0.000    -.4384465   -.2232394
       201604  |  -.4727122   .0854958    -5.53   0.000    -.6402808   -.3051436
       201605  |  -.5276976    .098602    -5.35   0.000     -.720954   -.3344412
       201606  |  -.5623639   .1129389    -4.98   0.000      -.78372   -.3410078
       201607  |   -.616468    .127383    -4.84   0.000    -.8661342   -.3668019
       201608  |  -.5181747   .1133355    -4.57   0.000    -.7403082   -.2960411
       201609  |     -.2989   .0835767    -3.58   0.000    -.4627073   -.1350926
       201610  |  -.2175359   .0609468    -3.57   0.000    -.3369894   -.0980824
       201611  |  -.0844224   .0304477    -2.77   0.006    -.1440987   -.0247461
       201612  |  -.0314932   .0153521    -2.05   0.040    -.0615828   -.0014037
       201701  |    .043139   .0219986     1.96   0.050     .0000224    .0862555
       201702  |   .0273756   .0213671     1.28   0.200    -.0145031    .0692544
       201703  |  -.0389922   .0264414    -1.47   0.140    -.0908164     .012832
       201704  |  -.1181327   .0504673    -2.34   0.019    -.2170467   -.0192187
       201705  |  -.1744113   .0669438    -2.61   0.009    -.3056187   -.0432038
       201706  |  -.2568043   .0839529    -3.06   0.002     -.421349   -.0922596
       201707  |  -.3052573   .1040295    -2.93   0.003    -.5091514   -.1013633
       201708  |  -.2597716   .0964648    -2.69   0.007    -.4488391    -.070704
       201709  |  -.2371149   .0812494    -2.92   0.004    -.3963608    -.077869
       201710  |  -.1365816   .0532054    -2.57   0.010    -.2408622    -.032301
       201711  |   .0030714   .0292197     0.11   0.916    -.0541982     .060341
       201712  |   .0206604   .0241122     0.86   0.392    -.0265986    .0679194
       201801  |  -.0753143   .0273977    -2.75   0.006    -.1290129   -.0216158
       201802  |  -.0443575   .0260961    -1.70   0.089    -.0955049      .00679
       201803  |  -.1048737    .030262    -3.47   0.001    -.1641861   -.0455613
       201804  |   -.174201   .0441188    -3.95   0.000    -.2606722   -.0877298
       201805  |  -.2984947    .067704    -4.41   0.000    -.4311921   -.1657972
       201806  |  -.3858221    .086908    -4.44   0.000    -.5561587   -.2154855
       201807  |  -.3894046   .1012437    -3.85   0.000    -.5878386   -.1909706
       201808  |   -.398129     .10275    -3.87   0.000    -.5995154   -.1967426
       201809  |  -.3771007   .0821762    -4.59   0.000    -.5381631   -.2160383
       201810  |  -.2498412   .0539989    -4.63   0.000    -.3556772   -.1440052
       201811  |  -.2707358    .044815    -6.04   0.000    -.3585716      -.1829
       201812  |  -.2538053   .0372883    -6.81   0.000    -.3268891   -.1807215
       201901  |   -.077689   .0448445    -1.73   0.083    -.1655826    .0102045
       201902  |  -.0892184   .0405076    -2.20   0.028    -.1686118    -.009825
       201903  |  -.1397163   .0509624    -2.74   0.006    -.2396009   -.0398318
       201904  |  -.1541869   .0602266    -2.56   0.010    -.2722288    -.036145
       201905  |  -.2857209   .0821333    -3.48   0.001    -.4466992   -.1247427
       201906  |  -.3185286   .0956822    -3.33   0.001    -.5060623   -.1309949
       201907  |  -.3765164   .1141385    -3.30   0.001    -.6002239    -.152809
       201908  |  -.3657888   .1089227    -3.36   0.001    -.5792735   -.1523042
       201909  |  -.3630412   .0976455    -3.72   0.000    -.5544228   -.1716597
       201910  |  -.2566361   .0718403    -3.57   0.000    -.3974405   -.1158318
       201911  |  -.1653955   .0486988    -3.40   0.001    -.2608433   -.0699476
       201912  |  -.0981965   .0472592    -2.08   0.038    -.1908228   -.0055703
               |
       winddir |
  东北风~北风  |   .1532245   .0317295     4.83   0.000     .0910359    .2154132
       东南风  |  -.0029427    .019126    -0.15   0.878     -.040429    .0345437
         东风  |   .0199539   .0189324     1.05   0.292    -.0171529    .0570607
         北风  |   .0132958   .0097359     1.37   0.172    -.0057862    .0323779
    北风~南风  |  -.0501434   .0294846    -1.70   0.089    -.1079321    .0076454
         南风  |  -.0333952   .0122909    -2.72   0.007     -.057485   -.0093054
  南风~东南风  |   .1192451   .0325918     3.66   0.000     .0553663    .1831239
    南风~北风  |   .1118206   .0287097     3.89   0.000     .0555506    .1680906
   无持续风向  |  -.0894295   .0173422    -5.16   0.000    -.1234197   -.0554394
       西北风  |   .0519074   .0157599     3.29   0.001     .0210185    .0827962
       西南风  |  -.0143337   .0235055    -0.61   0.542    -.0604036    .0317362
               |
         _cons |   .2230853   .0551718     4.04   0.000     .1149507    .3312199
---------------+----------------------------------------------------------------
js_C25_lnvar   |
         _cons |  -4.472509   .1699331   -26.32   0.000    -4.805572   -4.139446
--------------------------------------------------------------------------------

. test [hnhb_C25_mean]c_dudt = [js_C25_mean]c_dudt

 ( 1)  [hnhb_C25_mean]c_dudt - [js_C25_mean]c_dudt = 0

           chi2(  1) =    9.92
         Prob > chi2 =    0.0016

. 
. reg c_lnC30 c_dudt $c_cov i.ym i.winddir if (hnhb==1|boundary==0)&(policy_city==1)

      Source |       SS           df       MS      Number of obs   =     1,635
-------------+----------------------------------   F(71, 1563)     =      6.53
       Model |  13.9904379        71  .197048422   Prob > F        =    0.0000
    Residual |  47.1508521     1,563  .030166892   R-squared       =    0.2288
-------------+----------------------------------   Adj R-squared   =    0.1938
       Total |    61.14129     1,634   .03741817   Root MSE        =    .17369

------------------------------------------------------------------------------
     c_lnC30 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.0764082   .0240495    -3.18   0.002    -.1235808   -.0292355
     c_lngdp |   .4040834   .0390753    10.34   0.000     .3274378    .4807291
       c_lnp |  -.6052413    .110666    -5.47   0.000    -.8223108   -.3881719
  c_max_temp |  -.0312265   .0115712    -2.70   0.007    -.0539232   -.0085298
  c_min_temp |   .0395508   .0085983     4.60   0.000     .0226854    .0564162
   c_windpow |  -.1888278   .0199829    -9.45   0.000    -.2280239   -.1496317
             |
          ym |
     201502  |   .0087968   .0491326     0.18   0.858    -.0875759    .1051695
     201503  |   .0612587   .0966211     0.63   0.526    -.1282621    .2507794
     201504  |   .0728882    .135189     0.54   0.590    -.1922828    .3380592
     201505  |  -.0640864   .1947457    -0.33   0.742    -.4460767    .3179039
     201506  |  -.1442914   .2330465    -0.62   0.536    -.6014081    .3128254
     201507  |  -.3475242   .2489061    -1.40   0.163    -.8357492    .1407008
     201508  |  -.3558081   .2339684    -1.52   0.129    -.8147332     .103117
     201509  |  -.3079372   .1970444    -1.56   0.118    -.6944364     .078562
     201510  |  -.1308006   .1530428    -0.85   0.393    -.4309915    .1693903
     201511  |  -.1934392   .0661926    -2.92   0.004     -.323275   -.0636035
     201512  |  -.1234269   .0500494    -2.47   0.014     -.221598   -.0252557
     201601  |  -.2433953   .0637233    -3.82   0.000    -.3683875    -.118403
     201602  |  -.2360571   .0551799    -4.28   0.000    -.3442915   -.1278226
     201603  |  -.2080475   .1108043    -1.88   0.061    -.4253882    .0092931
     201604  |  -.2398598   .1813787    -1.32   0.186    -.5956311    .1159114
     201605  |  -.2083213   .2036349    -1.02   0.306    -.6077476    .1911051
     201606  |  -.2520705   .2444371    -1.03   0.303    -.7315296    .2273886
     201607  |  -.3690619   .2482145    -1.49   0.137    -.8559303    .1178066
     201608  |  -.3713455   .2352729    -1.58   0.115    -.8328293    .0901382
     201609  |  -.1637544   .2102905    -0.78   0.436    -.5762356    .2487267
     201610  |  -.1764542     .14493    -1.22   0.224     -.460732    .1078236
     201611  |  -.0884222   .0739502    -1.20   0.232    -.2334742    .0566299
     201612  |  -.0975711   .0515325    -1.89   0.058    -.1986513    .0035091
     201701  |  -.1644961   .0514626    -3.20   0.001    -.2654391   -.0635532
     201702  |  -.0836992   .0537606    -1.56   0.120    -.1891496    .0217512
     201703  |  -.0632679   .0858943    -0.74   0.461    -.2317481    .1052123
     201704  |  -.0792746   .1543233    -0.51   0.608     -.381977    .2234279
     201705  |  -.0472459   .2167146    -0.22   0.827    -.4723278     .377836
     201706  |  -.1823698   .2335051    -0.78   0.435    -.6403861    .2756466
     201707  |  -.2937749   .2509906    -1.17   0.242    -.7860886    .1985389
     201708  |     -.3934   .2330448    -1.69   0.092    -.8505135    .0637135
     201709  |  -.2873831   .2110613    -1.36   0.174    -.7013761      .12661
     201710  |  -.2313636   .1291222    -1.79   0.073    -.4846346    .0219074
     201711  |  -.0252322   .0807298    -0.31   0.755    -.1835824     .133118
     201712  |  -.0593047   .0469966    -1.26   0.207    -.1514876    .0328782
     201801  |  -.1413706   .0594863    -2.38   0.018    -.2580519   -.0246893
     201802  |    .038013    .050278     0.76   0.450    -.0606064    .1366324
     201803  |   .0540735   .1020554     0.53   0.596    -.1461064    .2542535
     201804  |     .02733   .1544898     0.18   0.860    -.2756991    .3303591
     201805  |  -.2037378   .1978287    -1.03   0.303    -.5917753    .1842998
     201806  |  -.2666488   .2470135    -1.08   0.281    -.7511616     .217864
     201807  |  -.3718702   .2597472    -1.43   0.152      -.88136    .1376195
     201808  |   -.430113   .2450619    -1.76   0.079    -.9107977    .0505717
     201809  |  -.3423097   .1931411    -1.77   0.077    -.7211528    .0365333
     201810  |  -.1335385   .1387104    -0.96   0.336    -.4056166    .1385396
     201811  |  -.2170612   .0861439    -2.52   0.012    -.3860309   -.0480914
     201812  |  -.2058149    .052944    -3.89   0.000    -.3096636   -.1019662
     201901  |   -.241418   .0536053    -4.50   0.000    -.3465638   -.1362721
     201902  |  -.3545392   .0554281    -6.40   0.000    -.4632606   -.2458179
     201903  |  -.2164199   .1038371    -2.08   0.037    -.4200946   -.0127452
     201904  |   -.296357   .1387383    -2.14   0.033    -.5684897   -.0242242
     201905  |  -.3101943   .2103601    -1.47   0.141     -.722812    .1024234
     201906  |  -.3623378   .2587189    -1.40   0.162    -.8698104    .1451349
     201907  |  -.4914021   .2562122    -1.92   0.055     -.993958    .0111537
     201908  |  -.4677545   .2241448    -2.09   0.037    -.9074107   -.0280982
     201909  |  -.4637917   .2078458    -2.23   0.026    -.8714777   -.0561057
     201910  |  -.3715436   .1446085    -2.57   0.010    -.6551908   -.0878965
     201911  |  -.2766004    .084545    -3.27   0.001    -.4424341   -.1107668
     201912  |  -.2923955   .0525257    -5.57   0.000    -.3954238   -.1893672
             |
     winddir |
     东南风  |  -.0342549   .0248546    -1.38   0.168    -.0830067     .014497
       北风  |  -.0680534   .0219227    -3.10   0.002    -.1110545   -.0250523
       南风  |  -.1133807    .018281    -6.20   0.000    -.1492386   -.0775228
 无持续风向  |   .0177206   .0466968     0.38   0.704    -.0738743    .1093155
     西北风  |   -.044902   .0343369    -1.31   0.191    -.1122533    .0224493
     西南风  |   .0714484   .0217022     3.29   0.001     .0288799    .1140169
             |
       _cons |   .2643038   .1334091     1.98   0.048     .0026242    .5259835
------------------------------------------------------------------------------

. est store hnhb_C30

. reg c_lnC30 c_dudt $c_cov i.ym i.winddir if (js==1|boundary==0)&(policy_city==0)

      Source |       SS           df       MS      Number of obs   =     3,230
-------------+----------------------------------   F(76, 3153)     =     70.19
       Model |  60.7759178        76  .799683129   Prob > F        =    0.0000
    Residual |  35.9216553     3,153   .01139285   R-squared       =    0.6285
-------------+----------------------------------   Adj R-squared   =    0.6196
       Total |  96.6975731     3,229  .029946601   Root MSE        =    .10674

------------------------------------------------------------------------------
     c_lnC30 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |   .0683268   .0160898     4.25   0.000     .0367792    .0998743
     c_lngdp |  -.1965189    .024793    -7.93   0.000     -.245131   -.1479068
       c_lnp |   .5922828   .0909926     6.51   0.000      .413872    .7706935
  c_max_temp |  -.0014059    .002522    -0.56   0.577    -.0063507     .003539
  c_min_temp |   .0002621   .0033876     0.08   0.938    -.0063801    .0069043
   c_windpow |  -.0062336    .006498    -0.96   0.337    -.0189743    .0065071
             |
          ym |
     201502  |   -.014404   .0196644    -0.73   0.464    -.0529603    .0241522
     201503  |     .00331   .0284539     0.12   0.907      -.05248    .0590999
     201504  |    .028735   .0390093     0.74   0.461    -.0477511    .1052211
     201505  |   .0284999   .0524528     0.54   0.587    -.0743451    .1313449
     201506  |   .0470023   .0631515     0.74   0.457    -.0768199    .1708245
     201507  |   .0034924   .0705238     0.05   0.961    -.1347848    .1417697
     201508  |   .0331134   .0708168     0.47   0.640    -.1057383    .1719652
     201509  |   .0147102   .0593802     0.25   0.804    -.1017176    .1311381
     201510  |   .0031534   .0440456     0.07   0.943    -.0832076    .0895143
     201511  |  -.0059737     .02824    -0.21   0.832    -.0613443     .049397
     201512  |  -.0192778   .0208467    -0.92   0.355    -.0601523    .0215966
     201601  |  -.0831707    .025688    -3.24   0.001    -.1335376   -.0328038
     201602  |  -.1045116    .025451    -4.11   0.000    -.1544137   -.0546094
     201603  |  -.0653549   .0316442    -2.07   0.039    -.1274001   -.0033096
     201604  |  -.0562052   .0469388    -1.20   0.231    -.1482388    .0358284
     201605  |  -.0564322   .0553195    -1.02   0.308     -.164898    .0520336
     201606  |  -.0554533   .0667825    -0.83   0.406    -.1863949    .0754883
     201607  |  -.0974004   .0750286    -1.30   0.194    -.2445103    .0497095
     201608  |  -.0377124   .0742882    -0.51   0.612    -.1833704    .1079457
     201609  |  -.0289212   .0609648    -0.47   0.635    -.1484559    .0906136
     201610  |  -.0560497   .0449055    -1.25   0.212    -.1440967    .0319973
     201611  |  -.0667914   .0276013    -2.42   0.016    -.1209098    -.012673
     201612  |  -.0549619   .0206214    -2.67   0.008    -.0953946   -.0145292
     201701  |  -.2175641   .0198997   -10.93   0.000    -.2565818   -.1785465
     201702  |  -.2101747   .0203925   -10.31   0.000    -.2501585   -.1701909
     201703  |  -.2287036   .0254808    -8.98   0.000    -.2786642    -.178743
     201704  |  -.2023536   .0417431    -4.85   0.000       -.2842   -.1205073
     201705  |   -.206894   .0549785    -3.76   0.000    -.3146913   -.0990968
     201706  |  -.1856448   .0633084    -2.93   0.003    -.3097747   -.0615149
     201707  |  -.1794815    .075922    -2.36   0.018    -.3283431   -.0306199
     201708  |  -.2036863   .0709467    -2.87   0.004    -.3427927   -.0645799
     201709  |  -.1893861   .0606344    -3.12   0.002    -.3082731   -.0704992
     201710  |  -.1934408    .042288    -4.57   0.000    -.2763557   -.1105259
     201711  |   -.169034   .0281357    -6.01   0.000    -.2242002   -.1138678
     201712  |  -.2501096   .0208438   -12.00   0.000    -.2909783   -.2092409
     201801  |  -.2692593   .0216496   -12.44   0.000     -.311708   -.2268106
     201802  |  -.2612393   .0221852   -11.78   0.000    -.3047381   -.2177404
     201803  |  -.2345201   .0291041    -8.06   0.000    -.2915851   -.1774552
     201804  |  -.2321445   .0396585    -5.85   0.000    -.3099036   -.1543854
     201805  |  -.2485891   .0526866    -4.72   0.000    -.3518926   -.1452857
     201806  |  -.2253444   .0642361    -3.51   0.000    -.3512931   -.0993957
     201807  |  -.2275836   .0747206    -3.05   0.002    -.3740895   -.0810776
     201808  |   -.235462   .0749523    -3.14   0.002    -.3824222   -.0885017
     201809  |  -.2368143   .0582486    -4.07   0.000    -.3510233   -.1226052
     201810  |  -.2394737   .0406651    -5.89   0.000    -.3192066   -.1597409
     201811  |  -.2645265    .030361    -8.71   0.000    -.3240558   -.2049973
     201812  |  -.3056504   .0239969   -12.74   0.000    -.3527016   -.2585992
     201901  |  -.3980203   .0238036   -16.72   0.000    -.4446923   -.3513482
     201902  |  -.4060323   .0238516   -17.02   0.000    -.4527985   -.3592661
     201903  |  -.3907035   .0298263   -13.10   0.000    -.4491843   -.3322226
     201904  |  -.3951726   .0391352   -10.10   0.000    -.4719057   -.3184395
     201905  |  -.3441561   .0559495    -6.15   0.000    -.4538573   -.2344549
     201906  |  -.3846157   .0652642    -5.89   0.000    -.5125804    -.256651
     201907  |  -.4055487    .074788    -5.42   0.000    -.5521867   -.2589106
     201908  |  -.3993071   .0714183    -5.59   0.000    -.5393381   -.2592761
     201909  |  -.3305045   .0642215    -5.15   0.000    -.4564247   -.2045844
     201910  |  -.3479801   .0466197    -7.46   0.000    -.4393882    -.256572
     201911  |  -.3853582   .0315725   -12.21   0.000    -.4472629   -.3234536
     201912  |  -.3878333   .0247644   -15.66   0.000    -.4363893   -.3392773
             |
     winddir |
东北风~北风  |  -.3311484   .0778691    -4.25   0.000    -.4838276   -.1784691
     东南风  |    .100737   .0132567     7.60   0.000     .0747445    .1267296
       东风  |   .0792442   .0206329     3.84   0.000     .0387889    .1196995
       北风  |   .0275476   .0116448     2.37   0.018     .0047155    .0503798
  北风~南风  |  -.0014574   .0326049    -0.04   0.964    -.0653865    .0624716
       南风  |   .0154786   .0122743     1.26   0.207    -.0085878    .0395449
南风~东南风  |  -.3454031   .0778926    -4.43   0.000    -.4981285   -.1926777
  南风~北风  |  -.1258152   .0465102    -2.71   0.007    -.2170086   -.0346219
 无持续风向  |   -.061803   .0164959    -3.75   0.000    -.0941467   -.0294593
     西北风  |   .0615896   .0115758     5.32   0.000     .0388928    .0842865
     西南风  |   .0271341   .0154349     1.76   0.079    -.0031293    .0573976
             |
       _cons |   .1455899   .0396599     3.67   0.000     .0678282    .2233517
------------------------------------------------------------------------------

. est store js_C30

. suest hnhb_C30 js_C30, vce(cluster monitor_id)

Simultaneous results for hnhb_C30, js_C30                Number of obs = 4,865

                             (Std. err. adjusted for 105 clusters in monitor_id)
--------------------------------------------------------------------------------
               |               Robust
               | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
hnhb_C30_mean  |
        c_dudt |  -.0764082   .0428575    -1.78   0.075    -.1604074    .0075911
       c_lngdp |   .4040834   .0858783     4.71   0.000     .2357651    .5724018
         c_lnp |  -.6052413   .2975588    -2.03   0.042    -1.188446   -.0220367
    c_max_temp |  -.0312265   .0193889    -1.61   0.107    -.0692281    .0067751
    c_min_temp |   .0395508   .0141126     2.80   0.005     .0118906    .0672111
     c_windpow |  -.1888278   .0549167    -3.44   0.001    -.2964626    -.081193
               |
            ym |
       201502  |   .0087968   .0259856     0.34   0.735    -.0421339    .0597276
       201503  |   .0612587   .1309772     0.47   0.640     -.195452    .3179693
       201504  |   .0728882   .1983721     0.37   0.713     -.315914    .4616904
       201505  |  -.0640864   .2918461    -0.22   0.826    -.6360941    .5079214
       201506  |  -.1442914   .3559489    -0.41   0.685    -.8419384    .5533556
       201507  |  -.3475242   .3783672    -0.92   0.358     -1.08911    .3940618
       201508  |  -.3558081   .3568884    -1.00   0.319    -1.055296    .3436803
       201509  |  -.3079372   .3035098    -1.01   0.310    -.9028055    .2869311
       201510  |  -.1308006   .2307014    -0.57   0.571    -.5829669    .3213657
       201511  |  -.1934392   .0659353    -2.93   0.003    -.3226701   -.0642083
       201512  |  -.1234269   .0240567    -5.13   0.000    -.1705772   -.0762765
       201601  |  -.2433953   .0740632    -3.29   0.001    -.3885565   -.0982341
       201602  |  -.2360571   .0664512    -3.55   0.000    -.3662991    -.105815
       201603  |  -.2080475   .1726407    -1.21   0.228    -.5464171     .130322
       201604  |  -.2398598   .2894574    -0.83   0.407    -.8071859    .3274662
       201605  |  -.2083213   .3255676    -0.64   0.522    -.8464221    .4297796
       201606  |  -.2520705   .3820737    -0.66   0.509    -1.000921    .4967802
       201607  |  -.3690619   .3864282    -0.96   0.340    -1.126447    .3883235
       201608  |  -.3713455   .3684183    -1.01   0.313    -1.093432    .3507411
       201609  |  -.1637544   .3262854    -0.50   0.616     -.803262    .4757531
       201610  |  -.1764542   .2146768    -0.82   0.411     -.597213    .2443046
       201611  |  -.0884222   .0964287    -0.92   0.359    -.2774189    .1005746
       201612  |  -.0975711   .0367623    -2.65   0.008    -.1696239   -.0255183
       201701  |  -.1644961   .0373419    -4.41   0.000    -.2376849   -.0913074
       201702  |  -.0836992   .0479804    -1.74   0.081    -.1777391    .0103407
       201703  |  -.0632679   .1187959    -0.53   0.594    -.2961035    .1695677
       201704  |  -.0792746   .2313048    -0.34   0.732    -.5326236    .3740744
       201705  |  -.0472459   .3318444    -0.14   0.887    -.6976489    .6031571
       201706  |  -.1823698   .3580768    -0.51   0.611    -.8841873    .5194478
       201707  |  -.2937749   .3816117    -0.77   0.441     -1.04172    .4541703
       201708  |     -.3934    .360003    -1.09   0.274    -1.098993    .3121929
       201709  |  -.2873831   .3188987    -0.90   0.367     -.912413    .3376468
       201710  |  -.2313636   .1850656    -1.25   0.211    -.5940855    .1313582
       201711  |  -.0252322   .1052026    -0.24   0.810    -.2314255     .180961
       201712  |  -.0593047   .0261882    -2.26   0.024    -.1106327   -.0079767
       201801  |  -.1413706   .0596189    -2.37   0.018    -.2582215   -.0245197
       201802  |    .038013    .042543     0.89   0.372    -.0453697    .1213957
       201803  |   .0540735   .1466265     0.37   0.712    -.2333092    .3414563
       201804  |     .02733   .2299543     0.12   0.905    -.4233722    .4780321
       201805  |  -.2037378   .3026366    -0.67   0.501    -.7968945     .389419
       201806  |  -.2666488   .3817013    -0.70   0.485     -1.01477     .481472
       201807  |  -.3718702   .3946379    -0.94   0.346    -1.145346    .4016059
       201808  |   -.430113   .3810716    -1.13   0.259       -1.177    .3167736
       201809  |  -.3423097   .2911614    -1.18   0.240    -.9129756    .2283562
       201810  |  -.1335385   .2052962    -0.65   0.515    -.5359117    .2688348
       201811  |  -.2170612   .1200683    -1.81   0.071    -.4523908    .0182684
       201812  |  -.2058149   .0423935    -4.85   0.000    -.2889047   -.1227251
       201901  |   -.241418   .0830144    -2.91   0.004    -.4041231   -.0787128
       201902  |  -.3545392   .1306681    -2.71   0.007     -.610644   -.0984345
       201903  |  -.2164199   .1761311    -1.23   0.219    -.5616305    .1287908
       201904  |   -.296357   .2478414    -1.20   0.232    -.7821172    .1894033
       201905  |  -.3101943    .348757    -0.89   0.374    -.9937455    .3733569
       201906  |  -.3623378   .4218942    -0.86   0.390    -1.189235    .4645597
       201907  |  -.4914021   .4221294    -1.16   0.244    -1.318761    .3359563
       201908  |  -.4677545   .3742994    -1.25   0.211    -1.201368    .2658588
       201909  |  -.4637917   .3586697    -1.29   0.196    -1.166771     .239188
       201910  |  -.3715436   .2724444    -1.36   0.173    -.9055248    .1624375
       201911  |  -.2766004   .1598837    -1.73   0.084    -.5899667    .0367658
       201912  |  -.2923955   .1129799    -2.59   0.010    -.5138321    -.070959
               |
       winddir |
       东南风  |  -.0342549   .0734872    -0.47   0.641    -.1782871    .1097774
         北风  |  -.0680534   .0499226    -1.36   0.173       -.1659    .0297932
         南风  |  -.1133807   .0514957    -2.20   0.028    -.2143104   -.0124509
   无持续风向  |   .0177206   .0540516     0.33   0.743    -.0882187    .1236599
       西北风  |   -.044902   .0263411    -1.70   0.088    -.0965297    .0067257
       西南风  |   .0714484   .0282031     2.53   0.011     .0161713    .1267255
               |
         _cons |   .2643038    .224441     1.18   0.239    -.1755924       .7042
---------------+----------------------------------------------------------------
hnhb_C30_lnvar |
         _cons |   -3.50101   .2267032   -15.44   0.000     -3.94534    -3.05668
---------------+----------------------------------------------------------------
js_C30_mean    |
        c_dudt |   .0683268   .0212182     3.22   0.001     .0267398    .1099138
       c_lngdp |  -.1965189   .0845159    -2.33   0.020    -.3621669   -.0308709
         c_lnp |   .5922828   .2134981     2.77   0.006     .1738342    1.010731
    c_max_temp |  -.0014059   .0044033    -0.32   0.750    -.0100362    .0072245
    c_min_temp |   .0002621   .0069897     0.04   0.970    -.0134374    .0139616
     c_windpow |  -.0062336    .022303    -0.28   0.780    -.0499467    .0374795
               |
            ym |
       201502  |   -.014404   .0099052    -1.45   0.146    -.0338179    .0050098
       201503  |     .00331   .0361611     0.09   0.927    -.0675644    .0741843
       201504  |    .028735   .0710332     0.40   0.686    -.1104875    .1679575
       201505  |   .0284999   .1009002     0.28   0.778    -.1692608    .2262606
       201506  |   .0470023   .1265985     0.37   0.710    -.2011263    .2951308
       201507  |   .0034924   .1517972     0.02   0.982    -.2940247    .3010095
       201508  |   .0331134   .1479996     0.22   0.823    -.2569605    .3231874
       201509  |   .0147102   .1220894     0.12   0.904    -.2245807    .2540011
       201510  |   .0031534    .085619     0.04   0.971    -.1646568    .1709636
       201511  |  -.0059737   .0458476    -0.13   0.896    -.0958333    .0838859
       201512  |  -.0192778    .016536    -1.17   0.244    -.0516877    .0131321
       201601  |  -.0831707   .0440271    -1.89   0.059    -.1694623    .0031209
       201602  |  -.1045116   .0530711    -1.97   0.049     -.208529   -.0004941
       201603  |  -.0653549     .06917    -0.94   0.345    -.2009256    .0702159
       201604  |  -.0562052   .1122727    -0.50   0.617    -.2762557    .1638453
       201605  |  -.0564322   .1311083    -0.43   0.667    -.3133997    .2005353
       201606  |  -.0554533   .1558796    -0.36   0.722    -.3609717    .2500652
       201607  |  -.0974004   .1768051    -0.55   0.582     -.443932    .2491311
       201608  |  -.0377124   .1629348    -0.23   0.817    -.3570587     .281634
       201609  |  -.0289212   .1249188    -0.23   0.817    -.2737576    .2159152
       201610  |  -.0560497   .0889891    -0.63   0.529    -.2304651    .1183657
       201611  |  -.0667914   .0425653    -1.57   0.117    -.1502179    .0166352
       201612  |  -.0549619   .0176475    -3.11   0.002    -.0895504   -.0203735
       201701  |  -.2175641   .0251989    -8.63   0.000     -.266953   -.1681752
       201702  |  -.2101747   .0278309    -7.55   0.000    -.2647222   -.1556272
       201703  |  -.2287036   .0380739    -6.01   0.000     -.303327   -.1540802
       201704  |  -.2023536    .077593    -2.61   0.009    -.3544332   -.0502741
       201705  |   -.206894   .1071003    -1.93   0.053    -.4168068    .0030187
       201706  |  -.1856448   .1303457    -1.42   0.154    -.4411176     .069828
       201707  |  -.1794815   .1590603    -1.13   0.259    -.4912339    .1322709
       201708  |  -.2036863   .1462263    -1.39   0.164    -.4902845    .0829119
       201709  |  -.1893861   .1250005    -1.52   0.130    -.4343826    .0556104
       201710  |  -.1934408   .0816465    -2.37   0.018    -.3534649   -.0334167
       201711  |   -.169034   .0412952    -4.09   0.000    -.2499711   -.0880969
       201712  |  -.2501096   .0240757   -10.39   0.000    -.2972972    -.202922
       201801  |  -.2692593   .0376405    -7.15   0.000    -.3430333   -.1954853
       201802  |  -.2612393   .0362143    -7.21   0.000    -.3322181   -.1902605
       201803  |  -.2345201   .0490849    -4.78   0.000    -.3307247   -.1383155
       201804  |  -.2321445   .0724709    -3.20   0.001    -.3741848   -.0901042
       201805  |  -.2485891   .1021427    -2.43   0.015    -.4487852   -.0483931
       201806  |  -.2253444   .1313121    -1.72   0.086    -.4827113    .0320226
       201807  |  -.2275836   .1542312    -1.48   0.140    -.5298711    .0747039
       201808  |   -.235462   .1550167    -1.52   0.129    -.5392892    .0683652
       201809  |  -.2368143   .1198072    -1.98   0.048    -.4716321   -.0019964
       201810  |  -.2394737   .0757495    -3.16   0.002    -.3879399   -.0910075
       201811  |  -.2645265   .0601156    -4.40   0.000    -.3823509   -.1467021
       201812  |  -.3056504   .0415035    -7.36   0.000    -.3869958    -.224305
       201901  |  -.3980203   .0511381    -7.78   0.000    -.4982491   -.2977914
       201902  |  -.4060323   .0482843    -8.41   0.000    -.5006679   -.3113968
       201903  |  -.3907035   .0600613    -6.51   0.000    -.5084214   -.2729855
       201904  |  -.3951726   .0825255    -4.79   0.000    -.5569197   -.2334255
       201905  |  -.3441561    .123868    -2.78   0.005     -.586933   -.1013792
       201906  |  -.3846157   .1486037    -2.59   0.010    -.6758736   -.0933578
       201907  |  -.4055487   .1700059    -2.39   0.017    -.7387541   -.0723432
       201908  |  -.3993071   .1614484    -2.47   0.013    -.7157401   -.0828742
       201909  |  -.3305045   .1433023    -2.31   0.021    -.6113718   -.0496372
       201910  |  -.3479801   .1071146    -3.25   0.001    -.5579208   -.1380393
       201911  |  -.3853582   .0665185    -5.79   0.000    -.5157322   -.2549843
       201912  |  -.3878333   .0497312    -7.80   0.000    -.4853046    -.290362
               |
       winddir |
  东北风~北风  |  -.3311484   .0249001   -13.30   0.000    -.3799518    -.282345
       东南风  |    .100737    .017737     5.68   0.000     .0659732    .1355009
         东风  |   .0792442     .01515     5.23   0.000     .0495507    .1089376
         北风  |   .0275476   .0128132     2.15   0.032     .0024343     .052661
    北风~南风  |  -.0014574   .0461736    -0.03   0.975     -.091956    .0890412
         南风  |   .0154786   .0147508     1.05   0.294    -.0134326    .0443897
  南风~东南风  |  -.3454031   .0229723   -15.04   0.000    -.3904279   -.3003783
    南风~北风  |  -.1258152    .061248    -2.05   0.040    -.2458591   -.0057714
   无持续风向  |   -.061803   .0230793    -2.68   0.007    -.1070375   -.0165685
       西北风  |   .0615896   .0156599     3.93   0.000     .0308967    .0922825
       西南风  |   .0271341   .0199542     1.36   0.174    -.0119753    .0662436
               |
         _cons |   .1455899   .0793443     1.83   0.067     -.009922    .3011019
---------------+----------------------------------------------------------------
js_C30_lnvar   |
         _cons |  -4.474769   .1167698   -38.32   0.000    -4.703634   -4.245905
--------------------------------------------------------------------------------

. test [hnhb_C30_mean]c_dudt = [js_C30_mean]c_dudt

 ( 1)  [hnhb_C30_mean]c_dudt - [js_C30_mean]c_dudt = 0

           chi2(  1) =    9.16
         Prob > chi2 =    0.0025

. 
. reg c_lnC31 c_dudt $c_cov i.ym i.winddir if (hnhb==1|boundary==0)&(policy_city==1)

      Source |       SS           df       MS      Number of obs   =     1,635
-------------+----------------------------------   F(71, 1563)     =     22.11
       Model |  149.772742        71  2.10947524   Prob > F        =    0.0000
    Residual |  149.118247     1,563  .095405148   R-squared       =    0.5011
-------------+----------------------------------   Adj R-squared   =    0.4784
       Total |  298.890989     1,634  .182919822   Root MSE        =    .30888

------------------------------------------------------------------------------
     c_lnC31 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.2011861   .0427687    -4.70   0.000    -.2850762    -.117296
     c_lngdp |   .7880351   .0694902    11.34   0.000     .6517313    .9243389
       c_lnp |  -2.250659   .1968044   -11.44   0.000    -2.636687    -1.86463
  c_max_temp |  -.0868619   .0205778    -4.22   0.000    -.1272249    -.046499
  c_min_temp |   .0003532   .0152909     0.02   0.982    -.0296397    .0303461
   c_windpow |  -.1390558   .0355368    -3.91   0.000    -.2087606   -.0693509
             |
          ym |
     201502  |   .1282487   .0873756     1.47   0.142    -.0431371    .2996345
     201503  |   .8493809   .1718275     4.94   0.000     .5123441    1.186418
     201504  |   1.264717   .2404153     5.26   0.000     .7931465    1.736287
     201505  |   1.777433   .3463287     5.13   0.000     1.098115    2.456751
     201506  |   2.160298   .4144415     5.21   0.000     1.347379    2.973218
     201507  |   2.044295   .4426456     4.62   0.000     1.176054    2.912537
     201508  |   1.953666    .416081     4.70   0.000      1.13753    2.769801
     201509  |   1.662585   .3504166     4.74   0.000      .975249    2.349921
     201510  |    1.31594   .2721659     4.84   0.000     .7820913    1.849789
     201511  |   .1919381   .1177146     1.63   0.103    -.0389571    .4228333
     201512  |   -.130297   .0890061    -1.46   0.143    -.3048809     .044287
     201601  |  -.5123032   .1133233    -4.52   0.000    -.7345848   -.2900215
     201602  |  -.1341221   .0981299    -1.37   0.172    -.3266023    .0583582
     201603  |   .6533334   .1970503     3.32   0.001     .2668226    1.039844
     201604  |   1.356952   .3225574     4.21   0.000     .7242609    1.989642
     201605  |   1.584376   .3621369     4.38   0.000     .8740507    2.294702
     201606  |   2.015673    .434698     4.64   0.000     1.163021    2.868326
     201607  |    2.04431   .4414157     4.63   0.000      1.17848    2.910139
     201608  |   1.929166   .4184008     4.61   0.000      1.10848    2.749852
     201609  |   1.820134    .373973     4.87   0.000     1.086592    2.553675
     201610  |   1.168055   .2577383     4.53   0.000     .6625057    1.673604
     201611  |   .4242007   .1315103     3.23   0.001     .1662454     .682156
     201612  |   .0315356   .0916436     0.34   0.731    -.1482217    .2112929
     201701  |  -.7892676   .0915192    -8.62   0.000    -.9687809   -.6097543
     201702  |  -.3141111   .0956059    -3.29   0.001    -.5016403   -.1265818
     201703  |   .1500731   .1527513     0.98   0.326     -.149546    .4496922
     201704  |   .9275789   .2744429     3.38   0.001     .3892639    1.465894
     201705  |   1.561394   .3853974     4.05   0.000     .8054433    2.317344
     201706  |   1.608412   .4152571     3.87   0.000      .793892    2.422931
     201707  |   1.711395   .4463526     3.83   0.000     .8358817    2.586908
     201708  |   1.518769   .4144385     3.66   0.000     .7058551    2.331683
     201709  |   1.277211   .3753437     3.40   0.001     .5409803    2.013441
     201710  |    .542723   .2296263     2.36   0.018     .0923149     .993131
     201711  |   .0911512    .143567     0.63   0.526     -.190453    .3727554
     201712  |  -.4895004    .083577    -5.86   0.000    -.6534352   -.3255656
     201801  |  -1.008078   .1057882    -9.53   0.000     -1.21558   -.8005762
     201802  |  -.6022606   .0894125    -6.74   0.000    -.7776417   -.4268794
     201803  |    .253876   .1814916     1.40   0.162    -.1021167    .6098688
     201804  |   .8023995   .2747391     2.92   0.004     .2635035    1.341296
     201805  |   1.072111   .3518113     3.05   0.002     .3820393    1.762183
     201806  |   1.492609   .4392799     3.40   0.001     .6309694     2.35425
     201807  |   1.573594   .4619251     3.41   0.001     .6675359    2.479652
     201808  |   1.553493   .4358092     3.56   0.000     .6986607    2.408325
     201809  |   .9402945   .3434752     2.74   0.006     .2665737    1.614015
     201810  |   .4256194   .2466776     1.73   0.085    -.0582345    .9094733
     201811  |  -.1403325   .1531952    -0.92   0.360    -.4408223    .1601572
     201812  |  -.7644152   .0941536    -8.12   0.000    -.9490959   -.5797344
     201901  |  -.3400321   .0953297    -3.57   0.000    -.5270196   -.1530446
     201902  |   .0235676   .0985714     0.24   0.811    -.1697786    .2169137
     201903  |   .7986834   .1846602     4.33   0.000     .4364756    1.160891
     201904  |   1.210207   .2467271     4.91   0.000     .7262557    1.694158
     201905  |   1.932168   .3740967     5.16   0.000     1.198383    2.665952
     201906  |    2.35295   .4600963     5.11   0.000     1.450479    3.255421
     201907  |   2.162809   .4556385     4.75   0.000     1.269082    3.056536
     201908  |   1.859461   .3986111     4.66   0.000     1.077592     2.64133
     201909  |   1.700435   .3696254     4.60   0.000      .975421    2.425449
     201910  |   1.271014   .2571666     4.94   0.000     .7665865    1.775442
     201911  |   .5370937   .1503519     3.57   0.000     .2421811    .8320063
     201912  |  -.0220118   .0934098    -0.24   0.814    -.2052336      .16121
             |
     winddir |
     东南风  |   .1987895   .0442005     4.50   0.000     .1120909    .2854881
       北风  |   .1787873   .0389866     4.59   0.000     .1023158    .2552589
       南风  |   .2145264   .0325103     6.60   0.000      .150758    .2782947
 无持续风向  |  -.3137134   .0830438    -3.78   0.000    -.4766025   -.1508244
     西北风  |   .2122065   .0610636     3.48   0.001     .0924314    .3319816
     西南风  |   .0255626   .0385944     0.66   0.508    -.0501397    .1012649
             |
       _cons |  -1.009764   .2372499    -4.26   0.000    -1.475126   -.5444028
------------------------------------------------------------------------------

. est store hnhb_C31

. reg c_lnC31 c_dudt $c_cov i.ym i.winddir if (js==1|boundary==0)&(policy_city==0)

      Source |       SS           df       MS      Number of obs   =     3,230
-------------+----------------------------------   F(76, 3153)     =    134.24
       Model |  1110.16794        76  14.6074728   Prob > F        =    0.0000
    Residual |  343.087671     3,153  .108813089   R-squared       =    0.7639
-------------+----------------------------------   Adj R-squared   =    0.7582
       Total |  1453.25561     3,229  .450063675   Root MSE        =    .32987

------------------------------------------------------------------------------
     c_lnC31 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      c_dudt |  -.0284153   .0497251    -0.57   0.568    -.1259121    .0690815
     c_lngdp |  -.3551516    .076622    -4.64   0.000    -.5053857   -.2049175
       c_lnp |  -.2568853   .2812099    -0.91   0.361    -.8082582    .2944876
  c_max_temp |  -.0557924    .007794    -7.16   0.000    -.0710743   -.0405106
  c_min_temp |    .002859   .0104694     0.27   0.785    -.0176685    .0233865
   c_windpow |   .1968364   .0200818     9.80   0.000     .1574616    .2362112
             |
          ym |
     201502  |   .0443444   .0607721     0.73   0.466    -.0748125    .1635013
     201503  |   .4781751   .0879358     5.44   0.000      .305758    .6505922
     201504  |   .5901845   .1205569     4.90   0.000     .3538065    .8265624
     201505  |    1.09852   .1621037     6.78   0.000     .7806808     1.41636
     201506  |   1.371161   .1951678     7.03   0.000     .9884921     1.75383
     201507  |   1.434979   .2179517     6.58   0.000     1.007638    1.862321
     201508  |   1.440371   .2188572     6.58   0.000     1.011254    1.869488
     201509  |   1.272308   .1835128     6.93   0.000     .9124918    1.632125
     201510  |   .9000976   .1361216     6.61   0.000     .6332017    1.166993
     201511  |   .2185407   .0872749     2.50   0.012     .0474194    .3896619
     201512  |   .0982186    .064426     1.52   0.127    -.0281025    .2245398
     201601  |   .1545964    .079388     1.95   0.052     -.001061    .3102538
     201602  |   .4481858   .0786554     5.70   0.000     .2939648    .6024069
     201603  |   .7239477   .0977954     7.40   0.000     .5321987    .9156967
     201604  |   1.193996   .1450628     8.23   0.000      .909569    1.478423
     201605  |   1.428933   .1709631     8.36   0.000     1.093723    1.764143
     201606  |   1.595688   .2063893     7.73   0.000     1.191017    2.000359
     201607  |   1.642004   .2318737     7.08   0.000     1.187365    2.096643
     201608  |   1.498557   .2295853     6.53   0.000     1.048405    1.948709
     201609  |   1.175256   .1884099     6.24   0.000     .8058376    1.544674
     201610  |    .662723   .1387791     4.78   0.000     .3906165    .9348295
     201611  |   .2446761   .0853011     2.87   0.004     .0774248    .4119274
     201612  |  -.0446494   .0637298    -0.70   0.484    -.1696054    .0803066
     201701  |  -1.194128   .0614994   -19.42   0.000     -1.31471   -1.073545
     201702  |  -1.063174   .0630222   -16.87   0.000    -1.186743   -.9396056
     201703  |  -.7728199   .0787476    -9.81   0.000    -.9272215   -.6184182
     201704  |  -.3138913   .1290057    -2.43   0.015    -.5668349   -.0609476
     201705  |   .0117122   .1699093     0.07   0.945    -.3214318    .3448563
     201706  |   .2274436   .1956528     1.16   0.245    -.1561761    .6110632
     201707  |   .3421624   .2346347     1.46   0.145    -.1178898    .8022146
     201708  |   .1889061   .2192586     0.86   0.389     -.240998    .6188102
     201709  |   .1047798   .1873888     0.56   0.576    -.2626366    .4721962
     201710  |  -.4395014   .1306899    -3.36   0.001    -.6957473   -.1832555
     201711  |  -.7116422   .0869527    -8.18   0.000    -.8821317   -.5411527
     201712  |  -1.089513    .064417   -16.91   0.000    -1.215817   -.9632099
     201801  |  -1.188405   .0669074   -17.76   0.000    -1.319591   -1.057218
     201802  |  -1.037709   .0685625   -15.14   0.000    -1.172141   -.9032771
     201803  |   -.627001   .0899454    -6.97   0.000    -.8033584   -.4506436
     201804  |  -.3345392   .1225634    -2.73   0.006    -.5748513   -.0942271
     201805  |   .0142813   .1628262     0.09   0.930    -.3049747    .3335373
     201806  |   .2792851   .1985196     1.41   0.160    -.1099555    .6685256
     201807  |   .3320965   .2309218     1.44   0.150    -.1206757    .7848687
     201808  |   .3485101   .2316378     1.50   0.133    -.1056659    .8026862
     201809  |   .0401902   .1800155     0.22   0.823    -.3127692    .3931495
     201810  |  -.2584716   .1256744    -2.06   0.040    -.5048834   -.0120597
     201811  |  -.5433476   .0938297    -5.79   0.000     -.727321   -.3593742
     201812  |  -.7633372   .0741618   -10.29   0.000    -.9087474   -.6179269
     201901  |  -1.016126   .0735642   -13.81   0.000    -1.160365   -.8718876
     201902  |   -.991152   .0737126   -13.45   0.000    -1.135681   -.8466225
     201903  |  -.6153388   .0921772    -6.68   0.000    -.7960721   -.4346055
     201904  |  -.5334898   .1209462    -4.41   0.000    -.7706309   -.2963486
     201905  |  -.0047801   .1729103    -0.03   0.978    -.3438082     .334248
     201906  |   .0743683   .2016971     0.37   0.712    -.3211025    .4698392
     201907  |   .2298013     .23113     0.99   0.320    -.2233791    .6829816
     201908  |    .201309   .2207159     0.91   0.362    -.2314524    .6340705
     201909  |   .0991129   .1984746     0.50   0.618    -.2900395    .4882653
     201910  |  -.2344533   .1440768    -1.63   0.104    -.5169472    .0480405
     201911  |  -.6179413   .0975737    -6.33   0.000    -.8092557   -.4266269
     201912  |  -.9317195   .0765336   -12.17   0.000     -1.08178   -.7816588
             |
     winddir |
东北风~北风  |  -.8517946   .2406521    -3.54   0.000    -1.323645   -.3799441
     东南风  |   .0187988   .0409693     0.46   0.646    -.0615303     .099128
       东风  |  -.2592852   .0637654    -4.07   0.000    -.3843111   -.1342594
       北风  |   -.009055   .0359879    -0.25   0.801     -.079617    .0615071
  北风~南风  |  -.2782433   .1007646    -2.76   0.006    -.4758141   -.0806726
       南风  |  -.1019821   .0379333    -2.69   0.007    -.1763585   -.0276057
南风~东南风  |  -.7876942   .2407248    -3.27   0.001    -1.259687   -.3157012
  南风~北风  |  -.4939378   .1437383    -3.44   0.001    -.7757679   -.2121077
 无持续风向  |  -.1755122   .0509799    -3.44   0.001    -.2754694    -.075555
     西北风  |  -.1774161   .0357747    -4.96   0.000      -.24756   -.1072721
     西南风  |  -.0610037    .047701    -1.28   0.201    -.1545318    .0325245
             |
       _cons |  -.0462232   .1225676    -0.38   0.706    -.2865435    .1940971
------------------------------------------------------------------------------

. est store js_C31

. suest hnhb_C31 js_C31, vce(cluster monitor_id)

Simultaneous results for hnhb_C31, js_C31                Number of obs = 4,865

                             (Std. err. adjusted for 105 clusters in monitor_id)
--------------------------------------------------------------------------------
               |               Robust
               | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
hnhb_C31_mean  |
        c_dudt |  -.2011861    .200009    -1.01   0.314    -.5931966    .1908243
       c_lngdp |   .7880351   .1937822     4.07   0.000     .4082289    1.167841
         c_lnp |  -2.250659   .4969653    -4.53   0.000    -3.224693   -1.276624
    c_max_temp |  -.0868619   .0341704    -2.54   0.011    -.1538347   -.0198892
    c_min_temp |   .0003532   .0412397     0.01   0.993    -.0804751    .0811815
     c_windpow |  -.1390558   .0922263    -1.51   0.132     -.319816    .0417044
               |
            ym |
       201502  |   .1282487   .0764508     1.68   0.093     -.021592    .2780895
       201503  |   .8493809   .3461716     2.45   0.014     .1708971    1.527865
       201504  |   1.264717   .5152554     2.45   0.014     .2548349    2.274599
       201505  |   1.777433   .7988273     2.23   0.026     .2117604    3.343106
       201506  |   2.160298   .9725521     2.22   0.026     .2541314    4.066465
       201507  |   2.044295   1.084913     1.88   0.060    -.0820956    4.170686
       201508  |   1.953666   1.018159     1.92   0.055    -.0418896    3.949221
       201509  |   1.662585   .8533373     1.95   0.051    -.0099253    3.335096
       201510  |    1.31594   .6015511     2.19   0.029     .1369215    2.494958
       201511  |   .1919381    .248222     0.77   0.439    -.2945682    .6784444
       201512  |   -.130297    .065097    -2.00   0.045    -.2578848   -.0027092
       201601  |  -.5123032   .1648428    -3.11   0.002     -.835389   -.1892173
       201602  |  -.1341221    .107481    -1.25   0.212     -.344781    .0765369
       201603  |   .6533334   .3892179     1.68   0.093    -.1095196    1.416186
       201604  |   1.356952   .7131191     1.90   0.057    -.0407361    2.754639
       201605  |   1.584376   .7998013     1.98   0.048     .0167944    3.151958
       201606  |   2.015673   .9916459     2.03   0.042     .0720832    3.959263
       201607  |    2.04431   1.087113     1.88   0.060    -.0863935    4.175013
       201608  |   1.929166   1.020753     1.89   0.059    -.0714734    3.929805
       201609  |   1.820134   .8709866     2.09   0.037     .1130313    3.527236
       201610  |   1.168055   .5961036     1.96   0.050    -.0002865    2.336397
       201611  |   .4242007   .2570506     1.65   0.099    -.0796092    .9280105
       201612  |   .0315356   .0826981     0.38   0.703    -.1305498     .193621
       201701  |  -.7892676   .1263557    -6.25   0.000     -1.03692    -.541615
       201702  |  -.3141111   .1029858    -3.05   0.002    -.5159595   -.1122626
       201703  |   .1500731   .2786645     0.54   0.590    -.3960993    .6962455
       201704  |   .9275789   .6032462     1.54   0.124     -.254762     2.10992
       201705  |   1.561394   .8624335     1.81   0.070     -.128945    3.251732
       201706  |   1.608412   .9655878     1.67   0.096    -.2841056    3.500929
       201707  |   1.711395   1.096689     1.56   0.119     -.438076    3.860865
       201708  |   1.518769    1.03435     1.47   0.142    -.5085196    3.546058
       201709  |   1.277211   .9007453     1.42   0.156    -.4882177    3.042639
       201710  |    .542723   .5585132     0.97   0.331    -.5519429    1.637389
       201711  |   .0911512   .2535596     0.36   0.719    -.4058165    .5881189
       201712  |  -.4895004   .0874135    -5.60   0.000    -.6608276   -.3181732
       201801  |  -1.008078   .1488208    -6.77   0.000    -1.299761   -.7163945
       201802  |  -.6022606   .0779562    -7.73   0.000    -.7550519   -.4494693
       201803  |    .253876   .3693758     0.69   0.492    -.4700873    .9778394
       201804  |   .8023995   .6075864     1.32   0.187    -.3884478    1.993247
       201805  |   1.072111    .831185     1.29   0.197    -.5569814    2.701204
       201806  |   1.492609   1.057706     1.41   0.158    -.5804562    3.565675
       201807  |   1.573594   1.158011     1.36   0.174     -.696066    3.843254
       201808  |   1.553493   1.114954     1.39   0.164     -.631776    3.738762
       201809  |   .9402945   .8402712     1.12   0.263    -.7066068    2.587196
       201810  |   .4256194   .5403011     0.79   0.431    -.6333513     1.48459
       201811  |  -.1403325    .342838    -0.41   0.682    -.8122826    .5316175
       201812  |  -.7644152   .1294513    -5.91   0.000    -1.018135   -.5106952
       201901  |  -.3400321   .1635441    -2.08   0.038    -.6605727   -.0194915
       201902  |   .0235676   .2499929     0.09   0.925    -.4664095    .5135446
       201903  |   .7986834   .4219555     1.89   0.058    -.0283342    1.625701
       201904  |   1.210207   .6171743     1.96   0.050     .0005674    2.419846
       201905  |   1.932168   .9161097     2.11   0.035     .1366258     3.72771
       201906  |    2.35295   1.130354     2.08   0.037     .1374972    4.568402
       201907  |   2.162809   1.177206     1.84   0.066    -.1444728     4.47009
       201908  |   1.859461   1.053527     1.76   0.078    -.2054138    3.924336
       201909  |   1.700435   .9638273     1.76   0.078    -.1886317    3.589502
       201910  |   1.271014   .6931667     1.83   0.067    -.0875674    2.629596
       201911  |   .5370937   .3869077     1.39   0.165    -.2212316    1.295419
       201912  |  -.0220118   .2123211    -0.10   0.917    -.4381535      .39413
               |
       winddir |
       东南风  |   .1987895   .0603998     3.29   0.001     .0804081     .317171
         北风  |   .1787873   .0666419     2.68   0.007     .0481715    .3094031
         南风  |   .2145264   .0674894     3.18   0.001     .0822496    .3468031
   无持续风向  |  -.3137134    .093928    -3.34   0.001     -.497809   -.1296179
       西北风  |   .2122065   .0762248     2.78   0.005     .0628087    .3616043
       西南风  |   .0255626   .0340938     0.75   0.453    -.0412601    .0923853
               |
         _cons |  -1.009764   .5868846    -1.72   0.085    -2.160037    .1405082
---------------+----------------------------------------------------------------
hnhb_C31_lnvar |
         _cons |  -2.349623   .1492714   -15.74   0.000    -2.642189   -2.057056
---------------+----------------------------------------------------------------
js_C31_mean    |
        c_dudt |  -.0284153   .1554034    -0.18   0.855    -.3330004    .2761697
       c_lngdp |  -.3551516   .1532617    -2.32   0.020     -.655539   -.0547642
         c_lnp |  -.2568853   1.431077    -0.18   0.858    -3.061745    2.547974
    c_max_temp |  -.0557924   .0205567    -2.71   0.007    -.0960829    -.015502
    c_min_temp |    .002859   .0333158     0.09   0.932    -.0624388    .0681569
     c_windpow |   .1968364   .0434225     4.53   0.000     .1117298    .2819429
               |
            ym |
       201502  |   .0443444   .0240957     1.84   0.066    -.0028822     .091571
       201503  |   .4781751    .143351     3.34   0.001     .1972123    .7591379
       201504  |   .5901845   .2509625     2.35   0.019     .0983071    1.082062
       201505  |    1.09852   .3795011     2.89   0.004     .3547116    1.842329
       201506  |   1.371161   .4792461     2.86   0.004     .4318559    2.310466
       201507  |   1.434979   .5657343     2.54   0.011     .3261602    2.543798
       201508  |   1.440371   .5613692     2.57   0.010     .3401076    2.540634
       201509  |   1.272308   .4505954     2.82   0.005     .3891577    2.155459
       201510  |   .9000976   .3133403     2.87   0.004     .2859618    1.514233
       201511  |   .2185407   .1895795     1.15   0.249    -.1530284    .5901097
       201512  |   .0982186   .0562904     1.74   0.081    -.0121086    .2085459
       201601  |   .1545964   .0997771     1.55   0.121    -.0409632     .350156
       201602  |   .4481858   .1161389     3.86   0.000     .2205578    .6758138
       201603  |   .7239477   .1868739     3.87   0.000     .3576816    1.090214
       201604  |   1.193996   .3298828     3.62   0.000     .5474376    1.840554
       201605  |   1.428933   .4043992     3.53   0.000     .6363252    2.221541
       201606  |   1.595688   .5119658     3.12   0.002     .5922537    2.599123
       201607  |   1.642004   .5990043     2.74   0.006     .4679771    2.816031
       201608  |   1.498557   .6040021     2.48   0.013     .3147347     2.68238
       201609  |   1.175256    .468902     2.51   0.012     .2562249    2.094287
       201610  |    .662723     .34306     1.93   0.053    -.0096622    1.335108
       201611  |   .2446761   .1660178     1.47   0.141    -.0807128     .570065
       201612  |  -.0446494    .063353    -0.70   0.481    -.1688191    .0795203
       201701  |  -1.194128   .0768479   -15.54   0.000    -1.344747   -1.043509
       201702  |  -1.063174    .063759   -16.67   0.000     -1.18814    -.938209
       201703  |  -.7728199   .0982919    -7.86   0.000    -.9654684   -.5801713
       201704  |  -.3138913   .2631678    -1.19   0.233    -.8296906    .2019081
       201705  |   .0117122   .3844138     0.03   0.976    -.7417249    .7651494
       201706  |   .2274436   .4724501     0.48   0.630    -.6985417    1.153429
       201707  |   .3421624   .6085084     0.56   0.574    -.8504921    1.534817
       201708  |   .1889061   .5690633     0.33   0.740    -.9264374     1.30425
       201709  |   .1047798   .4617926     0.23   0.821     -.800317    1.009877
       201710  |  -.4395014   .3112232    -1.41   0.158    -1.049488    .1704849
       201711  |  -.7116422   .1421262    -5.01   0.000    -.9902045   -.4330799
       201712  |  -1.089513    .062907   -17.32   0.000    -1.212809    -.966218
       201801  |  -1.188405   .0917865   -12.95   0.000    -1.368303   -1.008506
       201802  |  -1.037709   .0757966   -13.69   0.000    -1.186267   -.8891503
       201803  |   -.627001   .1496639    -4.19   0.000    -.9203368   -.3336652
       201804  |  -.3345392    .254013    -1.32   0.188    -.8323956    .1633172
       201805  |   .0142813   .3771023     0.04   0.970    -.7248256    .7533882
       201806  |   .2792851   .4810827     0.58   0.562    -.6636198     1.22219
       201807  |   .3320965   .5991856     0.55   0.579    -.8422857    1.506479
       201808  |   .3485101   .5967651     0.58   0.559     -.821128    1.518148
       201809  |   .0401902   .4345569     0.09   0.926    -.8115256    .8919059
       201810  |  -.2584716   .2578206    -1.00   0.316    -.7637907    .2468476
       201811  |  -.5433476   .1718202    -3.16   0.002     -.880109   -.2065862
       201812  |  -.7633372   .0625468   -12.20   0.000    -.8859266   -.6407477
       201901  |  -1.016126   .0923644   -11.00   0.000    -1.197157   -.8350952
       201902  |   -.991152   .0775561   -12.78   0.000    -1.143159   -.8391448
       201903  |  -.6153388    .131572    -4.68   0.000    -.8732152   -.3574623
       201904  |  -.5334898   .2312307    -2.31   0.021    -.9866936    -.080286
       201905  |  -.0047801   .3632846    -0.01   0.990    -.7168048    .7072446
       201906  |   .0743683   .4624743     0.16   0.872    -.8320646    .9808012
       201907  |   .2298013   .5574469     0.41   0.680    -.8627745    1.322377
       201908  |    .201309   .5478601     0.37   0.713     -.872477    1.275095
       201909  |   .0991129   .4507919     0.22   0.826     -.784423    .9826488
       201910  |  -.2344533   .2966066    -0.79   0.429    -.8157915    .3468849
       201911  |  -.6179413   .1645101    -3.76   0.000    -.9403751   -.2955075
       201912  |  -.9317195   .0941193    -9.90   0.000     -1.11619    -.747249
               |
       winddir |
  东北风~北风  |  -.8517946   .0856742    -9.94   0.000    -1.019713   -.6838763
       东南风  |   .0187988   .0346696     0.54   0.588    -.0491523      .08675
         东风  |  -.2592852   .0619282    -4.19   0.000    -.3806623   -.1379081
         北风  |   -.009055   .0306844    -0.30   0.768    -.0691952    .0510853
    北风~南风  |  -.2782433   .0734068    -3.79   0.000     -.422118   -.1343687
         南风  |  -.1019821   .0351931    -2.90   0.004    -.1709592   -.0330049
  南风~东南风  |  -.7876942    .085494    -9.21   0.000    -.9552594    -.620129
    南风~北风  |  -.4939378   .1243091    -3.97   0.000    -.7375792   -.2502964
   无持续风向  |  -.1755122   .0618032    -2.84   0.005    -.2966443   -.0543801
       西北风  |  -.1774161   .0617801    -2.87   0.004    -.2985028   -.0563293
       西南风  |  -.0610037   .0523592    -1.17   0.244    -.1636258    .0416184
               |
         _cons |  -.0462232    .279165    -0.17   0.868    -.5933765    .5009301
---------------+----------------------------------------------------------------
js_C31_lnvar   |
         _cons |  -2.218124   .1508623   -14.70   0.000    -2.513808   -1.922439
--------------------------------------------------------------------------------

. test [hnhb_C31_mean]c_dudt = [js_C31_mean]c_dudt

 ( 1)  [hnhb_C31_mean]c_dudt - [js_C31_mean]c_dudt = 0

           chi2(  1) =    0.47
         Prob > chi2 =    0.4952

. 
. log close
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA11.log
  log type:  text
 closed on:  20 Feb 2024, 01:26:26
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
