-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\Table8.log
  log type:  text
 opened on:  20 Feb 2024, 01:17:40

. 
. global cov lngdp lnp max_temp min_temp windpow

. 
. use "Rep_folder\data\Shandong_sample.dta", clear

. replace city = city1
variable city was str6 now str9
(5,821 real changes made)

. merge m:1 city year using "Rep_folder\data\Government_work_report.dta", keepusing(text len huanjing huanbao wuran) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             5,821  
    -----------------------------------------

. 
. cap drop post dudt

. gen post = (ym>=201703)

. gen dudt = post * boundary

. gen total_words = huanjing + huanbao + wuran

. gen total_r = (huanjing + huanbao + wuran) / len * 10000

. gen huanjing_r = huanjing / len * 10000

. gen huanbao_r = huanbao / len * 10000

. gen wuran_r = wuran / len * 10000

. est drop _all

. 
. ** JAPCP-covered boundary
. reghdfe total_words dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,705
Absorbing 3 HDFE groups                           F(   6,     99) =      14.83
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6478
                                                  Adj R-squared   =     0.6341
                                                  Within R-sq.    =     0.1165
Number of clusters (monitor_id) =        100      Root MSE        =     5.6542

                           (Std. err. adjusted for 100 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
 total_words | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .4104308    3.67434     0.11   0.911    -6.880257    7.701118
       lngdp |   11.02032    1.82673     6.03   0.000     7.395692    14.64495
         lnp |  -45.85666   8.243406    -5.56   0.000    -62.21337   -29.49995
    max_temp |   .3459909   .1887151     1.83   0.070    -.0284608    .7204427
    min_temp |   -.495891   .2837461    -1.75   0.084    -1.058905    .0671229
     windpow |   3.675336   .8935737     4.11   0.000     1.902292     5.44838
       _cons |   144.2203   34.16182     4.22   0.000     76.43582    212.0048
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |       100         100           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_all_total

. reghdfe huanjing dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,705
Absorbing 3 HDFE groups                           F(   6,     99) =       8.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6803
                                                  Adj R-squared   =     0.6678
                                                  Within R-sq.    =     0.1003
Number of clusters (monitor_id) =        100      Root MSE        =     3.8058

                           (Std. err. adjusted for 100 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
    huanjing | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   1.464913    2.72368     0.54   0.592    -3.939459    6.869285
       lngdp |   9.651406   1.640503     5.88   0.000     6.396293    12.90652
         lnp |  -18.15189   6.213939    -2.92   0.004    -30.48169   -5.822086
    max_temp |   .1518676   .1286967     1.18   0.241    -.1034946    .4072297
    min_temp |   -.207899   .2014525    -1.03   0.305    -.6076244    .1918264
     windpow |   1.922408   .6715216     2.86   0.005     .5899633    3.254852
       _cons |   28.74492   24.62723     1.17   0.246    -20.12084    77.61068
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |       100         100           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_all_huanjing_q

. reghdfe huanbao dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,705
Absorbing 3 HDFE groups                           F(   6,     99) =      11.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6667
                                                  Adj R-squared   =     0.6537
                                                  Within R-sq.    =     0.1723
Number of clusters (monitor_id) =        100      Root MSE        =     1.5316

                           (Std. err. adjusted for 100 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     huanbao | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .2667149   .3535706     0.75   0.452    -.4348458    .9682756
       lngdp |   2.258397   .4984202     4.53   0.000     1.269423    3.247371
         lnp |  -21.68749   3.604259    -6.02   0.000    -28.83912   -14.53586
    max_temp |  -.0066165   .0497055    -0.13   0.894    -.1052429    .0920099
    min_temp |   .0020272   .0508836     0.04   0.968     -.098937    .1029913
     windpow |   .2389959   .1890314     1.26   0.209    -.1360834    .6140753
       _cons |   82.07996   15.24426     5.38   0.000     51.83204    112.3279
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |       100         100           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_all_huanbao_q

. reghdfe wuran dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,705
Absorbing 3 HDFE groups                           F(   6,     99) =      14.78
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4623
                                                  Adj R-squared   =     0.4414
                                                  Within R-sq.    =     0.0595
Number of clusters (monitor_id) =        100      Root MSE        =     2.5528

                           (Std. err. adjusted for 100 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       wuran | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -1.321197   .8972598    -1.47   0.144    -3.101555    .4591612
       lngdp |  -.8894817   1.132616    -0.79   0.434    -3.136838    1.357874
         lnp |  -6.017282   3.377465    -1.78   0.078     -12.7189    .6843415
    max_temp |   .2007399   .1049262     1.91   0.059    -.0074565    .4089362
    min_temp |  -.2900192   .1321765    -2.19   0.031     -.552286   -.0277524
     windpow |   1.513932    .213896     7.08   0.000     1.089516    1.938348
       _cons |   33.39541   14.26297     2.34   0.021     5.094586    61.69623
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |       100         100           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_all_wuran_q

. reghdfe total_r dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,705
Absorbing 3 HDFE groups                           F(   6,     99) =      30.84
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5696
                                                  Adj R-squared   =     0.5529
                                                  Within R-sq.    =     0.1592
Number of clusters (monitor_id) =        100      Root MSE        =     2.8248

                           (Std. err. adjusted for 100 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     total_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .8459353   2.357596     0.36   0.720    -3.832047    5.523917
       lngdp |   6.208651   1.037666     5.98   0.000     4.149697    8.267606
         lnp |   -31.3608    4.68249    -6.70   0.000    -40.65188   -22.06972
    max_temp |    .146461   .1003523     1.46   0.148    -.0526597    .3455818
    min_temp |  -.2606955   .1462273    -1.78   0.078    -.5508423    .0294512
     windpow |   1.819761   .4705243     3.87   0.000      .886139    2.753384
       _cons |   106.4482   21.11402     5.04   0.000     64.55336     148.343
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |       100         100           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_all_total_r

. reghdfe huanjing_r dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,705
Absorbing 3 HDFE groups                           F(   6,     99) =      22.07
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4931
                                                  Adj R-squared   =     0.4734
                                                  Within R-sq.    =     0.1295
Number of clusters (monitor_id) =        100      Root MSE        =     1.9854

                           (Std. err. adjusted for 100 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
  huanjing_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |    1.55581   1.690583     0.92   0.360    -1.798673    4.910293
       lngdp |   5.134565   .7663181     6.70   0.000     3.614023    6.655106
         lnp |  -13.25145   3.306662    -4.01   0.000    -19.81259    -6.69032
    max_temp |   .0327879   .0685847     0.48   0.634     -.103299    .1688749
    min_temp |  -.0673864   .0991432    -0.68   0.498     -.264108    .1293352
     windpow |   1.069052    .337524     3.17   0.002     .3993313    1.738773
       _cons |   31.55343   14.76005     2.14   0.035     2.266287    60.84058
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |       100         100           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_all_huanjing_r 

. reghdfe huanbao_r dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,705
Absorbing 3 HDFE groups                           F(   6,     99) =      13.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6809
                                                  Adj R-squared   =     0.6685
                                                  Within R-sq.    =     0.1930
Number of clusters (monitor_id) =        100      Root MSE        =     0.9209

                           (Std. err. adjusted for 100 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
   huanbao_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .1560295   .2593188     0.60   0.549    -.3585152    .6705742
       lngdp |   1.518132   .3346921     4.54   0.000     .8540302    2.182234
         lnp |  -13.93444   1.971289    -7.07   0.000     -17.8459   -10.02297
    max_temp |   -.004838   .0313475    -0.15   0.878    -.0670381    .0573622
    min_temp |   .0032219   .0332332     0.10   0.923      -.06272    .0691638
     windpow |   .0549345   .1072759     0.51   0.610    -.1579241    .2677932
       _cons |   52.32511   8.267592     6.33   0.000     35.92041    68.72981
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |       100         100           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_all_huanbao_r

. reghdfe wuran_r dudt $cov if (hnhb==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,705
Absorbing 3 HDFE groups                           F(   6,     99) =      11.11
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4835
                                                  Adj R-squared   =     0.4634
                                                  Within R-sq.    =     0.0521
Number of clusters (monitor_id) =        100      Root MSE        =     1.3752

                           (Std. err. adjusted for 100 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     wuran_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.8659042   .6030215    -1.44   0.154     -2.06243    .3306212
       lngdp |  -.4440454   .6131539    -0.72   0.471    -1.660676    .7725849
         lnp |  -4.174909   2.470352    -1.69   0.094    -9.076624    .7268051
    max_temp |   .1185111   .0571674     2.07   0.041     .0050785    .2319436
    min_temp |  -.1965311   .0838279    -2.34   0.021    -.3628637   -.0301984
     windpow |   .6957745   .1252656     5.55   0.000     .4472204    .9443285
       _cons |   22.56962   10.31946     2.19   0.031     2.093571    43.04567
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |       100         100           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_all_wuran_r

. 
. ** JAPCP-uncovered boundary
. reghdfe total_words dudt $cov if (js==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,505
Absorbing 3 HDFE groups                           F(   6,     92) =      13.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6532
                                                  Adj R-squared   =     0.6397
                                                  Within R-sq.    =     0.0977
Number of clusters (monitor_id) =         93      Root MSE        =     5.5803

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
 total_words | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -9.065314   1.169418    -7.75   0.000    -11.38788   -6.742748
       lngdp |   9.843707   2.028028     4.85   0.000     5.815868    13.87155
         lnp |  -27.66862     13.338    -2.07   0.041    -54.15903   -1.178201
    max_temp |   .3681025   .1833939     2.01   0.048     .0038664    .7323385
    min_temp |  -.6047798   .2683188    -2.25   0.027    -1.137684   -.0718755
     windpow |   3.335912   .9057842     3.68   0.000     1.536946    5.134877
       _cons |   74.21948   53.12239     1.40   0.166    -31.28617    179.7251
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_all_total

. reghdfe huanjing dudt $cov if (js==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,505
Absorbing 3 HDFE groups                           F(   6,     92) =      11.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6995
                                                  Adj R-squared   =     0.6878
                                                  Within R-sq.    =     0.0734
Number of clusters (monitor_id) =         93      Root MSE        =     3.7203

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
    huanjing | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -4.021245   .6563855    -6.13   0.000    -5.324883   -2.717606
       lngdp |   8.003511   1.716738     4.66   0.000     4.593921     11.4131
         lnp |  -6.635282   10.73199    -0.62   0.538    -27.94994    14.67938
    max_temp |   .1705503   .1193669     1.43   0.156    -.0665226    .4076231
    min_temp |  -.2884472   .1934059    -1.49   0.139     -.672568    .0956736
     windpow |    1.56856   .6869044     2.28   0.025     .2043084    2.932811
       _cons |  -8.731975   41.29687    -0.21   0.833    -90.75113    73.28718
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_all_huanjing_q

. reghdfe huanbao dudt $cov if (js==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,505
Absorbing 3 HDFE groups                           F(   6,     92) =      17.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6920
                                                  Adj R-squared   =     0.6800
                                                  Within R-sq.    =     0.0921
Number of clusters (monitor_id) =         93      Root MSE        =     1.2658

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     huanbao | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -2.751356   .3315446    -8.30   0.000    -3.409832    -2.09288
       lngdp |   2.189113    .463037     4.73   0.000     1.269481    3.108744
         lnp |  -10.38357   3.540819    -2.93   0.004    -17.41594   -3.351194
    max_temp |   .0114312   .0432331     0.26   0.792    -.0744334    .0972959
    min_temp |   -.020789   .0466674    -0.45   0.657    -.1134744    .0718964
     windpow |   .2727747   .1773526     1.54   0.127    -.0794628    .6250122
       _cons |   33.32619   14.37253     2.32   0.023     4.781098    61.87128
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_all_huanbao_q

. reghdfe wuran dudt $cov if (js==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,505
Absorbing 3 HDFE groups                           F(   6,     92) =      13.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4513
                                                  Adj R-squared   =     0.4299
                                                  Within R-sq.    =     0.0641
Number of clusters (monitor_id) =         93      Root MSE        =     2.5870

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       wuran | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -2.292713    1.09128    -2.10   0.038    -4.460089   -.1253372
       lngdp |  -.3489161   1.249507    -0.28   0.781    -2.830545    2.132713
         lnp |  -10.64977   5.462745    -1.95   0.054    -21.49925    .1997135
    max_temp |    .186121   .1060911     1.75   0.083    -.0245851     .396827
    min_temp |  -.2955437   .1354705    -2.18   0.032    -.5645997   -.0264876
     windpow |   1.494577   .2298729     6.50   0.000     1.038029    1.951124
       _cons |   49.62526   21.62942     2.29   0.024     6.667371    92.58315
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_all_wuran_q

. reghdfe total_r dudt $cov if (js==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,505
Absorbing 3 HDFE groups                           F(   6,     92) =      18.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5601
                                                  Adj R-squared   =     0.5429
                                                  Within R-sq.    =     0.1021
Number of clusters (monitor_id) =         93      Root MSE        =     2.6930

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     total_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -4.424674   .4838893    -9.14   0.000     -5.38572   -3.463628
       lngdp |   4.756975   1.095123     4.34   0.000     2.581965    6.931984
         lnp |  -25.33363   5.719314    -4.43   0.000    -36.69268   -13.97457
    max_temp |   .1607908   .0970064     1.66   0.101    -.0318722    .3534539
    min_temp |  -.2853197    .141017    -2.02   0.046    -.5653917   -.0052477
     windpow |   1.366392   .4761193     2.87   0.005     .4207775    2.312006
       _cons |   89.77616   25.20629     3.56   0.001     39.71429     139.838
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_all_total_r

. reghdfe huanjing_r dudt $cov if (js==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,505
Absorbing 3 HDFE groups                           F(   6,     92) =       8.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5271
                                                  Adj R-squared   =     0.5087
                                                  Within R-sq.    =     0.0630
Number of clusters (monitor_id) =         93      Root MSE        =     1.8611

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
  huanjing_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -1.457698   .3415047    -4.27   0.000    -2.135956   -.7794401
       lngdp |   3.828755    .762502     5.02   0.000      2.31436     5.34315
         lnp |  -11.51384   4.298157    -2.68   0.009    -20.05035    -2.97733
    max_temp |   .0398532   .0623681     0.64   0.524    -.0840151    .1637215
    min_temp |  -.0859199   .0953115    -0.90   0.370    -.2752168    .1033769
     windpow |    .723433   .3466857     2.09   0.040     .0348852    1.411981
       _cons |   32.87877   17.66637     1.86   0.066    -2.208153     67.9657
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_all_huanjing_r 

. reghdfe huanbao_r dudt $cov if (js==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,505
Absorbing 3 HDFE groups                           F(   6,     92) =      13.40
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6997
                                                  Adj R-squared   =     0.6880
                                                  Within R-sq.    =     0.0943
Number of clusters (monitor_id) =         93      Root MSE        =     0.7543

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
   huanbao_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -1.643825   .2382654    -6.90   0.000     -2.11704   -1.170609
       lngdp |   1.337238   .3366342     3.97   0.000     .6686535    2.005823
         lnp |   -6.76942   2.010703    -3.37   0.001    -10.76285   -2.775991
    max_temp |   .0077145   .0271225     0.28   0.777    -.0461531    .0615821
    min_temp |  -.0063508   .0302801    -0.21   0.834    -.0664897     .053788
     windpow |   .0383916   .1030541     0.37   0.710    -.1662826    .2430659
       _cons |   22.31109    7.97798     2.80   0.006      6.46613    38.15604
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_all_huanbao_r

. reghdfe wuran_r dudt $cov if (js==1|boundary==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,505
Absorbing 3 HDFE groups                           F(   6,     92) =       9.49
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4715
                                                  Adj R-squared   =     0.4508
                                                  Within R-sq.    =     0.0571
Number of clusters (monitor_id) =         93      Root MSE        =     1.3706

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     wuran_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -1.323152   .5483974    -2.41   0.018    -2.412316   -.2339871
       lngdp |  -.4090185   .6619441    -0.62   0.538    -1.723697    .9056596
         lnp |  -7.050366   3.105779    -2.27   0.026    -13.21871   -.8820206
    max_temp |   .1132231    .058174     1.95   0.055    -.0023154    .2287616
    min_temp |  -.1930489   .0885297    -2.18   0.032    -.3688766   -.0172212
     windpow |   .6045668    .124627     4.85   0.000     .3570467    .8520868
       _cons |   34.58631   12.24219     2.83   0.006     10.27227    58.90034
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_all_wuran_r

. 
. ** Panel A
. esttab hnhb_all_*, mtitle se(%6.3f) b(%6.3f) ar2 star(* 0.1 ** 0.05 *** 0.01) keep(dudt)

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
             hnhb_all_t~l    hnhb_all_h~q    hnhb_all_h~q    hnhb_all_w~q    hnhb_all_t~r    hnhb_all_h~r    hnhb_all_h~r    hnhb_all_w~r   
--------------------------------------------------------------------------------------------------------------------------------------------
dudt                0.410           1.465           0.267          -1.321           0.846           1.556           0.156          -0.866   
                  (3.674)         (2.724)         (0.354)         (0.897)         (2.358)         (1.691)         (0.259)         (0.603)   
--------------------------------------------------------------------------------------------------------------------------------------------
N                    4705            4705            4705            4705            4705            4705            4705            4705   
adj. R-sq           0.634           0.668           0.654           0.441           0.553           0.473           0.668           0.463   
--------------------------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. ** Panel B
. esttab js_all_*, mtitle se(%6.3f) b(%6.3f) ar2 star(* 0.1 ** 0.05 *** 0.01) keep(dudt)

--------------------------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)   
             js_all_total    js_all_hua~q    js_all_hua~q    js_all_wur~q    js_all_tot~r    js_all_hua~r    js_all_hua~r    js_all_wur~r   
--------------------------------------------------------------------------------------------------------------------------------------------
dudt               -9.065***       -4.021***       -2.751***       -2.293**        -4.425***       -1.458***       -1.644***       -1.323** 
                  (1.169)         (0.656)         (0.332)         (1.091)         (0.484)         (0.342)         (0.238)         (0.548)   
--------------------------------------------------------------------------------------------------------------------------------------------
N                    4505            4505            4505            4505            4505            4505            4505            4505   
adj. R-sq           0.640           0.688           0.680           0.430           0.543           0.509           0.688           0.451   
--------------------------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. log close
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\Table8.log
  log type:  text
 closed on:  20 Feb 2024, 01:17:42
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
