-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\Table4.log
  log type:  text
 opened on:  20 Feb 2024, 01:13:54

. 
. global cov lngdp lnp max_temp min_temp windpow

. 
. /* Panel A: Setting Post = 1 after March 2017. */
. * By county
. use "Rep_folder\data\Shandong_sample.dta", clear

. cap drop post dudt

. gen post = (ym>=201703)

. gen dudt = post * boundary

. est drop _all

. 
. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,499
Absorbing 3 HDFE groups                           F(   6,     92) =      13.21
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9206
                                                  Adj R-squared   =     0.9148
                                                  Within R-sq.    =     0.0394
Number of clusters (monitor_id) =         93      Root MSE        =     0.1052

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0003964   .0168088     0.02   0.981    -.0329872    .0337801
       lngdp |   .0621142   .0312747     1.99   0.050    -1.10e-07    .1242284
         lnp |  -.2908837   .1379495    -2.11   0.038    -.5648632   -.0169041
    max_temp |   .0191076   .0043145     4.43   0.000     .0105386    .0276767
    min_temp |  -.0214139   .0041751    -5.13   0.000    -.0297059   -.0131218
     windpow |  -.0435379   .0072614    -6.00   0.000    -.0579597   -.0291162
       _cons |   5.173063   .5948303     8.70   0.000     3.991678    6.354447
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        93          93           0    *|
           ym |        60           0          60     |
   winddir#ym |       211          60         151     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm20_winddirym

. 
. cap drop nomiss

. gen nomiss = e(sample)

. drop if nomiss==0
(1,322 observations deleted)

. 
. reghdfe lnAQI dudt if (js==1|boundary==0), absorb(monitor_id ym) cluster(monitor_id)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      4,499
Absorbing 2 HDFE groups                           F(   1,     92) =       0.03
Statistics robust to heteroskedasticity           Prob > F        =     0.8632
                                                  R-squared       =     0.9020
                                                  Adj R-squared   =     0.8986
                                                  Within R-sq.    =     0.0000
Number of clusters (monitor_id) =         93      Root MSE        =     0.1148

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.0030445   .0176257    -0.17   0.863    -.0380507    .0319617
       _cons |   4.363961    .000474  9205.86   0.000     4.363019    4.364902
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm20_no_covs

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,499
Absorbing 3 HDFE groups                           F(   6,     92) =      21.19
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9102
                                                  Adj R-squared   =     0.9067
                                                  Within R-sq.    =     0.0643
Number of clusters (monitor_id) =         93      Root MSE        =     0.1101

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0004459   .0139953     0.03   0.975      -.02735    .0282418
       lngdp |   .0861874   .0307596     2.80   0.006     .0250962    .1472787
         lnp |  -.4064184   .1407596    -2.89   0.005    -.6859791   -.1268577
    max_temp |   .0201884   .0041658     4.85   0.000     .0119147    .0284621
    min_temp |  -.0247495   .0037841    -6.54   0.000    -.0322651   -.0172338
     windpow |  -.0545458   .0073932    -7.38   0.000    -.0692293   -.0398624
       _cons |   5.553091   .6170338     9.00   0.000     4.327608    6.778573
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm20_with_covs

. 
. 
. * By distance to the boundaries
. use "Rep_folder\data\Shandong_sample.dta", clear

. cap drop post dudt

. gen post = (ym>=201703)

. gen dudt = post * boundary

. sum dist if js==1&boundary==1 // The average distance to the boundaries of the boundary stations is 30,903 m.

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        dist |        300    30903.03    16717.61   3659.384      51133

. 
. // replace lnAQI = AQI
. replace boundary = dist<=10000
(583 real changes made)

. replace dudt = post * boundary
(337 real changes made)

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,812
Absorbing 3 HDFE groups                           F(   6,    100) =      23.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9229
                                                  Adj R-squared   =     0.9174
                                                  Within R-sq.    =     0.0414
Number of clusters (monitor_id) =        101      Root MSE        =     0.1050

                           (Std. err. adjusted for 101 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0392919   .0085518     4.59   0.000     .0223254    .0562583
       lngdp |   .0330025   .0326709     1.01   0.315    -.0318156    .0978205
         lnp |  -.1184079   .0830731    -1.43   0.157    -.2832224    .0464067
    max_temp |   .0185261    .004217     4.39   0.000     .0101597    .0268924
    min_temp |  -.0221117   .0041633    -5.31   0.000    -.0303716   -.0138518
     windpow |   -.047883   .0071096    -6.73   0.000    -.0619882   -.0337778
       _cons |   4.679904   .3807291    12.29   0.000     3.924549     5.43526
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |       101         101           0    *|
           ym |        60           0          60     |
   winddir#ym |       215          60         155     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm20_d10000

. 
. replace boundary = dist<=30000
(120 real changes made)

. replace dudt = post * boundary
(68 real changes made)

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,812
Absorbing 3 HDFE groups                           F(   6,    100) =      14.92
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9229
                                                  Adj R-squared   =     0.9174
                                                  Within R-sq.    =     0.0414
Number of clusters (monitor_id) =        101      Root MSE        =     0.1050

                           (Std. err. adjusted for 101 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.0240659   .0290224    -0.83   0.409    -.0816454    .0335136
       lngdp |   .0328338   .0326848     1.00   0.318    -.0320119    .0976796
         lnp |   -.114554    .083346    -1.37   0.172      -.27991     .050802
    max_temp |   .0186695   .0042234     4.42   0.000     .0102903    .0270486
    min_temp |  -.0222303   .0041556    -5.35   0.000    -.0304749   -.0139858
     windpow |  -.0482281   .0071475    -6.75   0.000    -.0624086   -.0340476
       _cons |   4.664398   .3821255    12.21   0.000     3.906272    5.422524
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |       101         101           0    *|
           ym |        60           0          60     |
   winddir#ym |       215          60         155     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm20_d30000

. 
. replace boundary = dist<=50000
(571 real changes made)

. replace dudt = post * boundary
(340 real changes made)

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,553
Absorbing 3 HDFE groups                           F(   6,     94) =      13.49
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9212
                                                  Adj R-squared   =     0.9154
                                                  Within R-sq.    =     0.0401
Number of clusters (monitor_id) =         95      Root MSE        =     0.1052

                            (Std. err. adjusted for 95 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.0266338   .0146872    -1.81   0.073    -.0557957     .002528
       lngdp |   .0604727   .0312979     1.93   0.056    -.0016701    .1226154
         lnp |  -.2921828   .1362271    -2.14   0.035    -.5626649   -.0217006
    max_temp |    .018786    .004304     4.36   0.000     .0102403    .0273317
    min_temp |   -.021707    .004161    -5.22   0.000    -.0299688   -.0134453
     windpow |  -.0438037   .0071962    -6.09   0.000    -.0580919   -.0295155
       _cons |   5.205321   .5888423     8.84   0.000     4.036161    6.374481
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        95          95           0    *|
           ym |        60           0          60     |
   winddir#ym |       211          60         151     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm20_d50000

. 
. replace boundary = dist<=70000
(477 real changes made)

. replace dudt = post * boundary
(269 real changes made)

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,499
Absorbing 3 HDFE groups                           F(   6,     92) =      12.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9206
                                                  Adj R-squared   =     0.9148
                                                  Within R-sq.    =     0.0395
Number of clusters (monitor_id) =         93      Root MSE        =     0.1052

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.0081199   .0127764    -0.64   0.527     -.033495    .0172553
       lngdp |   .0631305   .0314617     2.01   0.048     .0006448    .1256161
         lnp |  -.2955832   .1363637    -2.17   0.033    -.5664132   -.0247532
    max_temp |   .0190316   .0043297     4.40   0.000     .0104324    .0276307
    min_temp |  -.0211457   .0042298    -5.00   0.000    -.0295464   -.0127451
     windpow |  -.0433357   .0072039    -6.02   0.000    -.0576433   -.0290282
       _cons |   5.185408   .5894401     8.80   0.000     4.014729    6.356087
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        93          93           0    *|
           ym |        60           0          60     |
   winddir#ym |       211          60         151     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm20_d70000

. 
. 
. /* Panel B: Setting Post = 1 after October 2017. */
. * By county
. use "Rep_folder\data\Shandong_sample.dta", clear

. cap drop post dudt

. gen post = (ym>=201710)

. gen dudt = post * boundary

. 
. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,499
Absorbing 3 HDFE groups                           F(   6,     92) =      14.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9208
                                                  Adj R-squared   =     0.9150
                                                  Within R-sq.    =     0.0418
Number of clusters (monitor_id) =         93      Root MSE        =     0.1051

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0530209    .018393     2.88   0.005     .0164908    .0895509
       lngdp |   .0586758   .0311594     1.88   0.063    -.0032095     .120561
         lnp |  -.2917749   .1370087    -2.13   0.036    -.5638859   -.0196638
    max_temp |   .0187891   .0042886     4.38   0.000     .0102716    .0273067
    min_temp |  -.0212443   .0041654    -5.10   0.000    -.0295172   -.0129714
     windpow |  -.0440557   .0073593    -5.99   0.000     -.058672   -.0294394
       _cons |   5.203617   .5917578     8.79   0.000     4.028335    6.378899
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        93          93           0    *|
           ym |        60           0          60     |
   winddir#ym |       211          60         151     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm21_winddirym

. 
. cap drop nomiss

. gen nomiss = e(sample)

. drop if nomiss==0
(1,322 observations deleted)

. 
. reghdfe lnAQI dudt if (js==1|boundary==0), absorb(monitor_id ym) cluster(monitor_id)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      4,499
Absorbing 2 HDFE groups                           F(   1,     92) =       5.39
Statistics robust to heteroskedasticity           Prob > F        =     0.0225
                                                  R-squared       =     0.9023
                                                  Adj R-squared   =     0.8988
                                                  Within R-sq.    =     0.0023
Number of clusters (monitor_id) =         93      Root MSE        =     0.1147

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0508605   .0219151     2.32   0.023     .0073351    .0943858
       _cons |   4.362907   .0004189  1.0e+04   0.000     4.362075    4.363739
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm21_no_covs

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      4,499
Absorbing 3 HDFE groups                           F(   6,     92) =      23.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9104
                                                  Adj R-squared   =     0.9069
                                                  Within R-sq.    =     0.0664
Number of clusters (monitor_id) =         93      Root MSE        =     0.1100

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0487761   .0164541     2.96   0.004     .0160967    .0814554
       lngdp |   .0831899   .0307436     2.71   0.008     .0221304    .1442494
         lnp |  -.4087085   .1401058    -2.92   0.004    -.6869707   -.1304462
    max_temp |   .0199651   .0041542     4.81   0.000     .0117146    .0282156
    min_temp |  -.0247039   .0037815    -6.53   0.000    -.0322143   -.0171935
     windpow |  -.0551149    .007407    -7.44   0.000    -.0698259   -.0404038
       _cons |   5.586398   .6138846     9.10   0.000      4.36717    6.805626
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        93          93           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm21_with_covs

. 
. 
. * By distance to the boundaries
. use "Rep_folder\data\Shandong_sample.dta", clear

. cap drop post dudt

. gen post = (ym>=201710)

. gen dudt = post * boundary

. sum dist if js==1&boundary==1 // The average distance to the boundaries of the boundary stations is 30,903 m.

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        dist |        300    30903.03    16717.61   3659.384      51133

. 
. // replace lnAQI = AQI
. replace boundary = dist<=10000
(583 real changes made)

. replace dudt = post * boundary
(267 real changes made)

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,812
Absorbing 3 HDFE groups                           F(   6,    100) =      28.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9230
                                                  Adj R-squared   =     0.9175
                                                  Within R-sq.    =     0.0422
Number of clusters (monitor_id) =        101      Root MSE        =     0.1050

                           (Std. err. adjusted for 101 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0820244   .0114143     7.19   0.000     .0593787    .1046702
       lngdp |   .0328901   .0326503     1.01   0.316    -.0318872    .0976675
         lnp |  -.1188188   .0829827    -1.43   0.155    -.2834542    .0458165
    max_temp |   .0183902   .0042081     4.37   0.000     .0100414     .026739
    min_temp |  -.0220302   .0041601    -5.30   0.000    -.0302836   -.0137767
     windpow |  -.0477612   .0070994    -6.73   0.000    -.0618463   -.0336762
       _cons |   4.683767   .3803915    12.31   0.000     3.929081    5.438453
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |       101         101           0    *|
           ym |        60           0          60     |
   winddir#ym |       215          60         155     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm21_d10000

. 
. replace boundary = dist<=30000
(120 real changes made)

. replace dudt = post * boundary
(54 real changes made)

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,812
Absorbing 3 HDFE groups                           F(   6,    100) =      16.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9230
                                                  Adj R-squared   =     0.9175
                                                  Within R-sq.    =     0.0425
Number of clusters (monitor_id) =        101      Root MSE        =     0.1050

                           (Std. err. adjusted for 101 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0603711   .0237208     2.55   0.012     .0133097    .1074325
       lngdp |   .0328014   .0326451     1.00   0.317    -.0319656    .0975684
         lnp |  -.1221444   .0834347    -1.46   0.146    -.2876765    .0433876
    max_temp |   .0182791   .0042192     4.33   0.000     .0099084    .0266499
    min_temp |  -.0220884   .0041512    -5.32   0.000    -.0303242   -.0138526
     windpow |  -.0474008   .0071132    -6.66   0.000    -.0615132   -.0332885
       _cons |   4.699953   .3820046    12.30   0.000     3.942067    5.457839
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |       101         101           0    *|
           ym |        60           0          60     |
   winddir#ym |       215          60         155     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm21_d30000

. 
. replace boundary = dist<=50000
(571 real changes made)

. replace dudt = post * boundary
(270 real changes made)

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,553
Absorbing 3 HDFE groups                           F(   6,     94) =      13.21
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9211
                                                  Adj R-squared   =     0.9153
                                                  Within R-sq.    =     0.0394
Number of clusters (monitor_id) =         95      Root MSE        =     0.1052

                            (Std. err. adjusted for 95 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0082875   .0210252     0.39   0.694    -.0334585    .0500335
       lngdp |   .0591775    .031319     1.89   0.062    -.0030072    .1213621
         lnp |  -.2841095   .1372217    -2.07   0.041    -.5565665   -.0116525
    max_temp |   .0186053   .0043054     4.32   0.000      .010057    .0271537
    min_temp |  -.0216575   .0041658    -5.20   0.000    -.0299288   -.0133862
     windpow |  -.0434299   .0071738    -6.05   0.000    -.0576736   -.0291862
       _cons |   5.179832   .5926808     8.74   0.000     4.003051    6.356614
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        95          95           0    *|
           ym |        60           0          60     |
   winddir#ym |       211          60         151     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm21_d50000

. 
. replace boundary = dist<=70000
(477 real changes made)

. replace dudt = post * boundary
(213 real changes made)

. reghdfe lnAQI dudt $cov if js==1|boundary==0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 6 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      4,499
Absorbing 3 HDFE groups                           F(   6,     92) =      14.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9208
                                                  Adj R-squared   =     0.9150
                                                  Within R-sq.    =     0.0417
Number of clusters (monitor_id) =         93      Root MSE        =     0.1051

                            (Std. err. adjusted for 93 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |    .034145   .0137036     2.49   0.015     .0069285    .0613616
       lngdp |   .0556161   .0311596     1.78   0.078    -.0062695    .1175017
         lnp |  -.2601809   .1377922    -1.89   0.062    -.5338481    .0134864
    max_temp |   .0189089   .0042652     4.43   0.000     .0104378      .02738
    min_temp |  -.0221352    .004117    -5.38   0.000    -.0303118   -.0139586
     windpow |  -.0444998   .0072885    -6.11   0.000    -.0589755   -.0300242
       _cons |   5.096094   .5942709     8.58   0.000      3.91582    6.276367
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        93          93           0    *|
           ym |        60           0          60     |
   winddir#ym |       211          60         151     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store bm21_d70000

. 
. ** Panel A
. esttab bm20_no_covs bm20_with_covs bm20_winddirym bm20_d*, mtitle se(%6.3f) b(%6.3f) ar2 star(* 0.1 ** 0.05 *** 0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             bm20_no_covs    bm20_with_~s    bm20_windd~m     bm20_d10000     bm20_d30000     bm20_d50000     bm20_d70000   
----------------------------------------------------------------------------------------------------------------------------
dudt               -0.003           0.000           0.000           0.039***       -0.024          -0.027*         -0.008   
                  (0.018)         (0.014)         (0.017)         (0.009)         (0.029)         (0.015)         (0.013)   

lngdp                               0.086***        0.062*          0.033           0.033           0.060*          0.063** 
                                  (0.031)         (0.031)         (0.033)         (0.033)         (0.031)         (0.031)   

lnp                                -0.406***       -0.291**        -0.118          -0.115          -0.292**        -0.296** 
                                  (0.141)         (0.138)         (0.083)         (0.083)         (0.136)         (0.136)   

max_temp                            0.020***        0.019***        0.019***        0.019***        0.019***        0.019***
                                  (0.004)         (0.004)         (0.004)         (0.004)         (0.004)         (0.004)   

min_temp                           -0.025***       -0.021***       -0.022***       -0.022***       -0.022***       -0.021***
                                  (0.004)         (0.004)         (0.004)         (0.004)         (0.004)         (0.004)   

windpow                            -0.055***       -0.044***       -0.048***       -0.048***       -0.044***       -0.043***
                                  (0.007)         (0.007)         (0.007)         (0.007)         (0.007)         (0.007)   

_cons               4.364***        5.553***        5.173***        4.680***        4.664***        5.205***        5.185***
                  (0.000)         (0.617)         (0.595)         (0.381)         (0.382)         (0.589)         (0.589)   
----------------------------------------------------------------------------------------------------------------------------
N                    4499            4499            4499            4812            4812            4553            4499   
adj. R-sq           0.899           0.907           0.915           0.917           0.917           0.915           0.915   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. ** Panel B
. esttab bm21_no_covs bm21_with_covs bm21_winddirym bm21_d*, mtitle se(%6.3f) b(%6.3f) ar2 star(* 0.1 ** 0.05 *** 0.01) 

----------------------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)             (7)   
             bm21_no_covs    bm21_with_~s    bm21_windd~m     bm21_d10000     bm21_d30000     bm21_d50000     bm21_d70000   
----------------------------------------------------------------------------------------------------------------------------
dudt                0.051**         0.049***        0.053***        0.082***        0.060**         0.008           0.034** 
                  (0.022)         (0.016)         (0.018)         (0.011)         (0.024)         (0.021)         (0.014)   

lngdp                               0.083***        0.059*          0.033           0.033           0.059*          0.056*  
                                  (0.031)         (0.031)         (0.033)         (0.033)         (0.031)         (0.031)   

lnp                                -0.409***       -0.292**        -0.119          -0.122          -0.284**        -0.260*  
                                  (0.140)         (0.137)         (0.083)         (0.083)         (0.137)         (0.138)   

max_temp                            0.020***        0.019***        0.018***        0.018***        0.019***        0.019***
                                  (0.004)         (0.004)         (0.004)         (0.004)         (0.004)         (0.004)   

min_temp                           -0.025***       -0.021***       -0.022***       -0.022***       -0.022***       -0.022***
                                  (0.004)         (0.004)         (0.004)         (0.004)         (0.004)         (0.004)   

windpow                            -0.055***       -0.044***       -0.048***       -0.047***       -0.043***       -0.044***
                                  (0.007)         (0.007)         (0.007)         (0.007)         (0.007)         (0.007)   

_cons               4.363***        5.586***        5.204***        4.684***        4.700***        5.180***        5.096***
                  (0.000)         (0.614)         (0.592)         (0.380)         (0.382)         (0.593)         (0.594)   
----------------------------------------------------------------------------------------------------------------------------
N                    4499            4499            4499            4812            4812            4553            4499   
adj. R-sq           0.899           0.907           0.915           0.917           0.917           0.915           0.915   
----------------------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. 
. log close
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\Table4.log
  log type:  text
 closed on:  20 Feb 2024, 01:13:56
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
