-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA1.log
  log type:  text
 opened on:  20 Feb 2024, 00:50:06

. 
. use "Rep_folder\data\Full_sample.dta", clear

. drop if year==2014|year==2020
(0 observations deleted)

. keep if ym<=201702
(19,414 observations deleted)

. 
. gen lndist = ln(dist)

. reghdfe lnAQI lndist if prov=="山东", absorb(ym) cluster(monitor_id)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      2,463
Absorbing 1 HDFE group                            F(   1,    102) =      45.43
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6628
                                                  Adj R-squared   =     0.6592
                                                  Within R-sq.    =     0.3644
Number of clusters (monitor_id) =        103      Root MSE        =     0.2164

                           (Std. err. adjusted for 103 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      lndist |  -.1556651   .0230943    -6.74   0.000    -.2014726   -.1098576
       _cons |   6.351843   .2720388    23.35   0.000     5.812256    6.891431
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
          ym |        26           0          26     |
-----------------------------------------------------+

. est store shandong

. reghdfe lnAQI lndist if prov=="山西", absorb(ym) cluster(monitor_id)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,430
Absorbing 1 HDFE group                            F(   1,     63) =       3.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0580
                                                  R-squared       =     0.6367
                                                  Adj R-squared   =     0.6300
                                                  Within R-sq.    =     0.0217
Number of clusters (monitor_id) =         64      Root MSE        =     0.2205

                            (Std. err. adjusted for 64 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      lndist |   .0550445   .0285061     1.93   0.058    -.0019204    .1120094
       _cons |   3.868404   .3157337    12.25   0.000     3.237461    4.499347
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
          ym |        26           0          26     |
-----------------------------------------------------+

. est store shanxi

. reghdfe lnAQI lndist if prov=="河南", absorb(ym) cluster(monitor_id)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,926
Absorbing 1 HDFE group                            F(   1,     76) =       0.37
Statistics robust to heteroskedasticity           Prob > F        =     0.5458
                                                  R-squared       =     0.8012
                                                  Adj R-squared   =     0.7985
                                                  Within R-sq.    =     0.0024
Number of clusters (monitor_id) =         77      Root MSE        =     0.1597

                            (Std. err. adjusted for 77 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      lndist |  -.0071034   .0117061    -0.61   0.546    -.0304181    .0162112
       _cons |   4.764199   .1275166    37.36   0.000     4.510228     5.01817
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
          ym |        26           0          26     |
-----------------------------------------------------+

. est store henan

. reghdfe lnAQI lndist if prov=="河北", absorb(ym) cluster(monitor_id)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =      1,353
Absorbing 1 HDFE group                            F(   1,     54) =      22.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4808
                                                  Adj R-squared   =     0.4706
                                                  Within R-sq.    =     0.0635
Number of clusters (monitor_id) =         55      Root MSE        =     0.2894

                            (Std. err. adjusted for 55 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      lndist |   .1107042   .0230883     4.79   0.000      .064415    .1569935
       _cons |   3.385905   .2707575    12.51   0.000     2.843069    3.928741
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
          ym |        26           0          26     |
-----------------------------------------------------+

. est store hebei

. 
. esttab shandong shanxi henan hebei, mtitle keep(lndist) star(* 0.1 ** 0.05 *** 0.01) ar2 se(%6.3f) b(%6.3f)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                 shandong          shanxi           henan           hebei   
----------------------------------------------------------------------------
lndist             -0.156***        0.055*         -0.007           0.111***
                  (0.023)         (0.029)         (0.012)         (0.023)   
----------------------------------------------------------------------------
N                    2463            1430            1926            1353   
adj. R-sq           0.659           0.630           0.798           0.471   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. log close
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA1.log
  log type:  text
 closed on:  20 Feb 2024, 00:50:07
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
