-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA5.log
  log type:  text
 opened on:  20 Feb 2024, 01:24:42

. 
. global cov lngdp lnp max_temp min_temp windpow

. 
. * JAPCP-covered boundary
. use "Rep_folder\data\Shandong_sample.dta", clear

. keep if hnhb==1|boundary==0
(300 observations deleted)

. cap drop post dudt

. gen post = (ym>=201703)

. gen dudt = post * boundary

. 
. psmatch2 treated lngdp lnp windpow max_temp min_temp i.winddir, logit ate neighbor(1) out(lnAQI) common
note: 2.winddir != 0 predicts failure perfectly;
      2.winddir omitted and 2 obs not used.

note: 7.winddir != 0 predicts failure perfectly;
      7.winddir omitted and 15 obs not used.

note: 9.winddir != 0 predicts failure perfectly;
      9.winddir omitted and 2 obs not used.


Logistic regression                                    Number of obs =   4,686
                                                       LR chi2(13)   = 2385.99
                                                       Prob > chi2   =  0.0000
Log likelihood = -1164.0364                            Pseudo R2     =  0.5061

------------------------------------------------------------------------------
    treated1 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lngdp |  -4.549628   .2060414   -22.08   0.000    -4.953462   -4.145794
         lnp |    6.28592    .259251    24.25   0.000     5.777797    6.794042
     windpow |  -1.188965   .0725626   -16.39   0.000    -1.331185   -1.046745
    max_temp |   .2185469   .0318305     6.87   0.000     .1561603    .2809334
    min_temp |  -.2142916   .0312052    -6.87   0.000    -.2754527   -.1531305
             |
     winddir |
东北风~北风  |          0  (empty)
     东南风  |  -1.214541    .213738    -5.68   0.000    -1.633459   -.7956219
       东风  |   1.024487   .6192525     1.65   0.098    -.1892259    2.238199
       北风  |  -1.395816   .1973576    -7.07   0.000     -1.78263   -1.009002
  北风~南风  |          0  (empty)
       南风  |  -1.308688   .1633972    -8.01   0.000    -1.628941   -.9884355
南风~东南风  |          0  (empty)
  南风~北风  |  -.1705504     1.2971    -0.13   0.895    -2.712819    2.371719
 无持续风向  |   .8612522   .3978581     2.16   0.030     .0814646     1.64104
     西北风  |  -1.856183   .2653528    -7.00   0.000    -2.376265   -1.336101
     西南风  |  -.1802509   .2147945    -0.84   0.401    -.6012403    .2407385
             |
       _cons |    1.54886   .8608415     1.80   0.072    -.1383584    3.236078
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
           lnAQI  Unmatched | 4.59882711   4.32389511   .274932002   .012703198    21.64
                        ATT | 4.57712511    4.4618317   .115293404   .048544012     2.38
                        ATU | 4.38580864   4.49319164   .107382999            .        .
                        ATE |                           .109669489            .        .
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |     1,760      1,980 |     3,740 
   Treated |       141        805 |       946 
-----------+----------------------+----------
     Total |     1,901      2,785 |     4,686 

. reghdfe lnAQI dudt $cov if _support==1&_weight!=0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 12 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      2,773
Absorbing 3 HDFE groups                           F(   6,     86) =      18.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9380
                                                  Adj R-squared   =     0.9309
                                                  Within R-sq.    =     0.0646
Number of clusters (monitor_id) =         87      Root MSE        =     0.0921

                            (Std. err. adjusted for 87 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |    -.11356   .0179739    -6.32   0.000    -.1492909   -.0778291
       lngdp |   .0460009   .0489932     0.94   0.350    -.0513944    .1433963
         lnp |  -.1958851   .0625757    -3.13   0.002    -.3202815   -.0714887
    max_temp |   .0154928   .0043896     3.53   0.001     .0067665    .0242191
    min_temp |  -.0167994   .0062432    -2.69   0.009    -.0292105   -.0043884
     windpow |  -.0386453   .0077118    -5.01   0.000    -.0539758   -.0233148
       _cons |   4.986766   .3035085    16.43   0.000     4.383411     5.59012
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        87          87           0    *|
           ym |        60           0          60     |
   winddir#ym |       191          60         131     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store psm_hnhb_neighbor1

. 
. psmatch2 treated lnp lngdp windpow max_temp min_temp i.winddir, logit ate radius common ties out(lnAQI) cal(0.01) 
note: 2.winddir != 0 predicts failure perfectly;
      2.winddir omitted and 2 obs not used.

note: 7.winddir != 0 predicts failure perfectly;
      7.winddir omitted and 15 obs not used.

note: 9.winddir != 0 predicts failure perfectly;
      9.winddir omitted and 2 obs not used.


Logistic regression                                    Number of obs =   4,686
                                                       LR chi2(13)   = 2385.99
                                                       Prob > chi2   =  0.0000
Log likelihood = -1164.0364                            Pseudo R2     =  0.5061

------------------------------------------------------------------------------
    treated1 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnp |    6.28592    .259251    24.25   0.000     5.777797    6.794042
       lngdp |  -4.549628   .2060414   -22.08   0.000    -4.953462   -4.145794
     windpow |  -1.188965   .0725626   -16.39   0.000    -1.331185   -1.046745
    max_temp |   .2185469   .0318305     6.87   0.000     .1561603    .2809334
    min_temp |  -.2142916   .0312052    -6.87   0.000    -.2754527   -.1531305
             |
     winddir |
东北风~北风  |          0  (empty)
     东南风  |  -1.214541    .213738    -5.68   0.000    -1.633459   -.7956219
       东风  |   1.024487   .6192525     1.65   0.098    -.1892259    2.238199
       北风  |  -1.395816   .1973576    -7.07   0.000     -1.78263   -1.009002
  北风~南风  |          0  (empty)
       南风  |  -1.308688   .1633972    -8.01   0.000    -1.628941   -.9884355
南风~东南风  |          0  (empty)
  南风~北风  |  -.1705504     1.2971    -0.13   0.895    -2.712819    2.371719
 无持续风向  |   .8612522   .3978581     2.16   0.030     .0814646     1.64104
     西北风  |  -1.856183   .2653528    -7.00   0.000    -2.376265   -1.336101
     西南风  |  -.1802509   .2147945    -0.84   0.401    -.6012403    .2407385
             |
       _cons |    1.54886   .8608415     1.80   0.072    -.1383584    3.236078
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
           lnAQI  Unmatched | 4.59882711   4.32389511   .274932002   .012703198    21.64
                        ATT | 4.56079683   4.39272625   .168070582   .026053497     6.45
                        ATU | 4.38609855   4.48894177   .102843219            .        .
                        ATE |                           .120240431            .        .
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |     1,777      1,963 |     3,740 
   Treated |       232        714 |       946 
-----------+----------------------+----------
     Total |     2,009      2,677 |     4,686 

. reghdfe lnAQI dudt $cov if _support==1&_weight!=0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 11 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      2,666
Absorbing 3 HDFE groups                           F(   6,     86) =      16.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9383
                                                  Adj R-squared   =     0.9310
                                                  Within R-sq.    =     0.0591
Number of clusters (monitor_id) =         87      Root MSE        =     0.0917

                            (Std. err. adjusted for 87 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.1101388   .0214692    -5.13   0.000    -.1528182   -.0674595
       lngdp |   .0556773   .0499748     1.11   0.268    -.0436694     .155024
         lnp |   -.239604   .0667178    -3.59   0.001    -.3722345   -.1069735
    max_temp |   .0161552   .0043654     3.70   0.000      .007477    .0248333
    min_temp |  -.0174061   .0064198    -2.71   0.008    -.0301682   -.0046439
     windpow |  -.0366855   .0076062    -4.82   0.000    -.0518062   -.0215649
       _cons |   5.095088   .2933342    17.37   0.000     4.511959    5.678218
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        87          87           0    *|
           ym |        60           0          60     |
   winddir#ym |       190          60         130     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store psm_hnhb_radius01

. 
. psmatch2 treated lngdp lnp windpow max_temp min_temp i.winddir, logit ate common ties out(lnAQI) kernel
note: 2.winddir != 0 predicts failure perfectly;
      2.winddir omitted and 2 obs not used.

note: 7.winddir != 0 predicts failure perfectly;
      7.winddir omitted and 15 obs not used.

note: 9.winddir != 0 predicts failure perfectly;
      9.winddir omitted and 2 obs not used.


Logistic regression                                    Number of obs =   4,686
                                                       LR chi2(13)   = 2385.99
                                                       Prob > chi2   =  0.0000
Log likelihood = -1164.0364                            Pseudo R2     =  0.5061

------------------------------------------------------------------------------
    treated1 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lngdp |  -4.549628   .2060414   -22.08   0.000    -4.953462   -4.145794
         lnp |    6.28592    .259251    24.25   0.000     5.777797    6.794042
     windpow |  -1.188965   .0725626   -16.39   0.000    -1.331185   -1.046745
    max_temp |   .2185469   .0318305     6.87   0.000     .1561603    .2809334
    min_temp |  -.2142916   .0312052    -6.87   0.000    -.2754527   -.1531305
             |
     winddir |
东北风~北风  |          0  (empty)
     东南风  |  -1.214541    .213738    -5.68   0.000    -1.633459   -.7956219
       东风  |   1.024487   .6192525     1.65   0.098    -.1892259    2.238199
       北风  |  -1.395816   .1973576    -7.07   0.000     -1.78263   -1.009002
  北风~南风  |          0  (empty)
       南风  |  -1.308688   .1633972    -8.01   0.000    -1.628941   -.9884355
南风~东南风  |          0  (empty)
  南风~北风  |  -.1705504     1.2971    -0.13   0.895    -2.712819    2.371719
 无持续风向  |   .8612522   .3978581     2.16   0.030     .0814646     1.64104
     西北风  |  -1.856183   .2653528    -7.00   0.000    -2.376265   -1.336101
     西南风  |  -.1802509   .2147945    -0.84   0.401    -.6012403    .2407385
             |
       _cons |    1.54886   .8608415     1.80   0.072    -.1383584    3.236078
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
           lnAQI  Unmatched | 4.59882711   4.32389511   .274932002   .012703198    21.64
                        ATT | 4.57712511    4.4105433   .166581804   .028644089     5.82
                        ATU | 4.38580864   4.48855314   .102744493            .        .
                        ATE |                            .12119657            .        .
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |     1,760      1,980 |     3,740 
   Treated |       141        805 |       946 
-----------+----------------------+----------
     Total |     1,901      2,785 |     4,686 

. reghdfe lnAQI dudt $cov if _support==1&_weight!=0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 12 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =      2,773
Absorbing 3 HDFE groups                           F(   6,     86) =      18.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9380
                                                  Adj R-squared   =     0.9309
                                                  Within R-sq.    =     0.0646
Number of clusters (monitor_id) =         87      Root MSE        =     0.0921

                            (Std. err. adjusted for 87 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |    -.11356   .0179739    -6.32   0.000    -.1492909   -.0778291
       lngdp |   .0460009   .0489932     0.94   0.350    -.0513944    .1433963
         lnp |  -.1958851   .0625757    -3.13   0.002    -.3202815   -.0714887
    max_temp |   .0154928   .0043896     3.53   0.001     .0067665    .0242191
    min_temp |  -.0167994   .0062432    -2.69   0.009    -.0292105   -.0043884
     windpow |  -.0386453   .0077118    -5.01   0.000    -.0539758   -.0233148
       _cons |   4.986766   .3035085    16.43   0.000     4.383411     5.59012
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        87          87           0    *|
           ym |        60           0          60     |
   winddir#ym |       191          60         131     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store psm_hnhb_kernel

. 
. * JAPCP-uncovered boundary
. use "Rep_folder\data\Shandong_sample.dta", clear

. keep if js==1|boundary==0
(517 observations deleted)

. cap drop post dudt

. gen post = (ym>=201710)

. gen dudt = post * boundary

. 
. psmatch2 treated lngdp lnp windpow max_temp min_temp i.winddir, logit ate neighbor(1) out(lnAQI) common
note: 2.winddir != 0 predicts failure perfectly;
      2.winddir omitted and 2 obs not used.

note: 7.winddir != 0 predicts failure perfectly;
      7.winddir omitted and 15 obs not used.

note: 9.winddir != 0 predicts failure perfectly;
      9.winddir omitted and 2 obs not used.


Logistic regression                                    Number of obs =   4,486
                                                       LR chi2(13)   = 1735.98
                                                       Prob > chi2   =  0.0000
Log likelihood = -1150.5426                            Pseudo R2     =  0.4300

------------------------------------------------------------------------------
    treated1 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lngdp |  -3.632602   .1952749   -18.60   0.000    -4.015334    -3.24987
         lnp |   3.851636   .2496098    15.43   0.000      3.36241    4.340863
     windpow |   -1.27316   .0754124   -16.88   0.000    -1.420966   -1.125355
    max_temp |    .186666   .0313644     5.95   0.000     .1251928    .2481391
    min_temp |   -.188002    .030979    -6.07   0.000    -.2487197   -.1272844
             |
     winddir |
东北风~北风  |          0  (empty)
     东南风  |  -.6137852   .2157745    -2.84   0.004    -1.036695   -.1908749
       东风  |   2.098327   .5021032     4.18   0.000     1.114223    3.082431
       北风  |  -.8840706   .2037952    -4.34   0.000    -1.283502   -.4846393
  北风~南风  |          0  (empty)
       南风  |  -.9986996   .1699855    -5.88   0.000    -1.331865   -.6655341
南风~东南风  |          0  (empty)
  南风~北风  |   .9993492   1.051085     0.95   0.342    -1.060739    3.059437
 无持续风向  |    1.55103    .330609     4.69   0.000     .9030488    2.199012
     西北风  |  -1.404076   .2515948    -5.58   0.000    -1.897193   -.9109596
     西南风  |  -.1311462   .2240287    -0.59   0.558    -.5702343    .3079419
             |
       _cons |   6.613249   .8033763     8.23   0.000     5.038661    8.187838
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
           lnAQI  Unmatched |  4.5633682   4.32389511   .239473093   .014033608    17.06
                        ATT | 4.54681362   4.48177666   .065036964   .032184428     2.02
                        ATU | 4.41724084   4.50722469   .089983848            .        .
                        ATE |                           .083950135            .        .
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |     1,900      1,840 |     3,740 
   Treated |       159        587 |       746 
-----------+----------------------+----------
     Total |     2,059      2,427 |     4,486 

. reghdfe lnAQI dudt $cov if _support==1&_weight!=0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 15 singleton observations)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      2,412
Absorbing 3 HDFE groups                           F(   6,     82) =       8.17
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9360
                                                  Adj R-squared   =     0.9281
                                                  Within R-sq.    =     0.0555
Number of clusters (monitor_id) =         83      Root MSE        =     0.0915

                            (Std. err. adjusted for 83 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0690522   .0251167     2.75   0.007     .0190872    .1190172
       lngdp |   .0376386   .0474997     0.79   0.430    -.0568533    .1321306
         lnp |  -.3211372    .161532    -1.99   0.050    -.6424759    .0002014
    max_temp |   .0192799   .0047151     4.09   0.000     .0099001    .0286597
    min_temp |  -.0181252   .0067146    -2.70   0.008    -.0314826   -.0047678
     windpow |  -.0431526   .0091343    -4.72   0.000    -.0613236   -.0249816
       _cons |   5.491074    .703281     7.81   0.000     4.092024    6.890124
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        83          83           0    *|
           ym |        60           0          60     |
   winddir#ym |       178          60         118     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store psm_js_neighbor1

. 
. psmatch2 treated lnp lngdp windpow max_temp min_temp i.winddir, logit ate radius common ties out(lnAQI) cal(0.01)
note: 2.winddir != 0 predicts failure perfectly;
      2.winddir omitted and 2 obs not used.

note: 7.winddir != 0 predicts failure perfectly;
      7.winddir omitted and 15 obs not used.

note: 9.winddir != 0 predicts failure perfectly;
      9.winddir omitted and 2 obs not used.


Logistic regression                                    Number of obs =   4,486
                                                       LR chi2(13)   = 1735.98
                                                       Prob > chi2   =  0.0000
Log likelihood = -1150.5426                            Pseudo R2     =  0.4300

------------------------------------------------------------------------------
    treated1 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lnp |   3.851636   .2496098    15.43   0.000      3.36241    4.340863
       lngdp |  -3.632602   .1952749   -18.60   0.000    -4.015334    -3.24987
     windpow |   -1.27316   .0754124   -16.88   0.000    -1.420966   -1.125355
    max_temp |    .186666   .0313644     5.95   0.000     .1251928    .2481391
    min_temp |   -.188002    .030979    -6.07   0.000    -.2487197   -.1272844
             |
     winddir |
东北风~北风  |          0  (empty)
     东南风  |  -.6137852   .2157745    -2.84   0.004    -1.036695   -.1908749
       东风  |   2.098327   .5021032     4.18   0.000     1.114223    3.082431
       北风  |  -.8840706   .2037952    -4.34   0.000    -1.283502   -.4846393
  北风~南风  |          0  (empty)
       南风  |  -.9986996   .1699855    -5.88   0.000    -1.331865   -.6655341
南风~东南风  |          0  (empty)
  南风~北风  |   .9993492   1.051085     0.95   0.342    -1.060739    3.059437
 无持续风向  |    1.55103    .330609     4.69   0.000     .9030488    2.199012
     西北风  |  -1.404076   .2515948    -5.58   0.000    -1.897193   -.9109596
     西南风  |  -.1311462   .2240287    -0.59   0.558    -.5702343    .3079419
             |
       _cons |   6.613249   .8033763     8.23   0.000     5.038661    8.187838
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
           lnAQI  Unmatched |  4.5633682   4.32389511   .239473093   .014033608    17.06
                        ATT |  4.5446851   4.42711718   .117567913   .018796184     6.25
                        ATU | 4.41724084   4.49275514   .075514304            .        .
                        ATE |                           .085353658            .        .
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |     1,900      1,840 |     3,740 
   Treated |       184        562 |       746 
-----------+----------------------+----------
     Total |     2,084      2,402 |     4,486 

. reghdfe lnAQI dudt $cov if _support==1&_weight!=0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 17 singleton observations)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      2,385
Absorbing 3 HDFE groups                           F(   6,     81) =       8.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9370
                                                  Adj R-squared   =     0.9291
                                                  Within R-sq.    =     0.0577
Number of clusters (monitor_id) =         82      Root MSE        =     0.0908

                            (Std. err. adjusted for 82 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0760099   .0287649     2.64   0.010     .0187768     .133243
       lngdp |   .0386338   .0475488     0.81   0.419    -.0559735     .133241
         lnp |  -.3155763   .1613505    -1.96   0.054    -.6366133    .0054607
    max_temp |   .0203706   .0045247     4.50   0.000      .011368    .0293732
    min_temp |  -.0184427   .0068066    -2.71   0.008    -.0319858   -.0048996
     windpow |  -.0422909   .0090749    -4.66   0.000    -.0603471   -.0242346
       _cons |   5.439438   .7014025     7.76   0.000     4.043867    6.835009
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        82          82           0    *|
           ym |        60           0          60     |
   winddir#ym |       176          60         116     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store psm_js_radius01

. 
. psmatch2 treated lngdp lnp windpow max_temp min_temp i.winddir, logit ate common ties out(lnAQI) kernel
note: 2.winddir != 0 predicts failure perfectly;
      2.winddir omitted and 2 obs not used.

note: 7.winddir != 0 predicts failure perfectly;
      7.winddir omitted and 15 obs not used.

note: 9.winddir != 0 predicts failure perfectly;
      9.winddir omitted and 2 obs not used.


Logistic regression                                    Number of obs =   4,486
                                                       LR chi2(13)   = 1735.98
                                                       Prob > chi2   =  0.0000
Log likelihood = -1150.5426                            Pseudo R2     =  0.4300

------------------------------------------------------------------------------
    treated1 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       lngdp |  -3.632602   .1952749   -18.60   0.000    -4.015334    -3.24987
         lnp |   3.851636   .2496098    15.43   0.000      3.36241    4.340863
     windpow |   -1.27316   .0754124   -16.88   0.000    -1.420966   -1.125355
    max_temp |    .186666   .0313644     5.95   0.000     .1251928    .2481391
    min_temp |   -.188002    .030979    -6.07   0.000    -.2487197   -.1272844
             |
     winddir |
东北风~北风  |          0  (empty)
     东南风  |  -.6137852   .2157745    -2.84   0.004    -1.036695   -.1908749
       东风  |   2.098327   .5021032     4.18   0.000     1.114223    3.082431
       北风  |  -.8840706   .2037952    -4.34   0.000    -1.283502   -.4846393
  北风~南风  |          0  (empty)
       南风  |  -.9986996   .1699855    -5.88   0.000    -1.331865   -.6655341
南风~东南风  |          0  (empty)
  南风~北风  |   .9993492   1.051085     0.95   0.342    -1.060739    3.059437
 无持续风向  |    1.55103    .330609     4.69   0.000     .9030488    2.199012
     西北风  |  -1.404076   .2515948    -5.58   0.000    -1.897193   -.9109596
     西南风  |  -.1311462   .2240287    -0.59   0.558    -.5702343    .3079419
             |
       _cons |   6.613249   .8033763     8.23   0.000     5.038661    8.187838
------------------------------------------------------------------------------
----------------------------------------------------------------------------------------
        Variable     Sample |    Treated     Controls   Difference         S.E.   T-stat
----------------------------+-----------------------------------------------------------
           lnAQI  Unmatched |  4.5633682   4.32389511   .239473093   .014033608    17.06
                        ATT | 4.54681362   4.43427752   .112536105   .019093634     5.89
                        ATU | 4.41724084    4.4557059   .038465064            .        .
                        ATE |                           .056380062            .        .
----------------------------+-----------------------------------------------------------
Note: S.E. does not take into account that the propensity score is estimated.

 psmatch2: |   psmatch2: Common
 Treatment |        support
assignment | Off suppo  On suppor |     Total
-----------+----------------------+----------
 Untreated |     1,900      1,840 |     3,740 
   Treated |       159        587 |       746 
-----------+----------------------+----------
     Total |     2,059      2,427 |     4,486 

. reghdfe lnAQI dudt $cov if _support==1&_weight!=0, absorb(monitor_id ym winddir#ym) cluster(monitor_id)
(dropped 15 singleton observations)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      2,412
Absorbing 3 HDFE groups                           F(   6,     82) =       8.17
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9360
                                                  Adj R-squared   =     0.9281
                                                  Within R-sq.    =     0.0555
Number of clusters (monitor_id) =         83      Root MSE        =     0.0915

                            (Std. err. adjusted for 83 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0690522   .0251167     2.75   0.007     .0190872    .1190172
       lngdp |   .0376386   .0474997     0.79   0.430    -.0568533    .1321306
         lnp |  -.3211372    .161532    -1.99   0.050    -.6424759    .0002014
    max_temp |   .0192799   .0047151     4.09   0.000     .0099001    .0286597
    min_temp |  -.0181252   .0067146    -2.70   0.008    -.0314826   -.0047678
     windpow |  -.0431526   .0091343    -4.72   0.000    -.0613236   -.0249816
       _cons |   5.491074    .703281     7.81   0.000     4.092024    6.890124
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   monitor_id |        83          83           0    *|
           ym |        60           0          60     |
   winddir#ym |       178          60         118     |
------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store psm_js_kernel

. 
. ** Panel A
. esttab psm_hnhb_*, mtitle se(%6.3f) b(%6.3f) ar2 keep(dudt) star(* 0.1 ** 0.05 *** 0.01)

------------------------------------------------------------
                      (1)             (2)             (3)   
             psm_hnhb_n~1    psm_hnhb_~01    psm_hnhb_k~l   
------------------------------------------------------------
dudt               -0.114***       -0.110***       -0.114***
                  (0.018)         (0.021)         (0.018)   
------------------------------------------------------------
N                    2773            2666            2773   
adj. R-sq           0.931           0.931           0.931   
------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. ** Panel B
. esttab psm_js_*, mtitle se(%6.3f) b(%6.3f) ar2 keep(dudt) star(* 0.1 ** 0.05 *** 0.01)

------------------------------------------------------------
                      (1)             (2)             (3)   
             psm_js_nei~1    psm_js_ra~01    psm_js_ker~l   
------------------------------------------------------------
dudt                0.069***        0.076***        0.069***
                  (0.025)         (0.029)         (0.025)   
------------------------------------------------------------
N                    2412            2385            2412   
adj. R-sq           0.928           0.929           0.928   
------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. log close
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA5.log
  log type:  text
 closed on:  20 Feb 2024, 01:24:56
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
