-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA7.log
  log type:  text
 opened on:  20 Feb 2024, 01:25:36

. 
. global cov lngdp lnp max_temp min_temp windpow

. 
. use "Rep_folder\data\Full_sample.dta", clear

. keep if ym>=201501&ym<=201912
(0 observations deleted)

. gen post = (ym>=201703)

. gen dudt = post * boundary

. rename wind windpower

. 
. reghdfe lnAQI dudt $cov if prov=="山西"&(dist_to_henan!=0|dist_to_hebei!=0|boundary==0), ///
>         absorb(monitor_id ym) cluster(monitor_id)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      3,373
Absorbing 2 HDFE groups                           F(   6,     65) =       8.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7808
                                                  Adj R-squared   =     0.7720
                                                  Within R-sq.    =     0.0254
Number of clusters (monitor_id) =         66      Root MSE        =     0.1535

                            (Std. err. adjusted for 66 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0387806   .0286927     1.35   0.181    -.0185227    .0960839
       lngdp |   .2074962   .2270964     0.91   0.364    -.2460466     .661039
         lnp |   3.164413    1.91887     1.65   0.104    -.6678351    6.996662
    max_temp |   .0117169   .0077579     1.51   0.136    -.0037767    .0272106
    min_temp |   .0121402    .008084     1.50   0.138    -.0040047    .0282851
   windpower |  -.0277431   .0090778    -3.06   0.003    -.0458728   -.0096134
       _cons |  -15.44821   10.42149    -1.48   0.143    -36.26136    5.364941
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        66          66           0    *|
          ym |        60           0          60     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store shanxi

. 
. reghdfe lnAQI dudt $cov if prov=="河南"&(dist_to_shandong!=0|dist_to_shanxi!=0|dist_to_hebei!=0|boundary==0), ///
>         absorb(monitor_id ym) cluster(monitor_id)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      4,466
Absorbing 2 HDFE groups                           F(   6,     85) =      14.93
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9050
                                                  Adj R-squared   =     0.9017
                                                  Within R-sq.    =     0.0312
Number of clusters (monitor_id) =         86      Root MSE        =     0.1118

                            (Std. err. adjusted for 86 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0236635   .0152812     1.55   0.125    -.0067195    .0540466
       lngdp |  -.2154194   .0479539    -4.49   0.000    -.3107646   -.1200742
         lnp |  -.0883942   .0669561    -1.32   0.190    -.2215208    .0447324
    max_temp |   .0256248   .0041657     6.15   0.000     .0173423    .0339073
    min_temp |  -.0031855   .0053697    -0.59   0.555    -.0138619    .0074909
   windpower |  -.0282875   .0117177    -2.41   0.018    -.0515854   -.0049897
       _cons |   6.371216    .580756    10.97   0.000     5.216517    7.525914
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        86          86           0    *|
          ym |        60           0          60     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store henan

. 
. reghdfe lnAQI dudt $cov if prov=="河北"&(dist_to_shandong!=0|dist_to_shanxi!=0|dist_to_hebei!=0|boundary==0), ///
>         absorb(monitor_id ym) cluster(monitor_id)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =      2,625
Absorbing 2 HDFE groups                           F(   6,     49) =      16.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8680
                                                  Adj R-squared   =     0.8619
                                                  Within R-sq.    =     0.1414
Number of clusters (monitor_id) =         50      Root MSE        =     0.1366

                            (Std. err. adjusted for 50 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       lnAQI | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0068901   .0474477     0.15   0.885    -.0884596    .1022399
       lngdp |  -.1355259   .1687878    -0.80   0.426    -.4747176    .2036658
         lnp |   .3216313   .5427923     0.59   0.556    -.7691506    1.412413
    max_temp |   .0001113   .0069316     0.02   0.987    -.0138182    .0140408
    min_temp |   .0466487   .0056815     8.21   0.000     .0352313    .0580661
   windpower |  -.0904067   .0145258    -6.22   0.000    -.1195975   -.0612159
       _cons |   3.344387   3.040752     1.10   0.277    -2.766234    9.455008
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        50          50           0    *|
          ym |        60           0          60     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hebei

. 
. esttab shanxi henan hebei, mtitle se(%6.3f) b(%6.3f) ar2 keep(dudt) star(* 0.1 ** 0.05 *** 0.01)

------------------------------------------------------------
                      (1)             (2)             (3)   
                   shanxi           henan           hebei   
------------------------------------------------------------
dudt                0.039           0.024           0.007   
                  (0.029)         (0.015)         (0.047)   
------------------------------------------------------------
N                    3373            4466            2625   
adj. R-sq           0.772           0.902           0.862   
------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. 
. log close
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA7.log
  log type:  text
 closed on:  20 Feb 2024, 01:25:37
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
