-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA12.log
  log type:  text
 opened on:  20 Feb 2024, 01:27:05

. 
. global cov lngdp lnp max_temp min_temp windpow

. 
. use "Rep_folder\data\Shandong_sample.dta", clear

. replace city = city1
variable city was str6 now str9
(5,821 real changes made)

. merge m:1 city year using "Rep_folder\data\Government_work_report.dta", keepusing(text len huanjing huanbao wuran) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                             5,821  
    -----------------------------------------

. 
. cap drop post dudt

. gen post = (ym>=201703)

. gen dudt = post * boundary

. gen total_words = huanjing + huanbao + wuran

. gen total_r = (huanjing + huanbao + wuran) / len * 10000

. gen huanjing_r = huanjing / len * 10000

. gen huanbao_r = huanbao / len * 10000

. gen wuran_r = wuran / len * 10000

. est drop _all

. 
. reghdfe huanjing dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      1,665
Absorbing 3 HDFE groups                           F(   6,     36) =      49.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6978
                                                  Adj R-squared   =     0.6768
                                                  Within R-sq.    =     0.3525
Number of clusters (monitor_id) =         37      Root MSE        =     2.9890

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
    huanjing | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   3.405103   2.474385     1.38   0.177    -1.613183    8.423389
       lngdp |   11.02058   1.602459     6.88   0.000     7.770638    14.27051
         lnp |  -22.45694   4.818671    -4.66   0.000    -32.22966   -12.68423
    max_temp |   .2705615   .2374094     1.14   0.262    -.2109272    .7520501
    min_temp |   .8296726   .2623028     3.16   0.003     .2976978    1.361647
     windpow |   3.484072   .6965333     5.00   0.000     2.071437    4.896707
       _cons |   23.01631   21.36546     1.08   0.289    -20.31484    66.34747
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_adj_huanjing 

. reghdfe huanbao dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      1,665
Absorbing 3 HDFE groups                           F(   6,     36) =     124.97
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7251
                                                  Adj R-squared   =     0.7060
                                                  Within R-sq.    =     0.3207
Number of clusters (monitor_id) =         37      Root MSE        =     1.7082

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     huanbao | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   .0522694   .4201613     0.12   0.902    -.7998573    .9043961
       lngdp |   1.211559    .677949     1.79   0.082    -.1633854    2.586503
         lnp |   -26.1002   1.684971   -15.49   0.000    -29.51747   -22.68292
    max_temp |   .1005621   .1477432     0.68   0.500    -.1990751    .4001993
    min_temp |   .1362439   .1351406     1.01   0.320     -.137834    .4103218
     windpow |  -.5113422   .6102837    -0.84   0.408    -1.749055    .7263705
       _cons |   106.7377   8.953486    11.92   0.000     88.57918    124.8962
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_adj_huanbao

. reghdfe wuran dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      1,665
Absorbing 3 HDFE groups                           F(   6,     36) =       6.13
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.4170
                                                  Adj R-squared   =     0.3765
                                                  Within R-sq.    =     0.0372
Number of clusters (monitor_id) =         37      Root MSE        =     2.1821

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       wuran | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.6303829   .9960621    -0.63   0.531    -2.650491    1.389725
       lngdp |    .684658   .9061387     0.76   0.455    -1.153076    2.522392
         lnp |  -1.343462    2.76759    -0.49   0.630    -6.956395    4.269472
    max_temp |   .1402319    .268338     0.52   0.604    -.4039828    .6844467
    min_temp |  -.3950915   .2669877    -1.48   0.148    -.9365677    .1463847
     windpow |    2.19825   .6304825     3.49   0.001     .9195722    3.476928
       _cons |   5.999162   11.83715     0.51   0.615    -18.00769    30.00601
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_adj_wuran

. reghdfe huanjing_r dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      1,665
Absorbing 3 HDFE groups                           F(   6,     36) =      50.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.4830
                                                  Adj R-squared   =     0.4471
                                                  Within R-sq.    =     0.3313
Number of clusters (monitor_id) =         37      Root MSE        =     1.9424

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
  huanjing_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   2.828376   1.648447     1.72   0.095    -.5148304    6.171582
       lngdp |   5.835248   1.138866     5.12   0.000      3.52552    8.144976
         lnp |  -12.25466   3.590683    -3.41   0.002     -19.5369   -4.972416
    max_temp |   .2824737   .1252327     2.26   0.030       .02849    .5364575
    min_temp |   .3640478   .1460294     2.49   0.017     .0678865    .6602092
     windpow |   2.548767   .5157611     4.94   0.000     1.502755    3.594778
       _cons |   11.30181   14.91406     0.76   0.454     -18.9453    41.54891
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_adj_huanjing_r 

. reghdfe huanbao_r dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      1,665
Absorbing 3 HDFE groups                           F(   6,     36) =     105.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7608
                                                  Adj R-squared   =     0.7442
                                                  Within R-sq.    =     0.3010
Number of clusters (monitor_id) =         37      Root MSE        =     1.0918

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
   huanbao_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -.1279452   .3209797    -0.40   0.693    -.7789222    .5230318
       lngdp |   1.113185    .430554     2.59   0.014     .2399809    1.986389
         lnp |  -16.47788   1.200887   -13.72   0.000    -18.91339   -14.04237
    max_temp |   .1131451   .0765586     1.48   0.148     -.042123    .2684131
    min_temp |  -.0128877    .095002    -0.14   0.893    -.2055607    .1797852
     windpow |  -.1742829   .3798506    -0.46   0.649    -.9446557    .5960899
       _cons |   64.90958   5.304152    12.24   0.000     54.15226     75.6669
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_adj_huanbao_r

. reghdfe wuran_r dudt $cov if (hnhb==1|boundary==0)&(policy_city==1), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 12 iterations)

HDFE Linear regression                            Number of obs   =      1,665
Absorbing 3 HDFE groups                           F(   6,     36) =       6.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.3659
                                                  Adj R-squared   =     0.3219
                                                  Within R-sq.    =     0.0569
Number of clusters (monitor_id) =         37      Root MSE        =     1.3838

                            (Std. err. adjusted for 37 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     wuran_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |    -.22975   .7100603    -0.32   0.748    -1.669819    1.210319
       lngdp |   .1208008   .6275053     0.19   0.848    -1.151839     1.39344
         lnp |  -.6779359   2.155157    -0.31   0.755    -5.048796    3.692924
    max_temp |   .1736527   .1680386     1.03   0.308    -.1671455    .5144508
    min_temp |  -.3956965   .1783623    -2.22   0.033    -.7574321   -.0339609
     windpow |   1.704256   .4590704     3.71   0.001     .7732178    2.635294
       _cons |   3.903195   8.394965     0.46   0.645    -13.12258    20.92897
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        37          37           0    *|
          ym |        60           0          60     |
     winddir |         7           1           6     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store hnhb_adj_wuran_r

. 
. reghdfe huanjing dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =      3,279
Absorbing 3 HDFE groups                           F(   6,     67) =      12.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.7185
                                                  Adj R-squared   =     0.7055
                                                  Within R-sq.    =     0.0644
Number of clusters (monitor_id) =         68      Root MSE        =     3.8820

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
    huanjing | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |    -5.2118   .8295096    -6.28   0.000    -6.867508   -3.556092
       lngdp |   3.726534   2.433831     1.53   0.130    -1.131414    8.584481
         lnp |   3.063895   11.63171     0.26   0.793     -20.1531    26.28089
    max_temp |   .0294376   .1434288     0.21   0.838    -.2568475    .3157228
    min_temp |   -.294152   .2734404    -1.08   0.286    -.8399414    .2516373
     windpow |   2.510731   1.020191     2.46   0.016     .4744205    4.547041
       _cons |  -22.94414   42.07873    -0.55   0.587    -106.9336    61.04535
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_adj_huanjing 

. reghdfe huanbao dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =      3,279
Absorbing 3 HDFE groups                           F(   6,     67) =      14.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6706
                                                  Adj R-squared   =     0.6555
                                                  Within R-sq.    =     0.0947
Number of clusters (monitor_id) =         68      Root MSE        =     1.3006

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     huanbao | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -2.758511   .4015946    -6.87   0.000    -3.560098   -1.956925
       lngdp |   2.216059   .8802126     2.52   0.014     .4591476    3.972971
         lnp |   -8.46445    4.22521    -2.00   0.049      -16.898   -.0308966
    max_temp |  -.0272945   .0419606    -0.65   0.518    -.1110483    .0564593
    min_temp |  -.0121535   .0510547    -0.24   0.813    -.1140592    .0897522
     windpow |   .3061296   .2251456     1.36   0.178     -.143263    .7555221
       _cons |   25.81926   17.03298     1.52   0.134    -8.178715    59.81723
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_adj_huanbao

. reghdfe wuran dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =      3,279
Absorbing 3 HDFE groups                           F(   6,     67) =      33.03
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5081
                                                  Adj R-squared   =     0.4855
                                                  Within R-sq.    =     0.1130
Number of clusters (monitor_id) =         68      Root MSE        =     2.6058

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
       wuran | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -2.498209   .9400062    -2.66   0.010     -4.37447    -.621949
       lngdp |  -.0938018   2.320615    -0.04   0.968    -4.725769    4.538165
         lnp |   -22.1903    6.86905    -3.23   0.002    -35.90098   -8.479614
    max_temp |   .0976891   .1357818     0.72   0.474    -.1733324    .3687106
    min_temp |  -.0858744   .1701453    -0.50   0.615    -.4254858    .2537371
     windpow |   2.538992   .2677199     9.48   0.000     2.004621    3.073363
       _cons |   92.41517   26.48157     3.49   0.001     39.55773    145.2726
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_adj_wuran

. reghdfe huanjing_r dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =      3,279
Absorbing 3 HDFE groups                           F(   6,     67) =       8.95
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5855
                                                  Adj R-squared   =     0.5665
                                                  Within R-sq.    =     0.0409
Number of clusters (monitor_id) =         68      Root MSE        =     1.8496

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
  huanjing_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |   -2.05426   .3534015    -5.81   0.000    -2.759652   -1.348868
       lngdp |   1.754881   1.040103     1.69   0.096    -.3211738    3.830937
         lnp |  -8.534758   4.640909    -1.84   0.070    -17.79805    .7285344
    max_temp |  -.0198474   .0671651    -0.30   0.769    -.1539094    .1142147
    min_temp |  -.0253559   .1232605    -0.21   0.838    -.2713848    .2206729
     windpow |   .7230274   .4932821     1.47   0.147    -.2615679    1.707623
       _cons |   33.87818   17.81422     1.90   0.062    -1.679157    69.43553
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_adj_huanjing_r 

. reghdfe huanbao_r dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =      3,279
Absorbing 3 HDFE groups                           F(   6,     67) =      12.89
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.6564
                                                  Adj R-squared   =     0.6407
                                                  Within R-sq.    =     0.1071
Number of clusters (monitor_id) =         68      Root MSE        =     0.7177

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
   huanbao_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -1.566171   .2507014    -6.25   0.000    -2.066573   -1.065769
       lngdp |   1.063906   .6427975     1.66   0.103    -.2191234    2.346935
         lnp |  -6.146929    2.59849    -2.37   0.021    -11.33354   -.9603202
    max_temp |  -.0196216   .0248106    -0.79   0.432    -.0691439    .0299006
    min_temp |   .0162454   .0291648     0.56   0.579    -.0419678    .0744586
     windpow |   -.070422    .150752    -0.47   0.642    -.3713242    .2304802
       _cons |   22.15885   9.895971     2.24   0.028     2.406407    41.91129
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_adj_huanbao_r

. reghdfe wuran_r dudt $cov if (js==1|boundary==0)&(policy_city==0), absorb(monitor_id ym winddir) cluster(monitor_id)
(MWFE estimator converged in 13 iterations)

HDFE Linear regression                            Number of obs   =      3,279
Absorbing 3 HDFE groups                           F(   6,     67) =      12.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.5351
                                                  Adj R-squared   =     0.5137
                                                  Within R-sq.    =     0.1143
Number of clusters (monitor_id) =         68      Root MSE        =     1.3083

                            (Std. err. adjusted for 68 clusters in monitor_id)
------------------------------------------------------------------------------
             |               Robust
     wuran_r | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        dudt |  -1.542904   .4905989    -3.14   0.002    -2.522144    -.563665
       lngdp |  -.1312276    1.17562    -0.11   0.911    -2.477775     2.21532
         lnp |  -13.55504   3.569016    -3.80   0.000    -20.67882   -6.431252
    max_temp |   .0455855    .065933     0.69   0.492    -.0860174    .1771884
    min_temp |  -.0287196   .0780503    -0.37   0.714    -.1845087    .1270694
     windpow |   1.053246   .1619939     6.50   0.000     .7299047    1.376587
       _cons |   58.18433   13.99168     4.16   0.000     30.25682    86.11185
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  monitor_id |        68          68           0    *|
          ym |        60           0          60     |
     winddir |        12           1          11     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. est store js_adj_wuran_r

. 
. ** Panel A
. esttab hnhb_adj_*, mtitle se(%6.3f) b(%6.3f) ar2 star(* 0.1 ** 0.05 *** 0.01) keep(dudt)

------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)   
             hnhb_adj_h~g    hnhb_adj_h~o    hnhb_adj_w~n    hnhb_adj_h~r    hnhb_adj_h~r    hnhb_adj_w~r   
------------------------------------------------------------------------------------------------------------
dudt                3.405           0.052          -0.630           2.828*         -0.128          -0.230   
                  (2.474)         (0.420)         (0.996)         (1.648)         (0.321)         (0.710)   
------------------------------------------------------------------------------------------------------------
N                    1665            1665            1665            1665            1665            1665   
adj. R-sq           0.677           0.706           0.376           0.447           0.744           0.322   
------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. ** Panel B
. esttab js_adj_*, mtitle se(%6.3f) b(%6.3f) ar2 star(* 0.1 ** 0.05 *** 0.01) keep(dudt)

------------------------------------------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)             (5)             (6)   
             js_adj_hua~g    js_adj_hua~o    js_adj_wuran    js_adj_hua~r    js_adj_hua~r    js_adj_wur~r   
------------------------------------------------------------------------------------------------------------
dudt               -5.212***       -2.759***       -2.498***       -2.054***       -1.566***       -1.543***
                  (0.830)         (0.402)         (0.940)         (0.353)         (0.251)         (0.491)   
------------------------------------------------------------------------------------------------------------
N                    3279            3279            3279            3279            3279            3279   
adj. R-sq           0.706           0.655           0.485           0.566           0.641           0.514   
------------------------------------------------------------------------------------------------------------
Standard errors in parentheses
* p<0.1, ** p<0.05, *** p<0.01

. 
. 
. log close
      name:  <unnamed>
       log:  D:\Stata\Rep_folder\output_logs\TableA12.log
  log type:  text
 closed on:  20 Feb 2024, 01:27:07
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
